ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------

// Modified for use with SDCC in Sky Blue Learning "8-Bit Embedded"
// course.

#ifndef EFM8UB3_REGISTERS_H
#define EFM8UB3_REGISTERS_H

#include "efm8ub3.h"

//------------------------------------------------------------------------------
// ADC0AC Enums (ADC0 Accumulator Configuration @ 0xB3)
//------------------------------------------------------------------------------
#define ADC0AC_ADRPT__FMASK            0x07 ///< Repeat Count
#define ADC0AC_ADRPT__SHIFT            0x00 ///< Repeat Count
#define ADC0AC_ADRPT__ACC_1            0x00 ///< Perform and Accumulate 1 conversion (not used in
                                            ///< 12-bit mode).
#define ADC0AC_ADRPT__ACC_4            0x01 ///< Perform and Accumulate 4 conversions (1 conversion
                                            ///< in 12-bit mode).
#define ADC0AC_ADRPT__ACC_8            0x02 ///< Perform and Accumulate 8 conversions (2
                                            ///< conversions in 12-bit mode).
#define ADC0AC_ADRPT__ACC_16           0x03 ///< Perform and Accumulate 16 conversions (4
                                            ///< conversions in 12-bit mode).
#define ADC0AC_ADRPT__ACC_32           0x04 ///< Perform and Accumulate 32 conversions (8
                                            ///< conversions in 12-bit mode).
#define ADC0AC_ADRPT__ACC_64           0x05 ///< Perform and Accumulate 64 conversions (16
                                            ///< conversions in 12-bit mode).

#define ADC0AC_ADSJST__FMASK           0x38 ///< Accumulator Shift and Justify
#define ADC0AC_ADSJST__SHIFT           0x03 ///< Accumulator Shift and Justify
#define ADC0AC_ADSJST__RIGHT_NO_SHIFT  0x00 ///< Right justified. No shifting applied.
#define ADC0AC_ADSJST__RIGHT_SHIFT_1   0x08 ///< Right justified. Shifted right by 1 bit.
#define ADC0AC_ADSJST__RIGHT_SHIFT_2   0x10 ///< Right justified. Shifted right by 2 bits.
#define ADC0AC_ADSJST__RIGHT_SHIFT_3   0x18 ///< Right justified. Shifted right by 3 bits.
#define ADC0AC_ADSJST__LEFT_NO_SHIFT   0x20 ///< Left justified. No shifting applied.

#define ADC0AC_ADAE__BMASK             0x40 ///< Accumulate Enable
#define ADC0AC_ADAE__SHIFT             0x06 ///< Accumulate Enable
#define ADC0AC_ADAE__ACC_DISABLED      0x00 ///< ADC0H:ADC0L contain the result of the latest
                                            ///< conversion when Burst Mode is disabled.
#define ADC0AC_ADAE__ACC_ENABLED       0x40 ///< ADC0H:ADC0L contain the accumulated conversion
                                            ///< results when Burst Mode is disabled. Firmware must
                                            ///< write 0x0000 to ADC0H:ADC0L to clear the
                                            ///< accumulated result.

#define ADC0AC_AD12BE__BMASK           0x80 ///< 12-Bit Mode Enable
#define ADC0AC_AD12BE__SHIFT           0x07 ///< 12-Bit Mode Enable
#define ADC0AC_AD12BE__12_BIT_DISABLED 0x00 ///< Disable 12-bit mode.
#define ADC0AC_AD12BE__12_BIT_ENABLED  0x80 ///< Enable 12-bit mode.

//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_ADGN__BMASK         0x01 ///< Gain Control
#define ADC0CF_ADGN__SHIFT         0x00 ///< Gain Control
#define ADC0CF_ADGN__GAIN_0P5      0x00 ///< The on-chip PGA gain is 0.5.
#define ADC0CF_ADGN__GAIN_1        0x01 ///< The on-chip PGA gain is 1.

#define ADC0CF_ADTM__BMASK         0x02 ///< Track Mode
#define ADC0CF_ADTM__SHIFT         0x01 ///< Track Mode
#define ADC0CF_ADTM__TRACK_NORMAL  0x00 ///< Normal Track Mode. When ADC0 is enabled,
                                        ///< conversion begins immediately following the start-
                                        ///< of-conversion signal.
#define ADC0CF_ADTM__TRACK_DELAYED 0x02 ///< Delayed Track Mode. When ADC0 is enabled,
                                        ///< conversion begins 4 SAR clock cycles following the
                                        ///< start-of-conversion signal. The ADC is allowed to
                                        ///< track during this time.

#define ADC0CF_AD8BE__BMASK        0x04 ///< 8-Bit Mode Enable
#define ADC0CF_AD8BE__SHIFT        0x02 ///< 8-Bit Mode Enable
#define ADC0CF_AD8BE__NORMAL       0x00 ///< ADC0 operates in 10-bit or 12-bit mode (normal
                                        ///< operation).
#define ADC0CF_AD8BE__8_BIT        0x04 ///< ADC0 operates in 8-bit mode.

#define ADC0CF_ADSC__FMASK         0xF8 ///< SAR Clock Divider
#define ADC0CF_ADSC__SHIFT         0x03 ///< SAR Clock Divider

//------------------------------------------------------------------------------
// ADC0CN0 Enums (ADC0 Control 0 @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN0_ADWINT__BMASK          0x08 ///< Window Compare Interrupt Flag
#define ADC0CN0_ADWINT__SHIFT          0x03 ///< Window Compare Interrupt Flag
#define ADC0CN0_ADWINT__NOT_SET        0x00 ///< An ADC window compare event did not occur.
#define ADC0CN0_ADWINT__SET            0x08 ///< An ADC window compare event occurred.

#define ADC0CN0_ADBUSY__BMASK          0x10 ///< ADC Busy
#define ADC0CN0_ADBUSY__SHIFT          0x04 ///< ADC Busy
#define ADC0CN0_ADBUSY__NOT_SET        0x00 ///< An ADC0 conversion is not currently in progress.
#define ADC0CN0_ADBUSY__SET            0x10 ///< ADC0 conversion is in progress or start an ADC0
                                            ///< conversion.

#define ADC0CN0_ADINT__BMASK           0x20 ///< Conversion Complete Interrupt Flag
#define ADC0CN0_ADINT__SHIFT           0x05 ///< Conversion Complete Interrupt Flag
#define ADC0CN0_ADINT__NOT_SET         0x00 ///< ADC0 has not completed a conversion since the last
                                            ///< time ADINT was cleared.
#define ADC0CN0_ADINT__SET             0x20 ///< ADC0 completed a data conversion.

