ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define ADC0PWR_ADLPM__BMASK                 0x10 ///< Low Power Mode Enable
#define ADC0PWR_ADLPM__SHIFT                 0x04 ///< Low Power Mode Enable
#define ADC0PWR_ADLPM__LP_BUFFER_DISABLED    0x00 ///< Disable low power mode.
#define ADC0PWR_ADLPM__LP_BUFFER_ENABLED     0x10 ///< Enable low power mode (requires extended tracking
                                                  ///< time).

#define ADC0PWR_ADMXLP__BMASK                0x20 ///< Mux and Reference Low Power Mode Enable
#define ADC0PWR_ADMXLP__SHIFT                0x05 ///< Mux and Reference Low Power Mode Enable
#define ADC0PWR_ADMXLP__LP_MUX_VREF_DISABLED 0x00 ///< Low power mode disabled.
#define ADC0PWR_ADMXLP__LP_MUX_VREF_ENABLED  0x20 ///< Low power mode enabled (SAR clock < 4 MHz).

#define ADC0PWR_ADBIAS__FMASK                0xC0 ///< Bias Power Select
#define ADC0PWR_ADBIAS__SHIFT                0x06 ///< Bias Power Select
#define ADC0PWR_ADBIAS__MODE0                0x00 ///< Select bias current mode 0. Recommended to use
                                                  ///< modes 1, 2, or 3.
#define ADC0PWR_ADBIAS__MODE1                0x40 ///< Select bias current mode 1 (SARCLK <= 16 MHz).
#define ADC0PWR_ADBIAS__MODE2                0x80 ///< Select bias current mode 2.
#define ADC0PWR_ADBIAS__MODE3                0xC0 ///< Select bias current mode 3 (SARCLK <= 4 MHz).

//------------------------------------------------------------------------------
// ADC0TK Enums (ADC0 Burst Mode Track Time @ 0xB9)
//------------------------------------------------------------------------------
#define ADC0TK_ADTK__FMASK         0x3F ///< Burst Mode Tracking Time
#define ADC0TK_ADTK__SHIFT         0x00 ///< Burst Mode Tracking Time

#define ADC0TK_AD12SM__BMASK       0x80 ///< 12-Bit Sampling Mode
#define ADC0TK_AD12SM__SHIFT       0x07 ///< 12-Bit Sampling Mode
#define ADC0TK_AD12SM__SAMPLE_FOUR 0x00 ///< The ADC will re-track and sample the input four
                                        ///< times during a 12-bit conversion.
#define ADC0TK_AD12SM__SAMPLE_ONCE 0x80 ///< The ADC will sample the input once at the
                                        ///< beginning of each 12-bit conversion. The ADTK
                                        ///< field can be set to 63 to maximize throughput.

//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator

//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register

//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High

//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low

//------------------------------------------------------------------------------
// PFE0CN Enums (Prefetch Engine Control @ 0xC1)
//------------------------------------------------------------------------------
#define PFE0CN_FLRT__BMASK               0x10 ///< Flash Read Timing
#define PFE0CN_FLRT__SHIFT               0x04 ///< Flash Read Timing
#define PFE0CN_FLRT__SYSCLK_BELOW_25_MHZ 0x00 ///< SYSCLK < 25 MHz.
#define PFE0CN_FLRT__SYSCLK_BELOW_50_MHZ 0x10 ///< SYSCLK < 50 MHz.

//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even.
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.

#define PSW_F1__BMASK       0x02 ///< User Flag 1
#define PSW_F1__SHIFT       0x01 ///< User Flag 1
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.
#define PSW_F1__SET         0x02 ///< Flag is set.

#define PSW_OV__BMASK       0x04 ///< Overflow Flag
#define PSW_OV__SHIFT       0x02 ///< Overflow Flag
#define PSW_OV__NOT_SET     0x00 ///< An overflow did not occur.
#define PSW_OV__SET         0x04 ///< An overflow occurred.

#define PSW_RS__FMASK       0x18 ///< Register Bank Select
#define PSW_RS__SHIFT       0x03 ///< Register Bank Select
#define PSW_RS__BANK0       0x00 ///< Bank 0, Addresses 0x00-0x07
#define PSW_RS__BANK1       0x08 ///< Bank 1, Addresses 0x08-0x0F
#define PSW_RS__BANK2       0x10 ///< Bank 2, Addresses 0x10-0x17
#define PSW_RS__BANK3       0x18 ///< Bank 3, Addresses 0x18-0x1F

#define PSW_F0__BMASK       0x20 ///< User Flag 0
#define PSW_F0__SHIFT       0x05 ///< User Flag 0
#define PSW_F0__NOT_SET     0x00 ///< Flag is not set.
#define PSW_F0__SET         0x20 ///< Flag is set.

#define PSW_AC__BMASK       0x40 ///< Auxiliary Carry Flag
#define PSW_AC__SHIFT       0x06 ///< Auxiliary Carry Flag
#define PSW_AC__NOT_SET     0x00 ///< A carry into (addition) or borrow from
                                 ///< (subtraction) the high order nibble did not occur.
#define PSW_AC__SET         0x40 ///< A carry into (addition) or borrow from
                                 ///< (subtraction) the high order nibble occurred.

#define PSW_CY__BMASK       0x80 ///< Carry Flag
#define PSW_CY__SHIFT       0x07 ///< Carry Flag
#define PSW_CY__NOT_SET     0x00 ///< A carry (addition) or borrow (subtraction) did not
                                 ///< occur.
#define PSW_CY__SET         0x80 ///< A carry (addition) or borrow (subtraction)
                                 ///< occurred.

//------------------------------------------------------------------------------
// SP Enums (Stack Pointer @ 0x81)
//------------------------------------------------------------------------------
#define SP_SP__FMASK 0xFF ///< Stack Pointer
#define SP_SP__SHIFT 0x00 ///< Stack Pointer

//------------------------------------------------------------------------------
// CLKSEL Enums (Clock Select @ 0xA9)
//------------------------------------------------------------------------------
#define CLKSEL_CLKSL__FMASK           0x07 ///< Clock Source Select
#define CLKSEL_CLKSL__SHIFT           0x00 ///< Clock Source Select
#define CLKSEL_CLKSL__HFOSC0          0x00 ///< Clock derived from the Internal High Frequency
                                           ///< Oscillator 0.
#define CLKSEL_CLKSL__EXTOSC          0x01 ///< Clock derived from the External Oscillator
                                           ///< circuit.
#define CLKSEL_CLKSL__LFOSC           0x02 ///< Clock derived from the Internal Low-Frequency
                                           ///< Oscillator.
#define CLKSEL_CLKSL__HFOSC1          0x03 ///< Clock derived from the Internal High Frequency
                                           ///< Oscillator 1.
#define CLKSEL_CLKSL__HFOSC0_DIV_1P5  0x04 ///< Clock derived from the Internal High Frequency
                                           ///< Oscillator 0, pre-scaled by 1.5.
#define CLKSEL_CLKSL__HFOSC1_DIV_1P5  0x07 ///< Clock derived from the Internal High Frequency
                                           ///< Oscillator 1, pre-scaled by 1.5.

#define CLKSEL_CLKDIV__FMASK          0x70 ///< Clock Source Divider
#define CLKSEL_CLKDIV__SHIFT          0x04 ///< Clock Source Divider
#define CLKSEL_CLKDIV__SYSCLK_DIV_1   0x00 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 1.
#define CLKSEL_CLKDIV__SYSCLK_DIV_2   0x10 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 2.
#define CLKSEL_CLKDIV__SYSCLK_DIV_4   0x20 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 4.
#define CLKSEL_CLKDIV__SYSCLK_DIV_8   0x30 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 8.
#define CLKSEL_CLKDIV__SYSCLK_DIV_16  0x40 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 16.
#define CLKSEL_CLKDIV__SYSCLK_DIV_32  0x50 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 32.
#define CLKSEL_CLKDIV__SYSCLK_DIV_64  0x60 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 64.
#define CLKSEL_CLKDIV__SYSCLK_DIV_128 0x70 ///< SYSCLK is equal to selected clock source divided
                                           ///< by 128.

#define CLKSEL_DIVRDY__BMASK          0x80 ///< Clock Divider Ready
#define CLKSEL_DIVRDY__SHIFT          0x07 ///< Clock Divider Ready
#define CLKSEL_DIVRDY__NOT_READY      0x00 ///< Clock has not propagated through divider yet.
#define CLKSEL_DIVRDY__READY          0x80 ///< Clock has propagated through divider.

//------------------------------------------------------------------------------
// CLU0CF Enums (Configurable Logic Unit 0 Configuration @ 0xB1)
//------------------------------------------------------------------------------
#define CLU0CF_CLKSEL__FMASK     0x03 ///< CLU D flip-flop Clock Selection
#define CLU0CF_CLKSEL__SHIFT     0x00 ///< CLU D flip-flop Clock Selection
#define CLU0CF_CLKSEL__CARRY_IN  0x00 ///< The carry-in signal.
#define CLU0CF_CLKSEL__MXA_INPUT 0x01 ///< The MXA input.
#define CLU0CF_CLKSEL__ALTCLK0   0x02 ///< The alternate clock signal CLU0ALTCLK0.
#define CLU0CF_CLKSEL__ALTCLK1   0x03 ///< The alternate clock signal CLU0ALTCLK1.

