ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define CLU0CF_CLKINV__BMASK     0x04 ///< CLU D flip-flop Clock Invert
#define CLU0CF_CLKINV__SHIFT     0x02 ///< CLU D flip-flop Clock Invert
#define CLU0CF_CLKINV__NORMAL    0x00 ///< Clock signal is not inverted.
#define CLU0CF_CLKINV__INVERT    0x04 ///< Clock signal will be inverted.

#define CLU0CF_RST__BMASK        0x08 ///< CLU D flip-flop Reset
#define CLU0CF_RST__SHIFT        0x03 ///< CLU D flip-flop Reset
#define CLU0CF_RST__RESET        0x08 ///< Reset the flip flop.

#define CLU0CF_OEN__BMASK        0x40 ///< CLU Port Output Enable
#define CLU0CF_OEN__SHIFT        0x06 ///< CLU Port Output Enable
#define CLU0CF_OEN__DISABLE      0x00 ///< Disables asynchronous output to the selected GPIO
                                      ///< pin
#define CLU0CF_OEN__ENABLE       0x40 ///< Enables asynchronous output to the selected GPIO
                                      ///< pin

#define CLU0CF_OUTSEL__BMASK     0x80 ///< CLU Output Select
#define CLU0CF_OUTSEL__SHIFT     0x07 ///< CLU Output Select
#define CLU0CF_OUTSEL__D_FF      0x00 ///< Select D flip-flop output of CLU
#define CLU0CF_OUTSEL__LUT       0x80 ///< Select LUT output.

//------------------------------------------------------------------------------
// CLU0FN Enums (Configurable Logic Unit 0 Function Select @ 0xAD)
//------------------------------------------------------------------------------
#define CLU0FN_FNSEL__FMASK 0xFF ///< CLU Look-Up-Table function select
#define CLU0FN_FNSEL__SHIFT 0x00 ///< CLU Look-Up-Table function select

//------------------------------------------------------------------------------
// CLU0MX Enums (Configurable Logic Unit 0 Multiplexer @ 0x84)
//------------------------------------------------------------------------------
#define CLU0MX_MXB__FMASK   0x0F ///< CLU0 B Input Multiplexer Selection
#define CLU0MX_MXB__SHIFT   0x00 ///< CLU0 B Input Multiplexer Selection
#define CLU0MX_MXB__CLU0B0  0x00 ///< Select CLU0B.0
#define CLU0MX_MXB__CLU0B1  0x01 ///< Select CLU0B.1
#define CLU0MX_MXB__CLU0B2  0x02 ///< Select CLU0B.2
#define CLU0MX_MXB__CLU0B3  0x03 ///< Select CLU0B.3
#define CLU0MX_MXB__CLU0B4  0x04 ///< Select CLU0B.4
#define CLU0MX_MXB__CLU0B5  0x05 ///< Select CLU0B.5
#define CLU0MX_MXB__CLU0B6  0x06 ///< Select CLU0B.6
#define CLU0MX_MXB__CLU0B7  0x07 ///< Select CLU0B.7
#define CLU0MX_MXB__CLU0B8  0x08 ///< Select CLU0B.8
#define CLU0MX_MXB__CLU0B9  0x09 ///< Select CLU0B.9
#define CLU0MX_MXB__CLU0B10 0x0A ///< Select CLU0B.10
#define CLU0MX_MXB__CLU0B11 0x0B ///< Select CLU0B.11
#define CLU0MX_MXB__CLU0B12 0x0C ///< Select CLU0B.12
#define CLU0MX_MXB__CLU0B13 0x0D ///< Select CLU0B.13
#define CLU0MX_MXB__CLU0B14 0x0E ///< Select CLU0B.14
#define CLU0MX_MXB__CLU0B15 0x0F ///< Select CLU0B.15

#define CLU0MX_MXA__FMASK   0xF0 ///< CLU0 A Input Multiplexer Selection
#define CLU0MX_MXA__SHIFT   0x04 ///< CLU0 A Input Multiplexer Selection
#define CLU0MX_MXA__CLU0A0  0x00 ///< Select CLU0A.0
#define CLU0MX_MXA__CLU0A1  0x10 ///< Select CLU0A.1
#define CLU0MX_MXA__CLU0A2  0x20 ///< Select CLU0A.2
#define CLU0MX_MXA__CLU0A3  0x30 ///< Select CLU0A.3
#define CLU0MX_MXA__CLU0A4  0x40 ///< Select CLU0A.4
#define CLU0MX_MXA__CLU0A5  0x50 ///< Select CLU0A.5
#define CLU0MX_MXA__CLU0A6  0x60 ///< Select CLU0A.6
#define CLU0MX_MXA__CLU0A7  0x70 ///< Select CLU0A.7
#define CLU0MX_MXA__CLU0A8  0x80 ///< Select CLU0A.8
#define CLU0MX_MXA__CLU0A9  0x90 ///< Select CLU0A.9
#define CLU0MX_MXA__CLU0A10 0xA0 ///< Select CLU0A.10
#define CLU0MX_MXA__CLU0A11 0xB0 ///< Select CLU0A.11
#define CLU0MX_MXA__CLU0A12 0xC0 ///< Select CLU0A.12
#define CLU0MX_MXA__CLU0A13 0xD0 ///< Select CLU0A.13
#define CLU0MX_MXA__CLU0A14 0xE0 ///< Select CLU0A.14
#define CLU0MX_MXA__CLU0A15 0xF0 ///< Select CLU0A.15

//------------------------------------------------------------------------------
// CLU1CF Enums (Configurable Logic Unit 1 Configuration @ 0xBB)
//------------------------------------------------------------------------------
#define CLU1CF_CLKSEL__FMASK     0x03 ///< CLU D flip-flop Clock Selection
#define CLU1CF_CLKSEL__SHIFT     0x00 ///< CLU D flip-flop Clock Selection
#define CLU1CF_CLKSEL__CARRY_IN  0x00 ///< The carry-in signal.
#define CLU1CF_CLKSEL__MXA_INPUT 0x01 ///< The MXA input.
#define CLU1CF_CLKSEL__ALTCLK0   0x02 ///< The alternate clock signal CLU1ALTCLK0.
#define CLU1CF_CLKSEL__ALTCLK1   0x03 ///< The alternate clock signal CLU1ALTCLK1.

#define CLU1CF_CLKINV__BMASK     0x04 ///< CLU D flip-flop Clock Invert
#define CLU1CF_CLKINV__SHIFT     0x02 ///< CLU D flip-flop Clock Invert
#define CLU1CF_CLKINV__NORMAL    0x00 ///< Clock signal is not inverted.
#define CLU1CF_CLKINV__INVERT    0x04 ///< Clock signal will be inverted.

#define CLU1CF_RST__BMASK        0x08 ///< CLU D flip-flop Reset
#define CLU1CF_RST__SHIFT        0x03 ///< CLU D flip-flop Reset
#define CLU1CF_RST__RESET        0x08 ///< Reset the flip flop.

#define CLU1CF_OEN__BMASK        0x40 ///< CLU Port Output Enable
#define CLU1CF_OEN__SHIFT        0x06 ///< CLU Port Output Enable
#define CLU1CF_OEN__DISABLE      0x00 ///< Disables asynchronous output to the selected GPIO
                                      ///< pin
#define CLU1CF_OEN__ENABLE       0x40 ///< Enables asynchronous output to the selected GPIO
                                      ///< pin

#define CLU1CF_OUTSEL__BMASK     0x80 ///< CLU Output Select
#define CLU1CF_OUTSEL__SHIFT     0x07 ///< CLU Output Select
#define CLU1CF_OUTSEL__D_FF      0x00 ///< Select D flip-flop output of CLU
#define CLU1CF_OUTSEL__LUT       0x80 ///< Select LUT output.

//------------------------------------------------------------------------------
// CLU1FN Enums (Configurable Logic Unit 1 Function Select @ 0xB9)
//------------------------------------------------------------------------------
#define CLU1FN_FNSEL__FMASK 0xFF ///< CLU Look-Up-Table function select
#define CLU1FN_FNSEL__SHIFT 0x00 ///< CLU Look-Up-Table function select

//------------------------------------------------------------------------------
// CLU1MX Enums (Configurable Logic Unit 1 Multiplexer @ 0x85)
//------------------------------------------------------------------------------
#define CLU1MX_MXB__FMASK   0x0F ///< CLU1 B Input Multiplexer Selection
#define CLU1MX_MXB__SHIFT   0x00 ///< CLU1 B Input Multiplexer Selection
#define CLU1MX_MXB__CLU1B0  0x00 ///< Select CLU1B.0
#define CLU1MX_MXB__CLU1B1  0x01 ///< Select CLU1B.1
#define CLU1MX_MXB__CLU1B2  0x02 ///< Select CLU1B.2
#define CLU1MX_MXB__CLU1B3  0x03 ///< Select CLU1B.3
#define CLU1MX_MXB__CLU1B4  0x04 ///< Select CLU1B.4
#define CLU1MX_MXB__CLU1B5  0x05 ///< Select CLU1B.5
#define CLU1MX_MXB__CLU1B6  0x06 ///< Select CLU1B.6
#define CLU1MX_MXB__CLU1B7  0x07 ///< Select CLU1B.7
#define CLU1MX_MXB__CLU1B8  0x08 ///< Select CLU1B.8
#define CLU1MX_MXB__CLU1B9  0x09 ///< Select CLU1B.9
#define CLU1MX_MXB__CLU1B10 0x0A ///< Select CLU1B.10
#define CLU1MX_MXB__CLU1B11 0x0B ///< Select CLU1B.11
#define CLU1MX_MXB__CLU1B12 0x0C ///< Select CLU1B.12
#define CLU1MX_MXB__CLU1B13 0x0D ///< Select CLU1B.13
#define CLU1MX_MXB__CLU1B14 0x0E ///< Select CLU1B.14
#define CLU1MX_MXB__CLU1B15 0x0F ///< Select CLU1B.15

#define CLU1MX_MXA__FMASK   0xF0 ///< CLU1 A Input Multiplexer Selection
#define CLU1MX_MXA__SHIFT   0x04 ///< CLU1 A Input Multiplexer Selection
#define CLU1MX_MXA__CLU1A0  0x00 ///< Select CLU1A.0
#define CLU1MX_MXA__CLU1A1  0x10 ///< Select CLU1A.1
#define CLU1MX_MXA__CLU1A2  0x20 ///< Select CLU1A.2
#define CLU1MX_MXA__CLU1A3  0x30 ///< Select CLU1A.3
#define CLU1MX_MXA__CLU1A4  0x40 ///< Select CLU1A.4
#define CLU1MX_MXA__CLU1A5  0x50 ///< Select CLU1A.5
#define CLU1MX_MXA__CLU1A6  0x60 ///< Select CLU1A.6
#define CLU1MX_MXA__CLU1A7  0x70 ///< Select CLU1A.7
#define CLU1MX_MXA__CLU1A8  0x80 ///< Select CLU1A.8
#define CLU1MX_MXA__CLU1A9  0x90 ///< Select CLU1A.9
#define CLU1MX_MXA__CLU1A10 0xA0 ///< Select CLU1A.10
#define CLU1MX_MXA__CLU1A11 0xB0 ///< Select CLU1A.11
#define CLU1MX_MXA__CLU1A12 0xC0 ///< Select CLU1A.12
#define CLU1MX_MXA__CLU1A13 0xD0 ///< Select CLU1A.13
#define CLU1MX_MXA__CLU1A14 0xE0 ///< Select CLU1A.14
#define CLU1MX_MXA__CLU1A15 0xF0 ///< Select CLU1A.15

//------------------------------------------------------------------------------
// CLU2CF Enums (Configurable Logic Unit 2 Configuration @ 0xBD)
//------------------------------------------------------------------------------
#define CLU2CF_CLKSEL__FMASK     0x03 ///< CLU D flip-flop Clock Selection
#define CLU2CF_CLKSEL__SHIFT     0x00 ///< CLU D flip-flop Clock Selection
#define CLU2CF_CLKSEL__CARRY_IN  0x00 ///< The carry-in signal.
#define CLU2CF_CLKSEL__MXA_INPUT 0x01 ///< The MXA input.
#define CLU2CF_CLKSEL__ALTCLK0   0x02 ///< The alternate clock signal CLU2ALTCLK0.
#define CLU2CF_CLKSEL__ALTCLK1   0x03 ///< The alternate clock signal CLU2ALTCLK1.

#define CLU2CF_CLKINV__BMASK     0x04 ///< CLU D flip-flop Clock Invert
#define CLU2CF_CLKINV__SHIFT     0x02 ///< CLU D flip-flop Clock Invert
#define CLU2CF_CLKINV__NORMAL    0x00 ///< Clock signal is not inverted.
#define CLU2CF_CLKINV__INVERT    0x04 ///< Clock signal will be inverted.

#define CLU2CF_RST__BMASK        0x08 ///< CLU D flip-flop Reset
#define CLU2CF_RST__SHIFT        0x03 ///< CLU D flip-flop Reset
#define CLU2CF_RST__RESET        0x08 ///< Reset the flip flop.

