ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define CLIF0_C3RIF__BMASK   0x80 ///< CLU3 Rising Edge Flag
#define CLIF0_C3RIF__SHIFT   0x07 ///< CLU3 Rising Edge Flag
#define CLIF0_C3RIF__NOT_SET 0x00 ///< A CLU3 rising edge has not been detected since
                                  ///< this flag was last cleared.
#define CLIF0_C3RIF__SET     0x80 ///< A CLU3 rising edge (synchronized with SYSCLK) has
                                  ///< occurred. This bit must be cleared by firmware.

//------------------------------------------------------------------------------
// CLOUT0 Enums (Configurable Logic Output 0 @ 0xD9)
//------------------------------------------------------------------------------
#define CLOUT0_C0OUT__BMASK 0x01 ///< CLU0 Output State
#define CLOUT0_C0OUT__SHIFT 0x00 ///< CLU0 Output State

#define CLOUT0_C1OUT__BMASK 0x02 ///< CLU1 Output State
#define CLOUT0_C1OUT__SHIFT 0x01 ///< CLU1 Output State

#define CLOUT0_C2OUT__BMASK 0x04 ///< CLU2 Output State
#define CLOUT0_C2OUT__SHIFT 0x02 ///< CLU2 Output State

#define CLOUT0_C3OUT__BMASK 0x08 ///< CLU3 Output State
#define CLOUT0_C3OUT__SHIFT 0x03 ///< CLU3 Output State

//------------------------------------------------------------------------------
// CMP0CN0 Enums (Comparator 0 Control 0 @ 0x9B)
//------------------------------------------------------------------------------
#define CMP0CN0_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control
#define CMP0CN0_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control
#define CMP0CN0_CPHYN__DISABLED             0x00 ///< Negative Hysteresis disabled.
#define CMP0CN0_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.
#define CMP0CN0_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.
#define CMP0CN0_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).

#define CMP0CN0_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control
#define CMP0CN0_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control
#define CMP0CN0_CPHYP__DISABLED             0x00 ///< Positive Hysteresis disabled.
#define CMP0CN0_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.
#define CMP0CN0_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.
#define CMP0CN0_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).

#define CMP0CN0_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag
#define CMP0CN0_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag
#define CMP0CN0_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                 ///< flag was last cleared.
#define CMP0CN0_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.

#define CMP0CN0_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag
#define CMP0CN0_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag
#define CMP0CN0_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this
                                                 ///< flag was last cleared.
#define CMP0CN0_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.

#define CMP0CN0_CPOUT__BMASK                0x40 ///< Comparator Output State Flag
#define CMP0CN0_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag
#define CMP0CN0_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP0P < CP0N.
#define CMP0CN0_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP0P > CP0N.

#define CMP0CN0_CPEN__BMASK                 0x80 ///< Comparator Enable
#define CMP0CN0_CPEN__SHIFT                 0x07 ///< Comparator Enable
#define CMP0CN0_CPEN__DISABLED              0x00 ///< Comparator disabled.
#define CMP0CN0_CPEN__ENABLED               0x80 ///< Comparator enabled.

//------------------------------------------------------------------------------
// CMP0CN1 Enums (Comparator 0 Control 1 @ 0x99)
//------------------------------------------------------------------------------
#define CMP0CN1_DACLVL__FMASK   0x3F ///< Internal Comparator DAC Reference Level
#define CMP0CN1_DACLVL__SHIFT   0x00 ///< Internal Comparator DAC Reference Level

#define CMP0CN1_CPINH__BMASK    0x80 ///< Output Inhibit
#define CMP0CN1_CPINH__SHIFT    0x07 ///< Output Inhibit
#define CMP0CN1_CPINH__DISABLED 0x00 ///< The comparator output will always reflect the
                                     ///< input conditions.
#define CMP0CN1_CPINH__ENABLED  0x80 ///< The comparator output will hold state any time the
                                     ///< PCA CEX2 channel is low.

//------------------------------------------------------------------------------
// CMP0MD Enums (Comparator 0 Mode @ 0x9D)
//------------------------------------------------------------------------------
#define CMP0MD_CPMD__FMASK              0x03 ///< Comparator Mode Select
#define CMP0MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select
#define CMP0MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)
#define CMP0MD_CPMD__MODE1              0x01 ///< Mode 1
#define CMP0MD_CPMD__MODE2              0x02 ///< Mode 2
#define CMP0MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power
                                             ///< Consumption)

#define CMP0MD_INSL__FMASK              0x0C ///< Comparator Input Selection
#define CMP0MD_INSL__SHIFT              0x02 ///< Comparator Input Selection
#define CMP0MD_INSL__CMXP_CMXN          0x00 ///< Connect the comparator inputs directly to the
                                             ///< signals selected in the CMP0MX register. CMP+ is
                                             ///< selected by CMXP and CMP- is selected by CMXN. The
                                             ///< internal DAC is not active.
#define CMP0MD_INSL__CMXP_GND           0x04 ///< Connect the CMP+ input to the signal selected by
                                             ///< CMXP, and CMP- is connected to GND. The internal
                                             ///< DAC is not active.
#define CMP0MD_INSL__DAC_CMXN           0x08 ///< Connect the CMP+ input to the internal DAC output,
                                             ///< and CMP- is selected by CMXN. The internal DAC
                                             ///< uses the signal specified by CMXP as its full-
                                             ///< scale reference.
#define CMP0MD_INSL__CMXP_DAC           0x0C ///< Connect the CMP- input to the internal DAC output,
                                             ///< and CMP+ is selected by CMXP. The internal DAC
                                             ///< uses the signal specified by CMXN as its full-
                                             ///< scale reference.

#define CMP0MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable
#define CMP0MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable
#define CMP0MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled.
#define CMP0MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.

#define CMP0MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable
#define CMP0MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable
#define CMP0MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.
#define CMP0MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.

