ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define CMP0MD_CPINV__BMASK             0x40 ///< Output Inversion
#define CMP0MD_CPINV__SHIFT             0x06 ///< Output Inversion
#define CMP0MD_CPINV__NORMAL            0x00 ///< Output is not inverted.
#define CMP0MD_CPINV__INVERT            0x40 ///< Output is inverted.

#define CMP0MD_CPLOUT__BMASK            0x80 ///< Comparator Latched Output Flag
#define CMP0MD_CPLOUT__SHIFT            0x07 ///< Comparator Latched Output Flag
#define CMP0MD_CPLOUT__LOW              0x00 ///< Comparator output was logic low at last PCA
                                             ///< overflow.
#define CMP0MD_CPLOUT__HIGH             0x80 ///< Comparator output was logic high at last PCA
                                             ///< overflow.

//------------------------------------------------------------------------------
// CMP0MX Enums (Comparator 0 Multiplexer Selection @ 0x9F)
//------------------------------------------------------------------------------
#define CMP0MX_CMXP__FMASK   0x0F ///< Comparator Positive Input MUX Selection
#define CMP0MX_CMXP__SHIFT   0x00 ///< Comparator Positive Input MUX Selection
#define CMP0MX_CMXP__CMP0P0  0x00 ///< External pin CMP0P.0.
#define CMP0MX_CMXP__CMP0P1  0x01 ///< External pin CMP0P.1.
#define CMP0MX_CMXP__CMP0P2  0x02 ///< External pin CMP0P.2.
#define CMP0MX_CMXP__CMP0P3  0x03 ///< External pin CMP0P.3.
#define CMP0MX_CMXP__CMP0P4  0x04 ///< External pin CMP0P.4.
#define CMP0MX_CMXP__CMP0P5  0x05 ///< External pin CMP0P.5.
#define CMP0MX_CMXP__CMP0P6  0x06 ///< External pin CMP0P.6.
#define CMP0MX_CMXP__CMP0P7  0x07 ///< External pin CMP0P.7.
#define CMP0MX_CMXP__CMP0P8  0x08 ///< External pin CMP0P.8.
#define CMP0MX_CMXP__CMP0P9  0x09 ///< External pin CMP0P.9.
#define CMP0MX_CMXP__CMP0P10 0x0A ///< External pin CMP0P.10.
#define CMP0MX_CMXP__CMP0P11 0x0B ///< External pin CMP0P.11.
#define CMP0MX_CMXP__CMP0P12 0x0C ///< External pin CMP0P.12.
#define CMP0MX_CMXP__CMP0P15 0x0F ///< External pin CMP0P.15.

#define CMP0MX_CMXN__FMASK   0xF0 ///< Comparator Negative Input MUX Selection
#define CMP0MX_CMXN__SHIFT   0x04 ///< Comparator Negative Input MUX Selection
#define CMP0MX_CMXN__CMP0N0  0x00 ///< External pin CMP0N.0.
#define CMP0MX_CMXN__CMP0N1  0x10 ///< External pin CMP0N.1.
#define CMP0MX_CMXN__CMP0N2  0x20 ///< External pin CMP0N.2.
#define CMP0MX_CMXN__CMP0N3  0x30 ///< External pin CMP0N.3.
#define CMP0MX_CMXN__CMP0N4  0x40 ///< External pin CMP0N.4.
#define CMP0MX_CMXN__CMP0N5  0x50 ///< External pin CMP0N.5.
#define CMP0MX_CMXN__CMP0N6  0x60 ///< External pin CMP0N.6.
#define CMP0MX_CMXN__CMP0N7  0x70 ///< External pin CMP0N.7.
#define CMP0MX_CMXN__CMP0N8  0x80 ///< External pin CMP0N.8.
#define CMP0MX_CMXN__CMP0N9  0x90 ///< External pin CMP0N.9.
#define CMP0MX_CMXN__CMP0N10 0xA0 ///< External pin CMP0N.10.
#define CMP0MX_CMXN__CMP0N11 0xB0 ///< External pin CMP0N.11.
#define CMP0MX_CMXN__CMP0N12 0xC0 ///< External pin CMP0N.12.
#define CMP0MX_CMXN__CMP0N15 0xF0 ///< External pin CMP0N.15.

//------------------------------------------------------------------------------
// CMP1CN0 Enums (Comparator 1 Control 0 @ 0xBF)
//------------------------------------------------------------------------------
#define CMP1CN0_CPHYN__FMASK                0x03 ///< Comparator Negative Hysteresis Control
#define CMP1CN0_CPHYN__SHIFT                0x00 ///< Comparator Negative Hysteresis Control
#define CMP1CN0_CPHYN__DISABLED             0x00 ///< Negative Hysteresis disabled.
#define CMP1CN0_CPHYN__ENABLED_MODE1        0x01 ///< Negative Hysteresis = Hysteresis 1.
#define CMP1CN0_CPHYN__ENABLED_MODE2        0x02 ///< Negative Hysteresis = Hysteresis 2.
#define CMP1CN0_CPHYN__ENABLED_MODE3        0x03 ///< Negative Hysteresis = Hysteresis 3 (Maximum).

#define CMP1CN0_CPHYP__FMASK                0x0C ///< Comparator Positive Hysteresis Control
#define CMP1CN0_CPHYP__SHIFT                0x02 ///< Comparator Positive Hysteresis Control
#define CMP1CN0_CPHYP__DISABLED             0x00 ///< Positive Hysteresis disabled.
#define CMP1CN0_CPHYP__ENABLED_MODE1        0x04 ///< Positive Hysteresis = Hysteresis 1.
#define CMP1CN0_CPHYP__ENABLED_MODE2        0x08 ///< Positive Hysteresis = Hysteresis 2.
#define CMP1CN0_CPHYP__ENABLED_MODE3        0x0C ///< Positive Hysteresis = Hysteresis 3 (Maximum).

#define CMP1CN0_CPFIF__BMASK                0x10 ///< Comparator Falling-Edge Flag
#define CMP1CN0_CPFIF__SHIFT                0x04 ///< Comparator Falling-Edge Flag
#define CMP1CN0_CPFIF__NOT_SET              0x00 ///< No comparator falling edge has occurred since this
                                                 ///< flag was last cleared.
#define CMP1CN0_CPFIF__FALLING_EDGE         0x10 ///< Comparator falling edge has occurred.

#define CMP1CN0_CPRIF__BMASK                0x20 ///< Comparator Rising-Edge Flag
#define CMP1CN0_CPRIF__SHIFT                0x05 ///< Comparator Rising-Edge Flag
#define CMP1CN0_CPRIF__NOT_SET              0x00 ///< No comparator rising edge has occurred since this
                                                 ///< flag was last cleared.
#define CMP1CN0_CPRIF__RISING_EDGE          0x20 ///< Comparator rising edge has occurred.

#define CMP1CN0_CPOUT__BMASK                0x40 ///< Comparator Output State Flag
#define CMP1CN0_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag
#define CMP1CN0_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.
#define CMP1CN0_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.

#define CMP1CN0_CPEN__BMASK                 0x80 ///< Comparator Enable
#define CMP1CN0_CPEN__SHIFT                 0x07 ///< Comparator Enable
#define CMP1CN0_CPEN__DISABLED              0x00 ///< Comparator disabled.
#define CMP1CN0_CPEN__ENABLED               0x80 ///< Comparator enabled.

//------------------------------------------------------------------------------
// CMP1CN1 Enums (Comparator 1 Control 1 @ 0xAC)
//------------------------------------------------------------------------------
#define CMP1CN1_DACLVL__FMASK   0x3F ///< Internal Comparator DAC Reference Level
#define CMP1CN1_DACLVL__SHIFT   0x00 ///< Internal Comparator DAC Reference Level

#define CMP1CN1_CPINH__BMASK    0x80 ///< Output Inhibit
#define CMP1CN1_CPINH__SHIFT    0x07 ///< Output Inhibit
#define CMP1CN1_CPINH__DISABLED 0x00 ///< The comparator output will always reflect the
                                     ///< input conditions.
#define CMP1CN1_CPINH__ENABLED  0x80 ///< The comparator output will hold state any time the
                                     ///< PCA CEX2 channel is low.

//------------------------------------------------------------------------------
// CMP1MD Enums (Comparator 1 Mode @ 0xAB)
//------------------------------------------------------------------------------
#define CMP1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select
#define CMP1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select
#define CMP1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)
#define CMP1MD_CPMD__MODE1              0x01 ///< Mode 1
#define CMP1MD_CPMD__MODE2              0x02 ///< Mode 2
#define CMP1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power
                                             ///< Consumption)

#define CMP1MD_INSL__FMASK              0x0C ///< Comparator Input Selection
#define CMP1MD_INSL__SHIFT              0x02 ///< Comparator Input Selection
#define CMP1MD_INSL__CMXP_CMXN          0x00 ///< Connect the comparator inputs directly to the
                                             ///< signals selected in the CMP1MX register. CMP+ is
                                             ///< selected by CMXP and CMP- is selected by CMXN. The
                                             ///< internal DAC is not active.
#define CMP1MD_INSL__CMXP_GND           0x04 ///< Connect the CMP+ input to the signal selected by
                                             ///< CMXP, and CMP- is connected to GND. The internal
                                             ///< DAC is not active.
#define CMP1MD_INSL__DAC_CMXN           0x08 ///< Connect the CMP+ input to the internal DAC output,
                                             ///< and CMP- is selected by CMXN. The internal DAC
                                             ///< uses the signal specified by CMXP as its full-
                                             ///< scale reference.
#define CMP1MD_INSL__CMXP_DAC           0x0C ///< Connect the CMP- input to the internal DAC output,
                                             ///< and CMP+ is selected by CMXP. The internal DAC
                                             ///< uses the signal specified by CMXN as its full-
                                             ///< scale reference.

#define CMP1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable
#define CMP1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable
#define CMP1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled.
#define CMP1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.

#define CMP1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable
#define CMP1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable
#define CMP1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.
#define CMP1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.

