ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define IT01CF_IN0PL__BMASK       0x08 ///< INT0 Polarity
#define IT01CF_IN0PL__SHIFT       0x03 ///< INT0 Polarity
#define IT01CF_IN0PL__ACTIVE_LOW  0x00 ///< INT0 input is active low.
#define IT01CF_IN0PL__ACTIVE_HIGH 0x08 ///< INT0 input is active high.

#define IT01CF_IN1SL__FMASK       0x70 ///< INT1 Port Pin Selection
#define IT01CF_IN1SL__SHIFT       0x04 ///< INT1 Port Pin Selection
#define IT01CF_IN1SL__P0_0        0x00 ///< Select P0.0.
#define IT01CF_IN1SL__P0_1        0x10 ///< Select P0.1.
#define IT01CF_IN1SL__P0_2        0x20 ///< Select P0.2.
#define IT01CF_IN1SL__P0_3        0x30 ///< Select P0.3.
#define IT01CF_IN1SL__P0_4        0x40 ///< Select P0.4.
#define IT01CF_IN1SL__P0_5        0x50 ///< Select P0.5.
#define IT01CF_IN1SL__P0_6        0x60 ///< Select P0.6.
#define IT01CF_IN1SL__P0_7        0x70 ///< Select P0.7.

#define IT01CF_IN1PL__BMASK       0x80 ///< INT1 Polarity
#define IT01CF_IN1PL__SHIFT       0x07 ///< INT1 Polarity
#define IT01CF_IN1PL__ACTIVE_LOW  0x00 ///< INT1 input is active low.
#define IT01CF_IN1PL__ACTIVE_HIGH 0x80 ///< INT1 input is active high.

//------------------------------------------------------------------------------
// FLKEY Enums (Flash Lock and Key @ 0xB7)
//------------------------------------------------------------------------------
#define FLKEY_FLKEY__FMASK    0xFF ///< Flash Lock and Key
#define FLKEY_FLKEY__SHIFT    0x00 ///< Flash Lock and Key
#define FLKEY_FLKEY__LOCKED   0x00 ///< Flash is write/erase locked.
#define FLKEY_FLKEY__FIRST    0x01 ///< The first key code has been written (0xA5).
#define FLKEY_FLKEY__UNLOCKED 0x02 ///< Flash is unlocked (writes/erases allowed).
#define FLKEY_FLKEY__DISABLED 0x03 ///< Flash writes/erases are disabled until the next
                                   ///< reset.
#define FLKEY_FLKEY__KEY1     0xA5 ///< Flash writes and erases are enabled by writing
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.
#define FLKEY_FLKEY__KEY2     0xF1 ///< Flash writes and erases are enabled by writing
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.

//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK          0x01 ///< Program Store Write Enable
#define PSCTL_PSWE__SHIFT          0x00 ///< Program Store Write Enable
#define PSCTL_PSWE__WRITE_DISABLED 0x00 ///< Writes to flash program memory disabled.
#define PSCTL_PSWE__WRITE_ENABLED  0x01 ///< Writes to flash program memory enabled; the MOVX
                                        ///< write instruction targets flash memory.

#define PSCTL_PSEE__BMASK          0x02 ///< Program Store Erase Enable
#define PSCTL_PSEE__SHIFT          0x01 ///< Program Store Erase Enable
#define PSCTL_PSEE__ERASE_DISABLED 0x00 ///< Flash program memory erasure disabled.
#define PSCTL_PSEE__ERASE_ENABLED  0x02 ///< Flash program memory erasure enabled.

//------------------------------------------------------------------------------
// HFO0CAL Enums (High Frequency Oscillator 0 Calibration @ 0xC7)
//------------------------------------------------------------------------------
#define HFO0CAL_HFO0CAL__FMASK 0xFF ///< Oscillator Calibration
#define HFO0CAL_HFO0CAL__SHIFT 0x00 ///< Oscillator Calibration

//------------------------------------------------------------------------------
// HFO1CAL Enums (High Frequency Oscillator 1 Calibration @ 0xD6)
//------------------------------------------------------------------------------
#define HFO1CAL_HFO1CAL__FMASK 0x7F ///< Oscillator Calibration
#define HFO1CAL_HFO1CAL__SHIFT 0x00 ///< Oscillator Calibration

//------------------------------------------------------------------------------
// HFOCN Enums (High Frequency Oscillator Control @ 0xEF)
//------------------------------------------------------------------------------
#define HFOCN_HFO0EN__BMASK    0x08 ///< HFOSC0 Oscillator Enable
#define HFOCN_HFO0EN__SHIFT    0x03 ///< HFOSC0 Oscillator Enable
#define HFOCN_HFO0EN__DISABLED 0x00 ///< Disable High Frequency Oscillator 0 (HFOSC0 will
                                    ///< still turn on if requested by any block in the
                                    ///< device or selected as the SYSCLK source).
#define HFOCN_HFO0EN__ENABLED  0x08 ///< Force High Frequency Oscillator 0 to run.

#define HFOCN_HFO1EN__BMASK    0x80 ///< HFOSC1 Oscillator Enable
#define HFOCN_HFO1EN__SHIFT    0x07 ///< HFOSC1 Oscillator Enable
#define HFOCN_HFO1EN__DISABLED 0x00 ///< Disable High Frequency Oscillator 1 (HFOSC1 will
                                    ///< still turn on if requested by any block in the
                                    ///< device or selected as the SYSCLK source).
#define HFOCN_HFO1EN__ENABLED  0x80 ///< Force High Frequency Oscillator 1 to run.

//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.

#define EIE1_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable
#define EIE1_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.
#define EIE1_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port
                                   ///< Match.

#define EIE1_EWADC0__BMASK    0x04 ///< ADC0 Window Comparison Interrupt Enable
#define EIE1_EWADC0__SHIFT    0x02 ///< ADC0 Window Comparison Interrupt Enable
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.
#define EIE1_EWADC0__ENABLED  0x04 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).

#define EIE1_EADC0__BMASK     0x08 ///< ADC0 Conversion Complete Interrupt Enable
#define EIE1_EADC0__SHIFT     0x03 ///< ADC0 Conversion Complete Interrupt Enable
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.
#define EIE1_EADC0__ENABLED   0x08 ///< Enable interrupt requests generated by the ADINT
                                   ///< flag.

#define EIE1_EPCA0__BMASK     0x10 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.
#define EIE1_EPCA0__ENABLED   0x10 ///< Enable interrupt requests generated by PCA0.

#define EIE1_ECP0__BMASK      0x20 ///< Comparator0 (CP0) Interrupt Enable
#define EIE1_ECP0__SHIFT      0x05 ///< Comparator0 (CP0) Interrupt Enable
#define EIE1_ECP0__DISABLED   0x00 ///< Disable CP0 interrupts.
#define EIE1_ECP0__ENABLED    0x20 ///< Enable interrupt requests generated by the
                                   ///< comparator 0 CPRIF or CPFIF flags.

#define EIE1_ECP1__BMASK      0x40 ///< Comparator1 (CP1) Interrupt Enable
#define EIE1_ECP1__SHIFT      0x06 ///< Comparator1 (CP1) Interrupt Enable
#define EIE1_ECP1__DISABLED   0x00 ///< Disable CP1 interrupts.
#define EIE1_ECP1__ENABLED    0x40 ///< Enable interrupt requests generated by the
                                   ///< comparator 1 CPRIF or CPFIF flags.

