ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.

//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xCE)
//------------------------------------------------------------------------------
#define EIE2_EUSB0__BMASK    0x01 ///< USB (USB0) Interrupt Enable
#define EIE2_EUSB0__SHIFT    0x00 ///< USB (USB0) Interrupt Enable
#define EIE2_EUSB0__DISABLED 0x00 ///< Disable all USB0 interrupts.
#define EIE2_EUSB0__ENABLED  0x01 ///< Enable interrupt requests generated by USB0.

#define EIE2_EVBUS__BMASK    0x02 ///< VBUS and USB Charger Detect Interrupt
#define EIE2_EVBUS__SHIFT    0x01 ///< VBUS and USB Charger Detect Interrupt
#define EIE2_EVBUS__DISABLED 0x00 ///< Disable all VBUS and VBUS and USB Charger Detect
                                  ///< interrupts.
#define EIE2_EVBUS__ENABLED  0x02 ///< Enable interrupt requests generated by VBUS and
                                  ///< VBUS and USB Charger Detect.

#define EIE2_ET4__BMASK      0x04 ///< Timer 4 Interrupt Enable
#define EIE2_ET4__SHIFT      0x02 ///< Timer 4 Interrupt Enable
#define EIE2_ET4__DISABLED   0x00 ///< Disable Timer 4 interrupts.
#define EIE2_ET4__ENABLED    0x04 ///< Enable interrupt requests generated by the TF4L or
                                  ///< TF4H flags.

#define EIE2_ET5__BMASK      0x08 ///< Timer 5 Interrupt Enable
#define EIE2_ET5__SHIFT      0x03 ///< Timer 5 Interrupt Enable
#define EIE2_ET5__DISABLED   0x00 ///< Disable Timer 5 interrupts.
#define EIE2_ET5__ENABLED    0x08 ///< Enable interrupt requests generated by the TF5L or
                                  ///< TF5H flags.

#define EIE2_ECL0__BMASK     0x40 ///< Configurable Logic (CL0) Interrupt Enable
#define EIE2_ECL0__SHIFT     0x06 ///< Configurable Logic (CL0) Interrupt Enable
#define EIE2_ECL0__DISABLED  0x00 ///< Disable CL0 interrupts.
#define EIE2_ECL0__ENABLED   0x40 ///< Enable interrupt requests generated by CL0.

//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 Low @ 0xF3)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control LSB
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control LSB
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt priority LSB set to low.
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt priority LSB set to high.

#define EIP1_PMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control LSB
#define EIP1_PMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control LSB
#define EIP1_PMAT__LOW     0x00 ///< Port Match interrupt priority LSB set to low.
#define EIP1_PMAT__HIGH    0x02 ///< Port Match interrupt priority LSB set to high.

#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control LSB
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control LSB
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt priority LSB set to low.
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Window interrupt priority LSB set to high.

#define EIP1_PADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control LSB
#define EIP1_PADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control LSB
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority LSB
                                ///< set to low.
#define EIP1_PADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt priority LSB
                                ///< set to high.

#define EIP1_PPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt priority LSB set to low.
#define EIP1_PPCA0__HIGH   0x10 ///< PCA0 interrupt priority LSB set to high.

#define EIP1_PCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control LSB
#define EIP1_PCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control LSB
#define EIP1_PCP0__LOW     0x00 ///< CP0 interrupt priority LSB set to low.
#define EIP1_PCP0__HIGH    0x20 ///< CP0 interrupt priority LSB set to high.

#define EIP1_PCP1__BMASK   0x40 ///< Comparator1 (CP1) Interrupt Priority Control LSB
#define EIP1_PCP1__SHIFT   0x06 ///< Comparator1 (CP1) Interrupt Priority Control LSB
#define EIP1_PCP1__LOW     0x00 ///< CP1 interrupt priority LSB set to low.
#define EIP1_PCP1__HIGH    0x40 ///< CP1 interrupt priority LSB set to high.

#define EIP1_PT3__BMASK    0x80 ///< Timer 3 Interrupt Priority Control LSB
#define EIP1_PT3__SHIFT    0x07 ///< Timer 3 Interrupt Priority Control LSB
#define EIP1_PT3__LOW      0x00 ///< Timer 3 interrupt priority LSB set to low.
#define EIP1_PT3__HIGH     0x80 ///< Timer 3 interrupt priority LSB set to high.

//------------------------------------------------------------------------------
// EIP1H Enums (Extended Interrupt Priority 1 High @ 0xF5)
//------------------------------------------------------------------------------
#define EIP1H_PHSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control MSB
#define EIP1H_PHSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control MSB
#define EIP1H_PHSMB0__LOW    0x00 ///< SMB0 interrupt priority MSB set to low.
#define EIP1H_PHSMB0__HIGH   0x01 ///< SMB0 interrupt priority MSB set to high.

#define EIP1H_PHMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control MSB
#define EIP1H_PHMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control MSB
#define EIP1H_PHMAT__LOW     0x00 ///< Port Match interrupt priority MSB set to low.
#define EIP1H_PHMAT__HIGH    0x02 ///< Port Match interrupt priority MSB set to high.

