ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define IE_ES1__BMASK      0x10 ///< UART1 Interrupt Enable
#define IE_ES1__SHIFT      0x04 ///< UART1 Interrupt Enable
#define IE_ES1__DISABLED   0x00 ///< Disable UART1 interrupts.
#define IE_ES1__ENABLED    0x10 ///< Enable UART1 interrupts.

#define IE_ET2__BMASK      0x20 ///< Timer 2 Interrupt Enable
#define IE_ET2__SHIFT      0x05 ///< Timer 2 Interrupt Enable
#define IE_ET2__DISABLED   0x00 ///< Disable Timer 2 interrupt.
#define IE_ET2__ENABLED    0x20 ///< Enable interrupt requests generated by the TF2L or
                                ///< TF2H flags.

#define IE_ESPI0__BMASK    0x40 ///< SPI0 Interrupt Enable
#define IE_ESPI0__SHIFT    0x06 ///< SPI0 Interrupt Enable
#define IE_ESPI0__DISABLED 0x00 ///< Disable all SPI0 interrupts.
#define IE_ESPI0__ENABLED  0x40 ///< Enable interrupt requests generated by SPI0.

#define IE_EA__BMASK       0x80 ///< All Interrupts Enable
#define IE_EA__SHIFT       0x07 ///< All Interrupts Enable
#define IE_EA__DISABLED    0x00 ///< Disable all interrupt sources.
#define IE_EA__ENABLED     0x80 ///< Enable each interrupt according to its individual
                                ///< mask setting.

//------------------------------------------------------------------------------
// IP Enums (Interrupt Priority @ 0xB8)
//------------------------------------------------------------------------------
#define IP_PX0__BMASK   0x01 ///< External Interrupt 0 Priority Control LSB
#define IP_PX0__SHIFT   0x00 ///< External Interrupt 0 Priority Control LSB
#define IP_PX0__LOW     0x00 ///< External Interrupt 0 priority LSB set to low.
#define IP_PX0__HIGH    0x01 ///< External Interrupt 0 priority LSB set to high.

#define IP_PT0__BMASK   0x02 ///< Timer 0 Interrupt Priority Control LSB
#define IP_PT0__SHIFT   0x01 ///< Timer 0 Interrupt Priority Control LSB
#define IP_PT0__LOW     0x00 ///< Timer 0 interrupt priority LSB set to low.
#define IP_PT0__HIGH    0x02 ///< Timer 0 interrupt priority LSB set to high.

#define IP_PX1__BMASK   0x04 ///< External Interrupt 1 Priority Control LSB
#define IP_PX1__SHIFT   0x02 ///< External Interrupt 1 Priority Control LSB
#define IP_PX1__LOW     0x00 ///< External Interrupt 1 priority LSB set to low.
#define IP_PX1__HIGH    0x04 ///< External Interrupt 1 priority LSB set to high.

#define IP_PT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control LSB
#define IP_PT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control LSB
#define IP_PT1__LOW     0x00 ///< Timer 1 interrupt priority LSB set to low.
#define IP_PT1__HIGH    0x08 ///< Timer 1 interrupt priority LSB set to high.

#define IP_PS1__BMASK   0x10 ///< UART1 Interrupt Priority Control LSB
#define IP_PS1__SHIFT   0x04 ///< UART1 Interrupt Priority Control LSB
#define IP_PS1__LOW     0x00 ///< UART1 interrupt priority LSB set to low.
#define IP_PS1__HIGH    0x10 ///< UART1 interrupt priority LSB set to high.

#define IP_PT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control LSB
#define IP_PT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control LSB
#define IP_PT2__LOW     0x00 ///< Timer 2 interrupt priority LSB set to low.
#define IP_PT2__HIGH    0x20 ///< Timer 2 interrupt priority LSB set to high.

#define IP_PSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control LSB
#define IP_PSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control LSB
#define IP_PSPI0__LOW   0x00 ///< SPI0 interrupt priority LSB set to low.
#define IP_PSPI0__HIGH  0x40 ///< SPI0 interrupt priority LSB set to high.

//------------------------------------------------------------------------------
// IPH Enums (Interrupt Priority High @ 0xF2)
//------------------------------------------------------------------------------
#define IPH_PHX0__BMASK   0x01 ///< External Interrupt 0 Priority Control MSB
#define IPH_PHX0__SHIFT   0x00 ///< External Interrupt 0 Priority Control MSB
#define IPH_PHX0__LOW     0x00 ///< External Interrupt 0 priority MSB set to low.
#define IPH_PHX0__HIGH    0x01 ///< External Interrupt 0 priority MSB set to high.

#define IPH_PHT0__BMASK   0x02 ///< Timer 0 Interrupt Priority Control MSB
#define IPH_PHT0__SHIFT   0x01 ///< Timer 0 Interrupt Priority Control MSB
#define IPH_PHT0__LOW     0x00 ///< Timer 0 interrupt priority MSB set to low.
#define IPH_PHT0__HIGH    0x02 ///< Timer 0 interrupt priority MSB set to high.

#define IPH_PHX1__BMASK   0x04 ///< External Interrupt 1 Priority Control MSB
#define IPH_PHX1__SHIFT   0x02 ///< External Interrupt 1 Priority Control MSB
#define IPH_PHX1__LOW     0x00 ///< External Interrupt 1 priority MSB set to low.
#define IPH_PHX1__HIGH    0x04 ///< External Interrupt 1 priority MSB set to high.

#define IPH_PHT1__BMASK   0x08 ///< Timer 1 Interrupt Priority Control MSB
#define IPH_PHT1__SHIFT   0x03 ///< Timer 1 Interrupt Priority Control MSB
#define IPH_PHT1__LOW     0x00 ///< Timer 1 interrupt priority MSB set to low.
#define IPH_PHT1__HIGH    0x08 ///< Timer 1 interrupt priority MSB set to high.

#define IPH_PHS1__BMASK   0x10 ///< UART1 Interrupt Priority Control MSB
#define IPH_PHS1__SHIFT   0x04 ///< UART1 Interrupt Priority Control MSB
#define IPH_PHS1__LOW     0x00 ///< UART1 interrupt priority MSB set to low.
#define IPH_PHS1__HIGH    0x10 ///< UART1 interrupt priority MSB set to high.

#define IPH_PHT2__BMASK   0x20 ///< Timer 2 Interrupt Priority Control MSB
#define IPH_PHT2__SHIFT   0x05 ///< Timer 2 Interrupt Priority Control MSB
#define IPH_PHT2__LOW     0x00 ///< Timer 2 interrupt priority MSB set to low.
#define IPH_PHT2__HIGH    0x20 ///< Timer 2 interrupt priority MSB set to high.

#define IPH_PHSPI0__BMASK 0x40 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control MSB
#define IPH_PHSPI0__SHIFT 0x06 ///< Serial Peripheral Interface (SPI0) Interrupt Priority Control MSB
#define IPH_PHSPI0__LOW   0x00 ///< SPI0 interrupt priority MSB set to low.
#define IPH_PHSPI0__HIGH  0x40 ///< SPI0 interrupt priority MSB set to high.

//------------------------------------------------------------------------------
// LFO0CN Enums (Low Frequency Oscillator Control @ 0xB1)
//------------------------------------------------------------------------------
#define LFO0CN_OSCLD__FMASK       0x03 ///< Internal L-F Oscillator Divider Select
#define LFO0CN_OSCLD__SHIFT       0x00 ///< Internal L-F Oscillator Divider Select
#define LFO0CN_OSCLD__DIVIDE_BY_8 0x00 ///< Divide by 8 selected.
#define LFO0CN_OSCLD__DIVIDE_BY_4 0x01 ///< Divide by 4 selected.
#define LFO0CN_OSCLD__DIVIDE_BY_2 0x02 ///< Divide by 2 selected.
#define LFO0CN_OSCLD__DIVIDE_BY_1 0x03 ///< Divide by 1 selected.

