ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define LFO0CN_OSCLF__FMASK       0x3C ///< Internal L-F Oscillator Frequency Control
#define LFO0CN_OSCLF__SHIFT       0x02 ///< Internal L-F Oscillator Frequency Control

#define LFO0CN_OSCLRDY__BMASK     0x40 ///< Internal L-F Oscillator Ready
#define LFO0CN_OSCLRDY__SHIFT     0x06 ///< Internal L-F Oscillator Ready
#define LFO0CN_OSCLRDY__NOT_SET   0x00 ///< Internal L-F Oscillator frequency not stabilized.
#define LFO0CN_OSCLRDY__SET       0x40 ///< Internal L-F Oscillator frequency stabilized.

#define LFO0CN_OSCLEN__BMASK      0x80 ///< Internal L-F Oscillator Enable
#define LFO0CN_OSCLEN__SHIFT      0x07 ///< Internal L-F Oscillator Enable
#define LFO0CN_OSCLEN__DISABLED   0x00 ///< Internal L-F Oscillator Disabled.
#define LFO0CN_OSCLEN__ENABLED    0x80 ///< Internal L-F Oscillator Enabled.

//------------------------------------------------------------------------------
// PRTDRV Enums (Port Drive Strength @ 0xF6)
//------------------------------------------------------------------------------
#define PRTDRV_P0DRV__BMASK      0x01 ///< Port 0 Drive Strength
#define PRTDRV_P0DRV__SHIFT      0x00 ///< Port 0 Drive Strength
#define PRTDRV_P0DRV__LOW_DRIVE  0x00 ///< All pins on P0 use low drive strength.
#define PRTDRV_P0DRV__HIGH_DRIVE 0x01 ///< All pins on P0 use high drive strength.

#define PRTDRV_P1DRV__BMASK      0x02 ///< Port 1 Drive Strength
#define PRTDRV_P1DRV__SHIFT      0x01 ///< Port 1 Drive Strength
#define PRTDRV_P1DRV__LOW_DRIVE  0x00 ///< All pins on P1 use low drive strength.
#define PRTDRV_P1DRV__HIGH_DRIVE 0x02 ///< All pins on P1 use high drive strength.

#define PRTDRV_P2DRV__BMASK      0x04 ///< Port 2 Drive Strength
#define PRTDRV_P2DRV__SHIFT      0x02 ///< Port 2 Drive Strength
#define PRTDRV_P2DRV__LOW_DRIVE  0x00 ///< All pins on P2 use low drive strength.
#define PRTDRV_P2DRV__HIGH_DRIVE 0x04 ///< All pins on P2 use high drive strength.

//------------------------------------------------------------------------------
// XBR0 Enums (Port I/O Crossbar 0 @ 0xE1)
//------------------------------------------------------------------------------
#define XBR0_URT1EL__BMASK    0x01 ///< UART1 I/O Legacy Enable
#define XBR0_URT1EL__SHIFT    0x00 ///< UART1 I/O Legacy Enable
#define XBR0_URT1EL__DISABLED 0x00 ///< UART1 I/O unavailable at Port pin.
#define XBR0_URT1EL__ENABLED  0x01 ///< UART1 TX0, RX0 routed to Port pins P0.4 and P0.5.

#define XBR0_SPI0E__BMASK     0x02 ///< SPI I/O Enable
#define XBR0_SPI0E__SHIFT     0x01 ///< SPI I/O Enable
#define XBR0_SPI0E__DISABLED  0x00 ///< SPI I/O unavailable at Port pins.
#define XBR0_SPI0E__ENABLED   0x02 ///< SPI I/O routed to Port pins. The SPI can be
                                   ///< assigned either 3 or 4 GPIO pins.

#define XBR0_SMB0E__BMASK     0x04 ///< SMB0 I/O Enable
#define XBR0_SMB0E__SHIFT     0x02 ///< SMB0 I/O Enable
#define XBR0_SMB0E__DISABLED  0x00 ///< SMBus 0 I/O unavailable at Port pins.
#define XBR0_SMB0E__ENABLED   0x04 ///< SMBus 0 I/O routed to Port pins.

#define XBR0_CP0E__BMASK      0x08 ///< Comparator0 Output Enable
#define XBR0_CP0E__SHIFT      0x03 ///< Comparator0 Output Enable
#define XBR0_CP0E__DISABLED   0x00 ///< CP0 unavailable at Port pin.
#define XBR0_CP0E__ENABLED    0x08 ///< CP0 routed to Port pin.

#define XBR0_CP0AE__BMASK     0x10 ///< Comparator0 Asynchronous Output Enable
#define XBR0_CP0AE__SHIFT     0x04 ///< Comparator0 Asynchronous Output Enable
#define XBR0_CP0AE__DISABLED  0x00 ///< Asynchronous CP0 unavailable at Port pin.
#define XBR0_CP0AE__ENABLED   0x10 ///< Asynchronous CP0 routed to Port pin.

#define XBR0_CP1E__BMASK      0x20 ///< Comparator1 Output Enable
#define XBR0_CP1E__SHIFT      0x05 ///< Comparator1 Output Enable
#define XBR0_CP1E__DISABLED   0x00 ///< CP1 unavailable at Port pin.
#define XBR0_CP1E__ENABLED    0x20 ///< CP1 routed to Port pin.

#define XBR0_CP1AE__BMASK     0x40 ///< Comparator1 Asynchronous Output Enable
#define XBR0_CP1AE__SHIFT     0x06 ///< Comparator1 Asynchronous Output Enable
#define XBR0_CP1AE__DISABLED  0x00 ///< Asynchronous CP1 unavailable at Port pin.
#define XBR0_CP1AE__ENABLED   0x40 ///< Asynchronous CP1 routed to Port pin.

#define XBR0_SYSCKE__BMASK    0x80 ///< SYSCLK Output Enable
#define XBR0_SYSCKE__SHIFT    0x07 ///< SYSCLK Output Enable
#define XBR0_SYSCKE__DISABLED 0x00 ///< SYSCLK unavailable at Port pin.
#define XBR0_SYSCKE__ENABLED  0x80 ///< SYSCLK output routed to Port pin.

//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_PCA0ME__FMASK          0x03 ///< PCA Module I/O Enable
#define XBR1_PCA0ME__SHIFT          0x00 ///< PCA Module I/O Enable
#define XBR1_PCA0ME__DISABLED       0x00 ///< All PCA I/O unavailable at Port pins.
#define XBR1_PCA0ME__CEX0           0x01 ///< CEX0 routed to Port pin.
#define XBR1_PCA0ME__CEX0_CEX1      0x02 ///< CEX0, CEX1 routed to Port pins.
#define XBR1_PCA0ME__CEX0_CEX1_CEX2 0x03 ///< CEX0, CEX1, CEX2 routed to Port pins.

#define XBR1_ECIE__BMASK            0x04 ///< PCA0 External Counter Input Enable
#define XBR1_ECIE__SHIFT            0x02 ///< PCA0 External Counter Input Enable
#define XBR1_ECIE__DISABLED         0x00 ///< ECI unavailable at Port pin.
#define XBR1_ECIE__ENABLED          0x04 ///< ECI routed to Port pin.

#define XBR1_T0E__BMASK             0x08 ///< T0 Enable
#define XBR1_T0E__SHIFT             0x03 ///< T0 Enable
#define XBR1_T0E__DISABLED          0x00 ///< T0 unavailable at Port pin.
#define XBR1_T0E__ENABLED           0x08 ///< T0 routed to Port pin.

#define XBR1_T1E__BMASK             0x10 ///< T1 Enable
#define XBR1_T1E__SHIFT             0x04 ///< T1 Enable
#define XBR1_T1E__DISABLED          0x00 ///< T1 unavailable at Port pin.
#define XBR1_T1E__ENABLED           0x10 ///< T1 routed to Port pin.

#define XBR1_T2E__BMASK             0x20 ///< T2 Enable
#define XBR1_T2E__SHIFT             0x05 ///< T2 Enable
#define XBR1_T2E__DISABLED          0x00 ///< T2 unavailable at Port pin.
#define XBR1_T2E__ENABLED           0x20 ///< T2 routed to Port pin.

//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xE3)
//------------------------------------------------------------------------------
#define XBR2_URT1E__BMASK               0x01 ///< UART1 I/O Enable
#define XBR2_URT1E__SHIFT               0x00 ///< UART1 I/O Enable
#define XBR2_URT1E__DISABLED            0x00 ///< UART1 I/O unavailable at Port pin.
#define XBR2_URT1E__ENABLED             0x01 ///< UART1 TX1 RX1 routed to Port pins.

#define XBR2_URT1RTSE__BMASK            0x02 ///< UART1 RTS Output Enable
#define XBR2_URT1RTSE__SHIFT            0x01 ///< UART1 RTS Output Enable
#define XBR2_URT1RTSE__DISABLED         0x00 ///< UART1 RTS1 unavailable at Port pin.
#define XBR2_URT1RTSE__ENABLED          0x02 ///< UART1 RTS1 routed to Port pin.

#define XBR2_URT1CTSE__BMASK            0x04 ///< UART1 CTS Input Enable
#define XBR2_URT1CTSE__SHIFT            0x02 ///< UART1 CTS Input Enable
#define XBR2_URT1CTSE__DISABLED         0x00 ///< UART1 CTS1 unavailable at Port pin.
#define XBR2_URT1CTSE__ENABLED          0x04 ///< UART1 CTS1 routed to Port pin.

#define XBR2_XBARE__BMASK               0x40 ///< Crossbar Enable
#define XBR2_XBARE__SHIFT               0x06 ///< Crossbar Enable
#define XBR2_XBARE__DISABLED            0x00 ///< Crossbar disabled.
#define XBR2_XBARE__ENABLED             0x40 ///< Crossbar enabled.

