ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define XBR2_WEAKPUD__BMASK             0x80 ///< Port I/O Weak Pullup Disable
#define XBR2_WEAKPUD__SHIFT             0x07 ///< Port I/O Weak Pullup Disable
#define XBR2_WEAKPUD__PULL_UPS_ENABLED  0x00 ///< Weak Pullups enabled (except for Ports whose I/O
                                             ///< are configured for analog mode).
#define XBR2_WEAKPUD__PULL_UPS_DISABLED 0x80 ///< Weak Pullups disabled.

//------------------------------------------------------------------------------
// PCA0CPH0 Enums (PCA Channel 0 Capture Module High Byte @ 0xFC)
//------------------------------------------------------------------------------
#define PCA0CPH0_PCA0CPH0__FMASK 0xFF ///< PCA Channel 0 Capture Module High Byte
#define PCA0CPH0_PCA0CPH0__SHIFT 0x00 ///< PCA Channel 0 Capture Module High Byte

//------------------------------------------------------------------------------
// PCA0CPL0 Enums (PCA Channel 0 Capture Module Low Byte @ 0xFB)
//------------------------------------------------------------------------------
#define PCA0CPL0_PCA0CPL0__FMASK 0xFF ///< PCA Channel 0 Capture Module Low Byte
#define PCA0CPL0_PCA0CPL0__SHIFT 0x00 ///< PCA Channel 0 Capture Module Low Byte

//------------------------------------------------------------------------------
// PCA0CPM0 Enums (PCA Channel 0 Capture/Compare Mode @ 0xDA)
//------------------------------------------------------------------------------
#define PCA0CPM0_ECCF__BMASK    0x01 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__SHIFT    0x00 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__DISABLED 0x00 ///< Disable CCF0 interrupts.
#define PCA0CPM0_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF0 is set.

#define PCA0CPM0_PWM__BMASK     0x02 ///< Channel 0 Pulse Width Modulation Mode Enable
#define PCA0CPM0_PWM__SHIFT     0x01 ///< Channel 0 Pulse Width Modulation Mode Enable
#define PCA0CPM0_PWM__DISABLED  0x00 ///< Disable PWM function.
#define PCA0CPM0_PWM__ENABLED   0x02 ///< Enable PWM function.

#define PCA0CPM0_TOG__BMASK     0x04 ///< Channel 0 Toggle Function Enable
#define PCA0CPM0_TOG__SHIFT     0x02 ///< Channel 0 Toggle Function Enable
#define PCA0CPM0_TOG__DISABLED  0x00 ///< Disable toggle function.
#define PCA0CPM0_TOG__ENABLED   0x04 ///< Enable toggle function.

#define PCA0CPM0_MAT__BMASK     0x08 ///< Channel 0 Match Function Enable
#define PCA0CPM0_MAT__SHIFT     0x03 ///< Channel 0 Match Function Enable
#define PCA0CPM0_MAT__DISABLED  0x00 ///< Disable match function.
#define PCA0CPM0_MAT__ENABLED   0x08 ///< Enable match function.

#define PCA0CPM0_CAPN__BMASK    0x10 ///< Channel 0 Capture Negative Function Enable
#define PCA0CPM0_CAPN__SHIFT    0x04 ///< Channel 0 Capture Negative Function Enable
#define PCA0CPM0_CAPN__DISABLED 0x00 ///< Disable negative edge capture.
#define PCA0CPM0_CAPN__ENABLED  0x10 ///< Enable negative edge capture.

#define PCA0CPM0_CAPP__BMASK    0x20 ///< Channel 0 Capture Positive Function Enable
#define PCA0CPM0_CAPP__SHIFT    0x05 ///< Channel 0 Capture Positive Function Enable
#define PCA0CPM0_CAPP__DISABLED 0x00 ///< Disable positive edge capture.
#define PCA0CPM0_CAPP__ENABLED  0x20 ///< Enable positive edge capture.

#define PCA0CPM0_ECOM__BMASK    0x40 ///< Channel 0 Comparator Function Enable
#define PCA0CPM0_ECOM__SHIFT    0x06 ///< Channel 0 Comparator Function Enable
#define PCA0CPM0_ECOM__DISABLED 0x00 ///< Disable comparator function.
#define PCA0CPM0_ECOM__ENABLED  0x40 ///< Enable comparator function.

#define PCA0CPM0_PWM16__BMASK   0x80 ///< Channel 0 16-bit Pulse Width Modulation Enable
#define PCA0CPM0_PWM16__SHIFT   0x07 ///< Channel 0 16-bit Pulse Width Modulation Enable
#define PCA0CPM0_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.
#define PCA0CPM0_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.

//------------------------------------------------------------------------------
// PCA0CPH1 Enums (PCA Channel 1 Capture Module High Byte @ 0xEA)
//------------------------------------------------------------------------------
#define PCA0CPH1_PCA0CPH1__FMASK 0xFF ///< PCA Channel 1 Capture Module High Byte
#define PCA0CPH1_PCA0CPH1__SHIFT 0x00 ///< PCA Channel 1 Capture Module High Byte

//------------------------------------------------------------------------------
// PCA0CPL1 Enums (PCA Channel 1 Capture Module Low Byte @ 0xE9)
//------------------------------------------------------------------------------
#define PCA0CPL1_PCA0CPL1__FMASK 0xFF ///< PCA Channel 1 Capture Module Low Byte
#define PCA0CPL1_PCA0CPL1__SHIFT 0x00 ///< PCA Channel 1 Capture Module Low Byte

//------------------------------------------------------------------------------
// PCA0CPM1 Enums (PCA Channel 1 Capture/Compare Mode @ 0xDB)
//------------------------------------------------------------------------------
#define PCA0CPM1_ECCF__BMASK    0x01 ///< Channel 1 Capture/Compare Flag Interrupt Enable
#define PCA0CPM1_ECCF__SHIFT    0x00 ///< Channel 1 Capture/Compare Flag Interrupt Enable
#define PCA0CPM1_ECCF__DISABLED 0x00 ///< Disable CCF1 interrupts.
#define PCA0CPM1_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF1 is set.

#define PCA0CPM1_PWM__BMASK     0x02 ///< Channel 1 Pulse Width Modulation Mode Enable
#define PCA0CPM1_PWM__SHIFT     0x01 ///< Channel 1 Pulse Width Modulation Mode Enable
#define PCA0CPM1_PWM__DISABLED  0x00 ///< Disable PWM function.
#define PCA0CPM1_PWM__ENABLED   0x02 ///< Enable PWM function.

#define PCA0CPM1_TOG__BMASK     0x04 ///< Channel 1 Toggle Function Enable
#define PCA0CPM1_TOG__SHIFT     0x02 ///< Channel 1 Toggle Function Enable
#define PCA0CPM1_TOG__DISABLED  0x00 ///< Disable toggle function.
#define PCA0CPM1_TOG__ENABLED   0x04 ///< Enable toggle function.

#define PCA0CPM1_MAT__BMASK     0x08 ///< Channel 1 Match Function Enable
#define PCA0CPM1_MAT__SHIFT     0x03 ///< Channel 1 Match Function Enable
#define PCA0CPM1_MAT__DISABLED  0x00 ///< Disable match function.
#define PCA0CPM1_MAT__ENABLED   0x08 ///< Enable match function.

