ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define PCA0CPM1_CAPN__BMASK    0x10 ///< Channel 1 Capture Negative Function Enable
#define PCA0CPM1_CAPN__SHIFT    0x04 ///< Channel 1 Capture Negative Function Enable
#define PCA0CPM1_CAPN__DISABLED 0x00 ///< Disable negative edge capture.
#define PCA0CPM1_CAPN__ENABLED  0x10 ///< Enable negative edge capture.

#define PCA0CPM1_CAPP__BMASK    0x20 ///< Channel 1 Capture Positive Function Enable
#define PCA0CPM1_CAPP__SHIFT    0x05 ///< Channel 1 Capture Positive Function Enable
#define PCA0CPM1_CAPP__DISABLED 0x00 ///< Disable positive edge capture.
#define PCA0CPM1_CAPP__ENABLED  0x20 ///< Enable positive edge capture.

#define PCA0CPM1_ECOM__BMASK    0x40 ///< Channel 1 Comparator Function Enable
#define PCA0CPM1_ECOM__SHIFT    0x06 ///< Channel 1 Comparator Function Enable
#define PCA0CPM1_ECOM__DISABLED 0x00 ///< Disable comparator function.
#define PCA0CPM1_ECOM__ENABLED  0x40 ///< Enable comparator function.

#define PCA0CPM1_PWM16__BMASK   0x80 ///< Channel 1 16-bit Pulse Width Modulation Enable
#define PCA0CPM1_PWM16__SHIFT   0x07 ///< Channel 1 16-bit Pulse Width Modulation Enable
#define PCA0CPM1_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.
#define PCA0CPM1_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.

//------------------------------------------------------------------------------
// PCA0CPH2 Enums (PCA Channel 2 Capture Module High Byte @ 0xEC)
//------------------------------------------------------------------------------
#define PCA0CPH2_PCA0CPH2__FMASK 0xFF ///< PCA Channel 2 Capture Module High Byte
#define PCA0CPH2_PCA0CPH2__SHIFT 0x00 ///< PCA Channel 2 Capture Module High Byte

//------------------------------------------------------------------------------
// PCA0CPL2 Enums (PCA Channel 2 Capture Module Low Byte @ 0xEB)
//------------------------------------------------------------------------------
#define PCA0CPL2_PCA0CPL2__FMASK 0xFF ///< PCA Channel 2 Capture Module Low Byte
#define PCA0CPL2_PCA0CPL2__SHIFT 0x00 ///< PCA Channel 2 Capture Module Low Byte

//------------------------------------------------------------------------------
// PCA0CPM2 Enums (PCA Channel 2 Capture/Compare Mode @ 0xDC)
//------------------------------------------------------------------------------
#define PCA0CPM2_ECCF__BMASK    0x01 ///< Channel 2 Capture/Compare Flag Interrupt Enable
#define PCA0CPM2_ECCF__SHIFT    0x00 ///< Channel 2 Capture/Compare Flag Interrupt Enable
#define PCA0CPM2_ECCF__DISABLED 0x00 ///< Disable CCF2 interrupts.
#define PCA0CPM2_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF2 is set.

#define PCA0CPM2_PWM__BMASK     0x02 ///< Channel 2 Pulse Width Modulation Mode Enable
#define PCA0CPM2_PWM__SHIFT     0x01 ///< Channel 2 Pulse Width Modulation Mode Enable
#define PCA0CPM2_PWM__DISABLED  0x00 ///< Disable PWM function.
#define PCA0CPM2_PWM__ENABLED   0x02 ///< Enable PWM function.

#define PCA0CPM2_TOG__BMASK     0x04 ///< Channel 2 Toggle Function Enable
#define PCA0CPM2_TOG__SHIFT     0x02 ///< Channel 2 Toggle Function Enable
#define PCA0CPM2_TOG__DISABLED  0x00 ///< Disable toggle function.
#define PCA0CPM2_TOG__ENABLED   0x04 ///< Enable toggle function.

#define PCA0CPM2_MAT__BMASK     0x08 ///< Channel 2 Match Function Enable
#define PCA0CPM2_MAT__SHIFT     0x03 ///< Channel 2 Match Function Enable
#define PCA0CPM2_MAT__DISABLED  0x00 ///< Disable match function.
#define PCA0CPM2_MAT__ENABLED   0x08 ///< Enable match function.

#define PCA0CPM2_CAPN__BMASK    0x10 ///< Channel 2 Capture Negative Function Enable
#define PCA0CPM2_CAPN__SHIFT    0x04 ///< Channel 2 Capture Negative Function Enable
#define PCA0CPM2_CAPN__DISABLED 0x00 ///< Disable negative edge capture.
#define PCA0CPM2_CAPN__ENABLED  0x10 ///< Enable negative edge capture.

#define PCA0CPM2_CAPP__BMASK    0x20 ///< Channel 2 Capture Positive Function Enable
#define PCA0CPM2_CAPP__SHIFT    0x05 ///< Channel 2 Capture Positive Function Enable
#define PCA0CPM2_CAPP__DISABLED 0x00 ///< Disable positive edge capture.
#define PCA0CPM2_CAPP__ENABLED  0x20 ///< Enable positive edge capture.

#define PCA0CPM2_ECOM__BMASK    0x40 ///< Channel 2 Comparator Function Enable
#define PCA0CPM2_ECOM__SHIFT    0x06 ///< Channel 2 Comparator Function Enable
#define PCA0CPM2_ECOM__DISABLED 0x00 ///< Disable comparator function.
#define PCA0CPM2_ECOM__ENABLED  0x40 ///< Enable comparator function.

#define PCA0CPM2_PWM16__BMASK   0x80 ///< Channel 2 16-bit Pulse Width Modulation Enable
#define PCA0CPM2_PWM16__SHIFT   0x07 ///< Channel 2 16-bit Pulse Width Modulation Enable
#define PCA0CPM2_PWM16__8_BIT   0x00 ///< 8 to 11-bit PWM selected.
#define PCA0CPM2_PWM16__16_BIT  0x80 ///< 16-bit PWM selected.

//------------------------------------------------------------------------------
// PCA0CENT Enums (PCA Center Alignment Enable @ 0x9E)
//------------------------------------------------------------------------------
#define PCA0CENT_CEX0CEN__BMASK  0x01 ///< CEX0 Center Alignment Enable
#define PCA0CENT_CEX0CEN__SHIFT  0x00 ///< CEX0 Center Alignment Enable
#define PCA0CENT_CEX0CEN__EDGE   0x00 ///< Edge-aligned.
#define PCA0CENT_CEX0CEN__CENTER 0x01 ///< Center-aligned.

#define PCA0CENT_CEX1CEN__BMASK  0x02 ///< CEX1 Center Alignment Enable
#define PCA0CENT_CEX1CEN__SHIFT  0x01 ///< CEX1 Center Alignment Enable
#define PCA0CENT_CEX1CEN__EDGE   0x00 ///< Edge-aligned.
#define PCA0CENT_CEX1CEN__CENTER 0x02 ///< Center-aligned.

#define PCA0CENT_CEX2CEN__BMASK  0x04 ///< CEX2 Center Alignment Enable
#define PCA0CENT_CEX2CEN__SHIFT  0x02 ///< CEX2 Center Alignment Enable
#define PCA0CENT_CEX2CEN__EDGE   0x00 ///< Edge-aligned.
#define PCA0CENT_CEX2CEN__CENTER 0x04 ///< Center-aligned.

//------------------------------------------------------------------------------
// PCA0CLR Enums (PCA Comparator Clear Control @ 0x9C)
//------------------------------------------------------------------------------
#define PCA0CLR_CPCE0__BMASK    0x01 ///< Comparator Clear Enable for CEX0
#define PCA0CLR_CPCE0__SHIFT    0x00 ///< Comparator Clear Enable for CEX0
#define PCA0CLR_CPCE0__DISABLED 0x00 ///< Disable the comparator clear function on PCA
                                     ///< channel 0.
#define PCA0CLR_CPCE0__ENABLED  0x01 ///< Enable the comparator clear function on PCA
                                     ///< channel 0.

#define PCA0CLR_CPCE1__BMASK    0x02 ///< Comparator Clear Enable for CEX1
#define PCA0CLR_CPCE1__SHIFT    0x01 ///< Comparator Clear Enable for CEX1
#define PCA0CLR_CPCE1__DISABLED 0x00 ///< Disable the comparator clear function on PCA
                                     ///< channel 1.
#define PCA0CLR_CPCE1__ENABLED  0x02 ///< Enable the comparator clear function on PCA
                                     ///< channel 1.

