ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define PCA0CLR_CPCE2__BMASK    0x04 ///< Comparator Clear Enable for CEX2
#define PCA0CLR_CPCE2__SHIFT    0x02 ///< Comparator Clear Enable for CEX2
#define PCA0CLR_CPCE2__DISABLED 0x00 ///< Disable the comparator clear function on PCA
                                     ///< channel 2.
#define PCA0CLR_CPCE2__ENABLED  0x04 ///< Enable the comparator clear function on PCA
                                     ///< channel 2.

#define PCA0CLR_CPSEL__BMASK    0x40 ///< Comparator Clear Select
#define PCA0CLR_CPSEL__SHIFT    0x06 ///< Comparator Clear Select
#define PCA0CLR_CPSEL__CMP0     0x00 ///< Use Comparator 0 for the comparator clear
                                     ///< function.
#define PCA0CLR_CPSEL__CMP1     0x40 ///< Use Comparator 1 for the comparator clear
                                     ///< function.

#define PCA0CLR_CPCPOL__BMASK   0x80 ///< Comparator Clear Polarity
#define PCA0CLR_CPCPOL__SHIFT   0x07 ///< Comparator Clear Polarity
#define PCA0CLR_CPCPOL__LOW     0x00 ///< PCA channel(s) will be cleared when comparator
                                     ///< result goes logic low.
#define PCA0CLR_CPCPOL__HIGH    0x80 ///< PCA channel(s) will be cleared when comparator
                                     ///< result goes logic high.

//------------------------------------------------------------------------------
// PCA0CN0 Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA0CN0_CCF0__BMASK   0x01 ///< PCA Module 0 Capture/Compare Flag
#define PCA0CN0_CCF0__SHIFT   0x00 ///< PCA Module 0 Capture/Compare Flag
#define PCA0CN0_CCF0__NOT_SET 0x00 ///< A match or capture did not occur on channel 0.
#define PCA0CN0_CCF0__SET     0x01 ///< A match or capture occurred on channel 0.

#define PCA0CN0_CCF1__BMASK   0x02 ///< PCA Module 1 Capture/Compare Flag
#define PCA0CN0_CCF1__SHIFT   0x01 ///< PCA Module 1 Capture/Compare Flag
#define PCA0CN0_CCF1__NOT_SET 0x00 ///< A match or capture did not occur on channel 1.
#define PCA0CN0_CCF1__SET     0x02 ///< A match or capture occurred on channel 1.

#define PCA0CN0_CCF2__BMASK   0x04 ///< PCA Module 2 Capture/Compare Flag
#define PCA0CN0_CCF2__SHIFT   0x02 ///< PCA Module 2 Capture/Compare Flag
#define PCA0CN0_CCF2__NOT_SET 0x00 ///< A match or capture did not occur on channel 2.
#define PCA0CN0_CCF2__SET     0x04 ///< A match or capture occurred on channel 2.

#define PCA0CN0_CR__BMASK     0x40 ///< PCA Counter/Timer Run Control
#define PCA0CN0_CR__SHIFT     0x06 ///< PCA Counter/Timer Run Control
#define PCA0CN0_CR__STOP      0x00 ///< Stop the PCA Counter/Timer.
#define PCA0CN0_CR__RUN       0x40 ///< Start the PCA Counter/Timer running.

#define PCA0CN0_CF__BMASK     0x80 ///< PCA Counter/Timer Overflow Flag
#define PCA0CN0_CF__SHIFT     0x07 ///< PCA Counter/Timer Overflow Flag
#define PCA0CN0_CF__NOT_SET   0x00 ///< The PCA counter/timer did not overflow.
#define PCA0CN0_CF__SET       0x80 ///< The PCA counter/timer overflowed.

//------------------------------------------------------------------------------
// PCA0H Enums (PCA Counter/Timer High Byte @ 0xFA)
//------------------------------------------------------------------------------
#define PCA0H_PCA0H__FMASK 0xFF ///< PCA Counter/Timer High Byte
#define PCA0H_PCA0H__SHIFT 0x00 ///< PCA Counter/Timer High Byte

//------------------------------------------------------------------------------
// PCA0L Enums (PCA Counter/Timer Low Byte @ 0xF9)
//------------------------------------------------------------------------------
#define PCA0L_PCA0L__FMASK 0xFF ///< PCA Counter/Timer Low Byte
#define PCA0L_PCA0L__SHIFT 0x00 ///< PCA Counter/Timer Low Byte

//------------------------------------------------------------------------------
// PCA0MD Enums (PCA Mode @ 0xD9)
//------------------------------------------------------------------------------
#define PCA0MD_ECF__BMASK            0x01 ///< PCA Counter/Timer Overflow Interrupt Enable
#define PCA0MD_ECF__SHIFT            0x00 ///< PCA Counter/Timer Overflow Interrupt Enable
#define PCA0MD_ECF__OVF_INT_DISABLED 0x00 ///< Disable the CF interrupt.
#define PCA0MD_ECF__OVF_INT_ENABLED  0x01 ///< Enable a PCA Counter/Timer Overflow interrupt
                                          ///< request when CF is set.

#define PCA0MD_CPS__FMASK            0x0E ///< PCA Counter/Timer Pulse Select
#define PCA0MD_CPS__SHIFT            0x01 ///< PCA Counter/Timer Pulse Select
#define PCA0MD_CPS__SYSCLK_DIV_12    0x00 ///< System clock divided by 12.
#define PCA0MD_CPS__SYSCLK_DIV_4     0x02 ///< System clock divided by 4.
#define PCA0MD_CPS__T0_OVERFLOW      0x04 ///< Timer 0 overflow.
#define PCA0MD_CPS__ECI              0x06 ///< High-to-low transitions on ECI (max rate = system
                                          ///< clock divided by 4).
#define PCA0MD_CPS__SYSCLK           0x08 ///< System clock.
#define PCA0MD_CPS__EXTOSC_DIV_8     0x0A ///< External clock divided by 8 (synchronized with the
                                          ///< system clock).
#define PCA0MD_CPS__LFOSC_DIV_8      0x0C ///< Low frequency oscillator divided by 8.

#define PCA0MD_CIDL__BMASK           0x80 ///< PCA Counter/Timer Idle Control
#define PCA0MD_CIDL__SHIFT           0x07 ///< PCA Counter/Timer Idle Control
#define PCA0MD_CIDL__NORMAL          0x00 ///< PCA continues to function normally while the
                                          ///< system controller is in Idle Mode.
#define PCA0MD_CIDL__SUSPEND         0x80 ///< PCA operation is suspended while the system
                                          ///< controller is in Idle Mode.

//------------------------------------------------------------------------------
// PCA0POL Enums (PCA Output Polarity @ 0x96)
//------------------------------------------------------------------------------
#define PCA0POL_CEX0POL__BMASK   0x01 ///< CEX0 Output Polarity
#define PCA0POL_CEX0POL__SHIFT   0x00 ///< CEX0 Output Polarity
#define PCA0POL_CEX0POL__DEFAULT 0x00 ///< Use default polarity.
#define PCA0POL_CEX0POL__INVERT  0x01 ///< Invert polarity.

#define PCA0POL_CEX1POL__BMASK   0x02 ///< CEX1 Output Polarity
#define PCA0POL_CEX1POL__SHIFT   0x01 ///< CEX1 Output Polarity
#define PCA0POL_CEX1POL__DEFAULT 0x00 ///< Use default polarity.
#define PCA0POL_CEX1POL__INVERT  0x02 ///< Invert polarity.

#define PCA0POL_CEX2POL__BMASK   0x04 ///< CEX2 Output Polarity
#define PCA0POL_CEX2POL__SHIFT   0x02 ///< CEX2 Output Polarity
#define PCA0POL_CEX2POL__DEFAULT 0x00 ///< Use default polarity.
#define PCA0POL_CEX2POL__INVERT  0x04 ///< Invert polarity.

//------------------------------------------------------------------------------
// PCA0PWM Enums (PCA PWM Configuration @ 0xF7)
//------------------------------------------------------------------------------
#define PCA0PWM_CLSEL__FMASK             0x07 ///< Cycle Length Select
#define PCA0PWM_CLSEL__SHIFT             0x00 ///< Cycle Length Select
#define PCA0PWM_CLSEL__8_BITS            0x00 ///< 8 bits.
#define PCA0PWM_CLSEL__9_BITS            0x01 ///< 9 bits.
#define PCA0PWM_CLSEL__10_BITS           0x02 ///< 10 bits.
#define PCA0PWM_CLSEL__11_BITS           0x03 ///< 11 bits.

#define PCA0PWM_COVF__BMASK              0x20 ///< Cycle Overflow Flag
#define PCA0PWM_COVF__SHIFT              0x05 ///< Cycle Overflow Flag
#define PCA0PWM_COVF__NO_OVERFLOW        0x00 ///< No overflow has occurred since the last time this
                                              ///< bit was cleared.
#define PCA0PWM_COVF__OVERFLOW           0x20 ///< An overflow has occurred since the last time this
                                              ///< bit was cleared.

#define PCA0PWM_ECOV__BMASK              0x40 ///< Cycle Overflow Interrupt Enable
#define PCA0PWM_ECOV__SHIFT              0x06 ///< Cycle Overflow Interrupt Enable
#define PCA0PWM_ECOV__COVF_MASK_DISABLED 0x00 ///< COVF will not generate PCA interrupts.
#define PCA0PWM_ECOV__COVF_MASK_ENABLED  0x40 ///< A PCA interrupt will be generated when COVF is
                                              ///< set.

#define PCA0PWM_ARSEL__BMASK             0x80 ///< Auto-Reload Register Select
#define PCA0PWM_ARSEL__SHIFT             0x07 ///< Auto-Reload Register Select
#define PCA0PWM_ARSEL__CAPTURE_COMPARE   0x00 ///< Read/Write Capture/Compare Registers at PCA0CPHn
                                              ///< and PCA0CPLn.
#define PCA0PWM_ARSEL__AUTORELOAD        0x80 ///< Read/Write Auto-Reload Registers at PCA0CPHn and
                                              ///< PCA0CPLn.

//------------------------------------------------------------------------------
// PCON0 Enums (Power Control @ 0x87)
//------------------------------------------------------------------------------
#define PCON0_IDLE__BMASK  0x01 ///< Idle Mode Select
#define PCON0_IDLE__SHIFT  0x00 ///< Idle Mode Select
#define PCON0_IDLE__NORMAL 0x00 ///< Idle mode not activated.
#define PCON0_IDLE__IDLE   0x01 ///< CPU goes into Idle mode (shuts off clock to CPU,
                                ///< but clocks to enabled peripherals are still
                                ///< active).

#define PCON0_STOP__BMASK  0x02 ///< Stop Mode Select
#define PCON0_STOP__SHIFT  0x01 ///< Stop Mode Select
#define PCON0_STOP__NORMAL 0x00 ///< Stop mode not activated.
#define PCON0_STOP__STOP   0x02 ///< CPU goes into Stop mode (internal oscillator
                                ///< stopped).

#define PCON0_GF0__BMASK   0x04 ///< General Purpose Flag 0
#define PCON0_GF0__SHIFT   0x02 ///< General Purpose Flag 0
#define PCON0_GF0__NOT_SET 0x00 ///< The GF0 flag is not set. Clear the GF0 flag.
#define PCON0_GF0__SET     0x04 ///< The GF0 flag is set. Set the GF0 flag.

#define PCON0_GF1__BMASK   0x08 ///< General Purpose Flag 1
#define PCON0_GF1__SHIFT   0x03 ///< General Purpose Flag 1
#define PCON0_GF1__NOT_SET 0x00 ///< The GF1 flag is not set. Clear the GF1 flag.
#define PCON0_GF1__SET     0x08 ///< The GF1 flag is set. Set the GF1 flag.

