ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define PCON0_GF2__BMASK   0x10 ///< General Purpose Flag 2
#define PCON0_GF2__SHIFT   0x04 ///< General Purpose Flag 2
#define PCON0_GF2__NOT_SET 0x00 ///< The GF2 flag is not set. Clear the GF2 flag.
#define PCON0_GF2__SET     0x10 ///< The GF2 flag is set. Set the GF2 flag.

#define PCON0_GF3__BMASK   0x20 ///< General Purpose Flag 3
#define PCON0_GF3__SHIFT   0x05 ///< General Purpose Flag 3
#define PCON0_GF3__NOT_SET 0x00 ///< The GF3 flag is not set. Clear the GF3 flag.
#define PCON0_GF3__SET     0x20 ///< The GF3 flag is set. Set the GF3 flag.

#define PCON0_GF4__BMASK   0x40 ///< General Purpose Flag 4
#define PCON0_GF4__SHIFT   0x06 ///< General Purpose Flag 4
#define PCON0_GF4__NOT_SET 0x00 ///< The GF4 flag is not set. Clear the GF4 flag.
#define PCON0_GF4__SET     0x40 ///< The GF4 flag is set. Set the GF4 flag.

#define PCON0_GF5__BMASK   0x80 ///< General Purpose Flag 5
#define PCON0_GF5__SHIFT   0x07 ///< General Purpose Flag 5
#define PCON0_GF5__NOT_SET 0x00 ///< The GF5 flag is not set. Clear the GF5 flag.
#define PCON0_GF5__SET     0x80 ///< The GF5 flag is set. Set the GF5 flag.

//------------------------------------------------------------------------------
// PCON1 Enums (Power Control 1 @ 0xE4)
//------------------------------------------------------------------------------
#define PCON1_SUSPEND__BMASK   0x40 ///< Suspend Mode Select
#define PCON1_SUSPEND__SHIFT   0x06 ///< Suspend Mode Select
#define PCON1_SUSPEND__NORMAL  0x00 ///< Suspend mode not activated.
#define PCON1_SUSPEND__SUSPEND 0x40 ///< Device goes into suspend mode (high-frequency
                                    ///< oscillators and SYSCLK are halted).

#define PCON1_SNOOZE__BMASK    0x80 ///< Snooze Mode Select
#define PCON1_SNOOZE__SHIFT    0x07 ///< Snooze Mode Select
#define PCON1_SNOOZE__NORMAL   0x00 ///< Snooze mode not activated.
#define PCON1_SNOOZE__SNOOZE   0x80 ///< Device goes into snooze mode (high-frequency
                                    ///< oscillators and SYSCLK are halted, internal LDO in
                                    ///< low-power state).

//------------------------------------------------------------------------------
// PSTAT0 Enums (Power Status @ 0xAD)
//------------------------------------------------------------------------------
#define PSTAT0_CPT0WK__BMASK    0x01 ///< Comparator 0 Wake-up Event
#define PSTAT0_CPT0WK__SHIFT    0x00 ///< Comparator 0 Wake-up Event
#define PSTAT0_CPT0WK__NOT_SET  0x00 ///< A comparator 0 output falling edge event did not
                                     ///< occur.
#define PSTAT0_CPT0WK__SET      0x01 ///< A comparator 0 output falling edge event occurred.

#define PSTAT0_PMATWK__BMASK    0x02 ///< Port Match Wake-up Event
#define PSTAT0_PMATWK__SHIFT    0x01 ///< Port Match Wake-up Event
#define PSTAT0_PMATWK__NOT_SET  0x00 ///< A Port Match event did not occur.
#define PSTAT0_PMATWK__SET      0x02 ///< A Port Match event occurred.

#define PSTAT0_TMR4WK__BMASK    0x04 ///< Timer 4 Wake-up Event
#define PSTAT0_TMR4WK__SHIFT    0x02 ///< Timer 4 Wake-up Event
#define PSTAT0_TMR4WK__NOT_SET  0x00 ///< A Timer 4 overflow event did not occur.
#define PSTAT0_TMR4WK__SET      0x04 ///< A Timer 4 overflow event occurred.

#define PSTAT0_SPI0WK__BMASK    0x08 ///< SPI0 Slave Wake-up Event
#define PSTAT0_SPI0WK__SHIFT    0x03 ///< SPI0 Slave Wake-up Event
#define PSTAT0_SPI0WK__NOT_SET  0x00 ///< The SPI0 Slave did not receive a byte.
#define PSTAT0_SPI0WK__SET      0x08 ///< The SPI0 Slave received a byte.

#define PSTAT0_USB0RWK__BMASK   0x10 ///< USB0 Resume Wake-up Event
#define PSTAT0_USB0RWK__SHIFT   0x04 ///< USB0 Resume Wake-up Event
#define PSTAT0_USB0RWK__NOT_SET 0x00 ///< A USB Resume wake up event did not occur.
#define PSTAT0_USB0RWK__SET     0x10 ///< A USB Resume wake up event occurred.

#define PSTAT0_CL0WK__BMASK     0x20 ///< CL0 Wake-up Event
#define PSTAT0_CL0WK__SHIFT     0x05 ///< CL0 Wake-up Event
#define PSTAT0_CL0WK__NOT_SET   0x00 ///< A CL0 interrupt-enabled event did not occur.
#define PSTAT0_CL0WK__SET       0x20 ///< A CL0 interrupt-enabled event occurred.

//------------------------------------------------------------------------------
// P0 Enums (Port 0 Pin Latch @ 0x80)
//------------------------------------------------------------------------------
#define P0_B0__BMASK 0x01 ///< Port 0 Bit 0 Latch
#define P0_B0__SHIFT 0x00 ///< Port 0 Bit 0 Latch
#define P0_B0__LOW   0x00 ///< P0.0 is low. Set P0.0 to drive low.
#define P0_B0__HIGH  0x01 ///< P0.0 is high. Set P0.0 to drive or float high.

#define P0_B1__BMASK 0x02 ///< Port 0 Bit 1 Latch
#define P0_B1__SHIFT 0x01 ///< Port 0 Bit 1 Latch
#define P0_B1__LOW   0x00 ///< P0.1 is low. Set P0.1 to drive low.
#define P0_B1__HIGH  0x02 ///< P0.1 is high. Set P0.1 to drive or float high.

#define P0_B2__BMASK 0x04 ///< Port 0 Bit 2 Latch
#define P0_B2__SHIFT 0x02 ///< Port 0 Bit 2 Latch
#define P0_B2__LOW   0x00 ///< P0.2 is low. Set P0.2 to drive low.
#define P0_B2__HIGH  0x04 ///< P0.2 is high. Set P0.2 to drive or float high.

#define P0_B3__BMASK 0x08 ///< Port 0 Bit 3 Latch
#define P0_B3__SHIFT 0x03 ///< Port 0 Bit 3 Latch
#define P0_B3__LOW   0x00 ///< P0.3 is low. Set P0.3 to drive low.
#define P0_B3__HIGH  0x08 ///< P0.3 is high. Set P0.3 to drive or float high.

#define P0_B4__BMASK 0x10 ///< Port 0 Bit 4 Latch
#define P0_B4__SHIFT 0x04 ///< Port 0 Bit 4 Latch
#define P0_B4__LOW   0x00 ///< P0.4 is low. Set P0.4 to drive low.
#define P0_B4__HIGH  0x10 ///< P0.4 is high. Set P0.4 to drive or float high.

#define P0_B5__BMASK 0x20 ///< Port 0 Bit 5 Latch
#define P0_B5__SHIFT 0x05 ///< Port 0 Bit 5 Latch
#define P0_B5__LOW   0x00 ///< P0.5 is low. Set P0.5 to drive low.
#define P0_B5__HIGH  0x20 ///< P0.5 is high. Set P0.5 to drive or float high.

#define P0_B6__BMASK 0x40 ///< Port 0 Bit 6 Latch
#define P0_B6__SHIFT 0x06 ///< Port 0 Bit 6 Latch
#define P0_B6__LOW   0x00 ///< P0.6 is low. Set P0.6 to drive low.
#define P0_B6__HIGH  0x40 ///< P0.6 is high. Set P0.6 to drive or float high.

