ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define P0_B7__BMASK 0x80 ///< Port 0 Bit 7 Latch
#define P0_B7__SHIFT 0x07 ///< Port 0 Bit 7 Latch
#define P0_B7__LOW   0x00 ///< P0.7 is low. Set P0.7 to drive low.
#define P0_B7__HIGH  0x80 ///< P0.7 is high. Set P0.7 to drive or float high.

//------------------------------------------------------------------------------
// P0MASK Enums (Port 0 Mask @ 0xFE)
//------------------------------------------------------------------------------
#define P0MASK_B0__BMASK    0x01 ///< Port 0 Bit 0 Mask Value
#define P0MASK_B0__SHIFT    0x00 ///< Port 0 Bit 0 Mask Value
#define P0MASK_B0__IGNORED  0x00 ///< P0.0 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B0__COMPARED 0x01 ///< P0.0 pin logic value is compared to P0MAT.0.

#define P0MASK_B1__BMASK    0x02 ///< Port 0 Bit 1 Mask Value
#define P0MASK_B1__SHIFT    0x01 ///< Port 0 Bit 1 Mask Value
#define P0MASK_B1__IGNORED  0x00 ///< P0.1 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B1__COMPARED 0x02 ///< P0.1 pin logic value is compared to P0MAT.1.

#define P0MASK_B2__BMASK    0x04 ///< Port 0 Bit 2 Mask Value
#define P0MASK_B2__SHIFT    0x02 ///< Port 0 Bit 2 Mask Value
#define P0MASK_B2__IGNORED  0x00 ///< P0.2 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B2__COMPARED 0x04 ///< P0.2 pin logic value is compared to P0MAT.2.

#define P0MASK_B3__BMASK    0x08 ///< Port 0 Bit 3 Mask Value
#define P0MASK_B3__SHIFT    0x03 ///< Port 0 Bit 3 Mask Value
#define P0MASK_B3__IGNORED  0x00 ///< P0.3 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B3__COMPARED 0x08 ///< P0.3 pin logic value is compared to P0MAT.3.

#define P0MASK_B4__BMASK    0x10 ///< Port 0 Bit 4 Mask Value
#define P0MASK_B4__SHIFT    0x04 ///< Port 0 Bit 4 Mask Value
#define P0MASK_B4__IGNORED  0x00 ///< P0.4 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B4__COMPARED 0x10 ///< P0.4 pin logic value is compared to P0MAT.4.

#define P0MASK_B5__BMASK    0x20 ///< Port 0 Bit 5 Mask Value
#define P0MASK_B5__SHIFT    0x05 ///< Port 0 Bit 5 Mask Value
#define P0MASK_B5__IGNORED  0x00 ///< P0.5 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B5__COMPARED 0x20 ///< P0.5 pin logic value is compared to P0MAT.5.

#define P0MASK_B6__BMASK    0x40 ///< Port 0 Bit 6 Mask Value
#define P0MASK_B6__SHIFT    0x06 ///< Port 0 Bit 6 Mask Value
#define P0MASK_B6__IGNORED  0x00 ///< P0.6 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B6__COMPARED 0x40 ///< P0.6 pin logic value is compared to P0MAT.6.

#define P0MASK_B7__BMASK    0x80 ///< Port 0 Bit 7 Mask Value
#define P0MASK_B7__SHIFT    0x07 ///< Port 0 Bit 7 Mask Value
#define P0MASK_B7__IGNORED  0x00 ///< P0.7 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P0MASK_B7__COMPARED 0x80 ///< P0.7 pin logic value is compared to P0MAT.7.

//------------------------------------------------------------------------------
// P0MAT Enums (Port 0 Match @ 0xFD)
//------------------------------------------------------------------------------
#define P0MAT_B0__BMASK 0x01 ///< Port 0 Bit 0 Match Value
#define P0MAT_B0__SHIFT 0x00 ///< Port 0 Bit 0 Match Value
#define P0MAT_B0__LOW   0x00 ///< P0.0 pin logic value is compared with logic LOW.
#define P0MAT_B0__HIGH  0x01 ///< P0.0 pin logic value is compared with logic HIGH.

#define P0MAT_B1__BMASK 0x02 ///< Port 0 Bit 1 Match Value
#define P0MAT_B1__SHIFT 0x01 ///< Port 0 Bit 1 Match Value
#define P0MAT_B1__LOW   0x00 ///< P0.1 pin logic value is compared with logic LOW.
#define P0MAT_B1__HIGH  0x02 ///< P0.1 pin logic value is compared with logic HIGH.

#define P0MAT_B2__BMASK 0x04 ///< Port 0 Bit 2 Match Value
#define P0MAT_B2__SHIFT 0x02 ///< Port 0 Bit 2 Match Value
#define P0MAT_B2__LOW   0x00 ///< P0.2 pin logic value is compared with logic LOW.
#define P0MAT_B2__HIGH  0x04 ///< P0.2 pin logic value is compared with logic HIGH.

#define P0MAT_B3__BMASK 0x08 ///< Port 0 Bit 3 Match Value
#define P0MAT_B3__SHIFT 0x03 ///< Port 0 Bit 3 Match Value
#define P0MAT_B3__LOW   0x00 ///< P0.3 pin logic value is compared with logic LOW.
#define P0MAT_B3__HIGH  0x08 ///< P0.3 pin logic value is compared with logic HIGH.

#define P0MAT_B4__BMASK 0x10 ///< Port 0 Bit 4 Match Value
#define P0MAT_B4__SHIFT 0x04 ///< Port 0 Bit 4 Match Value
#define P0MAT_B4__LOW   0x00 ///< P0.4 pin logic value is compared with logic LOW.
#define P0MAT_B4__HIGH  0x10 ///< P0.4 pin logic value is compared with logic HIGH.

#define P0MAT_B5__BMASK 0x20 ///< Port 0 Bit 5 Match Value
#define P0MAT_B5__SHIFT 0x05 ///< Port 0 Bit 5 Match Value
#define P0MAT_B5__LOW   0x00 ///< P0.5 pin logic value is compared with logic LOW.
#define P0MAT_B5__HIGH  0x20 ///< P0.5 pin logic value is compared with logic HIGH.

#define P0MAT_B6__BMASK 0x40 ///< Port 0 Bit 6 Match Value
#define P0MAT_B6__SHIFT 0x06 ///< Port 0 Bit 6 Match Value
#define P0MAT_B6__LOW   0x00 ///< P0.6 pin logic value is compared with logic LOW.
#define P0MAT_B6__HIGH  0x40 ///< P0.6 pin logic value is compared with logic HIGH.

#define P0MAT_B7__BMASK 0x80 ///< Port 0 Bit 7 Match Value
#define P0MAT_B7__SHIFT 0x07 ///< Port 0 Bit 7 Match Value
#define P0MAT_B7__LOW   0x00 ///< P0.7 pin logic value is compared with logic LOW.
#define P0MAT_B7__HIGH  0x80 ///< P0.7 pin logic value is compared with logic HIGH.

//------------------------------------------------------------------------------
// P0MDIN Enums (Port 0 Input Mode @ 0xF1)
//------------------------------------------------------------------------------
#define P0MDIN_B0__BMASK   0x01 ///< Port 0 Bit 0 Input Mode
#define P0MDIN_B0__SHIFT   0x00 ///< Port 0 Bit 0 Input Mode
#define P0MDIN_B0__ANALOG  0x00 ///< P0.0 pin is configured for analog mode.
#define P0MDIN_B0__DIGITAL 0x01 ///< P0.0 pin is configured for digital mode.

#define P0MDIN_B1__BMASK   0x02 ///< Port 0 Bit 1 Input Mode
#define P0MDIN_B1__SHIFT   0x01 ///< Port 0 Bit 1 Input Mode
#define P0MDIN_B1__ANALOG  0x00 ///< P0.1 pin is configured for analog mode.
#define P0MDIN_B1__DIGITAL 0x02 ///< P0.1 pin is configured for digital mode.

#define P0MDIN_B2__BMASK   0x04 ///< Port 0 Bit 2 Input Mode
#define P0MDIN_B2__SHIFT   0x02 ///< Port 0 Bit 2 Input Mode
#define P0MDIN_B2__ANALOG  0x00 ///< P0.2 pin is configured for analog mode.
#define P0MDIN_B2__DIGITAL 0x04 ///< P0.2 pin is configured for digital mode.

#define P0MDIN_B3__BMASK   0x08 ///< Port 0 Bit 3 Input Mode
#define P0MDIN_B3__SHIFT   0x03 ///< Port 0 Bit 3 Input Mode
#define P0MDIN_B3__ANALOG  0x00 ///< P0.3 pin is configured for analog mode.
#define P0MDIN_B3__DIGITAL 0x08 ///< P0.3 pin is configured for digital mode.

#define P0MDIN_B4__BMASK   0x10 ///< Port 0 Bit 4 Input Mode
#define P0MDIN_B4__SHIFT   0x04 ///< Port 0 Bit 4 Input Mode
#define P0MDIN_B4__ANALOG  0x00 ///< P0.4 pin is configured for analog mode.
#define P0MDIN_B4__DIGITAL 0x10 ///< P0.4 pin is configured for digital mode.

