ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define P0MDIN_B5__BMASK   0x20 ///< Port 0 Bit 5 Input Mode
#define P0MDIN_B5__SHIFT   0x05 ///< Port 0 Bit 5 Input Mode
#define P0MDIN_B5__ANALOG  0x00 ///< P0.5 pin is configured for analog mode.
#define P0MDIN_B5__DIGITAL 0x20 ///< P0.5 pin is configured for digital mode.

#define P0MDIN_B6__BMASK   0x40 ///< Port 0 Bit 6 Input Mode
#define P0MDIN_B6__SHIFT   0x06 ///< Port 0 Bit 6 Input Mode
#define P0MDIN_B6__ANALOG  0x00 ///< P0.6 pin is configured for analog mode.
#define P0MDIN_B6__DIGITAL 0x40 ///< P0.6 pin is configured for digital mode.

#define P0MDIN_B7__BMASK   0x80 ///< Port 0 Bit 7 Input Mode
#define P0MDIN_B7__SHIFT   0x07 ///< Port 0 Bit 7 Input Mode
#define P0MDIN_B7__ANALOG  0x00 ///< P0.7 pin is configured for analog mode.
#define P0MDIN_B7__DIGITAL 0x80 ///< P0.7 pin is configured for digital mode.

//------------------------------------------------------------------------------
// P0MDOUT Enums (Port 0 Output Mode @ 0xA4)
//------------------------------------------------------------------------------
#define P0MDOUT_B0__BMASK      0x01 ///< Port 0 Bit 0 Output Mode
#define P0MDOUT_B0__SHIFT      0x00 ///< Port 0 Bit 0 Output Mode
#define P0MDOUT_B0__OPEN_DRAIN 0x00 ///< P0.0 output is open-drain.
#define P0MDOUT_B0__PUSH_PULL  0x01 ///< P0.0 output is push-pull.

#define P0MDOUT_B1__BMASK      0x02 ///< Port 0 Bit 1 Output Mode
#define P0MDOUT_B1__SHIFT      0x01 ///< Port 0 Bit 1 Output Mode
#define P0MDOUT_B1__OPEN_DRAIN 0x00 ///< P0.1 output is open-drain.
#define P0MDOUT_B1__PUSH_PULL  0x02 ///< P0.1 output is push-pull.

#define P0MDOUT_B2__BMASK      0x04 ///< Port 0 Bit 2 Output Mode
#define P0MDOUT_B2__SHIFT      0x02 ///< Port 0 Bit 2 Output Mode
#define P0MDOUT_B2__OPEN_DRAIN 0x00 ///< P0.2 output is open-drain.
#define P0MDOUT_B2__PUSH_PULL  0x04 ///< P0.2 output is push-pull.

#define P0MDOUT_B3__BMASK      0x08 ///< Port 0 Bit 3 Output Mode
#define P0MDOUT_B3__SHIFT      0x03 ///< Port 0 Bit 3 Output Mode
#define P0MDOUT_B3__OPEN_DRAIN 0x00 ///< P0.3 output is open-drain.
#define P0MDOUT_B3__PUSH_PULL  0x08 ///< P0.3 output is push-pull.

#define P0MDOUT_B4__BMASK      0x10 ///< Port 0 Bit 4 Output Mode
#define P0MDOUT_B4__SHIFT      0x04 ///< Port 0 Bit 4 Output Mode
#define P0MDOUT_B4__OPEN_DRAIN 0x00 ///< P0.4 output is open-drain.
#define P0MDOUT_B4__PUSH_PULL  0x10 ///< P0.4 output is push-pull.

#define P0MDOUT_B5__BMASK      0x20 ///< Port 0 Bit 5 Output Mode
#define P0MDOUT_B5__SHIFT      0x05 ///< Port 0 Bit 5 Output Mode
#define P0MDOUT_B5__OPEN_DRAIN 0x00 ///< P0.5 output is open-drain.
#define P0MDOUT_B5__PUSH_PULL  0x20 ///< P0.5 output is push-pull.

#define P0MDOUT_B6__BMASK      0x40 ///< Port 0 Bit 6 Output Mode
#define P0MDOUT_B6__SHIFT      0x06 ///< Port 0 Bit 6 Output Mode
#define P0MDOUT_B6__OPEN_DRAIN 0x00 ///< P0.6 output is open-drain.
#define P0MDOUT_B6__PUSH_PULL  0x40 ///< P0.6 output is push-pull.

#define P0MDOUT_B7__BMASK      0x80 ///< Port 0 Bit 7 Output Mode
#define P0MDOUT_B7__SHIFT      0x07 ///< Port 0 Bit 7 Output Mode
#define P0MDOUT_B7__OPEN_DRAIN 0x00 ///< P0.7 output is open-drain.
#define P0MDOUT_B7__PUSH_PULL  0x80 ///< P0.7 output is push-pull.

//------------------------------------------------------------------------------
// P0SKIP Enums (Port 0 Skip @ 0xD4)
//------------------------------------------------------------------------------
#define P0SKIP_B0__BMASK       0x01 ///< Port 0 Bit 0 Skip
#define P0SKIP_B0__SHIFT       0x00 ///< Port 0 Bit 0 Skip
#define P0SKIP_B0__NOT_SKIPPED 0x00 ///< P0.0 pin is not skipped by the crossbar.
#define P0SKIP_B0__SKIPPED     0x01 ///< P0.0 pin is skipped by the crossbar.

#define P0SKIP_B1__BMASK       0x02 ///< Port 0 Bit 1 Skip
#define P0SKIP_B1__SHIFT       0x01 ///< Port 0 Bit 1 Skip
#define P0SKIP_B1__NOT_SKIPPED 0x00 ///< P0.1 pin is not skipped by the crossbar.
#define P0SKIP_B1__SKIPPED     0x02 ///< P0.1 pin is skipped by the crossbar.

#define P0SKIP_B2__BMASK       0x04 ///< Port 0 Bit 2 Skip
#define P0SKIP_B2__SHIFT       0x02 ///< Port 0 Bit 2 Skip
#define P0SKIP_B2__NOT_SKIPPED 0x00 ///< P0.2 pin is not skipped by the crossbar.
#define P0SKIP_B2__SKIPPED     0x04 ///< P0.2 pin is skipped by the crossbar.

#define P0SKIP_B3__BMASK       0x08 ///< Port 0 Bit 3 Skip
#define P0SKIP_B3__SHIFT       0x03 ///< Port 0 Bit 3 Skip
#define P0SKIP_B3__NOT_SKIPPED 0x00 ///< P0.3 pin is not skipped by the crossbar.
#define P0SKIP_B3__SKIPPED     0x08 ///< P0.3 pin is skipped by the crossbar.

#define P0SKIP_B4__BMASK       0x10 ///< Port 0 Bit 4 Skip
#define P0SKIP_B4__SHIFT       0x04 ///< Port 0 Bit 4 Skip
#define P0SKIP_B4__NOT_SKIPPED 0x00 ///< P0.4 pin is not skipped by the crossbar.
#define P0SKIP_B4__SKIPPED     0x10 ///< P0.4 pin is skipped by the crossbar.

#define P0SKIP_B5__BMASK       0x20 ///< Port 0 Bit 5 Skip
#define P0SKIP_B5__SHIFT       0x05 ///< Port 0 Bit 5 Skip
#define P0SKIP_B5__NOT_SKIPPED 0x00 ///< P0.5 pin is not skipped by the crossbar.
#define P0SKIP_B5__SKIPPED     0x20 ///< P0.5 pin is skipped by the crossbar.

#define P0SKIP_B6__BMASK       0x40 ///< Port 0 Bit 6 Skip
#define P0SKIP_B6__SHIFT       0x06 ///< Port 0 Bit 6 Skip
#define P0SKIP_B6__NOT_SKIPPED 0x00 ///< P0.6 pin is not skipped by the crossbar.
#define P0SKIP_B6__SKIPPED     0x40 ///< P0.6 pin is skipped by the crossbar.

#define P0SKIP_B7__BMASK       0x80 ///< Port 0 Bit 7 Skip
#define P0SKIP_B7__SHIFT       0x07 ///< Port 0 Bit 7 Skip
#define P0SKIP_B7__NOT_SKIPPED 0x00 ///< P0.7 pin is not skipped by the crossbar.
#define P0SKIP_B7__SKIPPED     0x80 ///< P0.7 pin is skipped by the crossbar.

//------------------------------------------------------------------------------
// P1 Enums (Port 1 Pin Latch @ 0x90)
//------------------------------------------------------------------------------
#define P1_B0__BMASK 0x01 ///< Port 1 Bit 0 Latch
#define P1_B0__SHIFT 0x00 ///< Port 1 Bit 0 Latch
#define P1_B0__LOW   0x00 ///< P1.0 is low. Set P1.0 to drive low.
#define P1_B0__HIGH  0x01 ///< P1.0 is high. Set P1.0 to drive or float high.

#define P1_B1__BMASK 0x02 ///< Port 1 Bit 1 Latch
#define P1_B1__SHIFT 0x01 ///< Port 1 Bit 1 Latch
#define P1_B1__LOW   0x00 ///< P1.1 is low. Set P1.1 to drive low.
#define P1_B1__HIGH  0x02 ///< P1.1 is high. Set P1.1 to drive or float high.

#define P1_B2__BMASK 0x04 ///< Port 1 Bit 2 Latch
#define P1_B2__SHIFT 0x02 ///< Port 1 Bit 2 Latch
#define P1_B2__LOW   0x00 ///< P1.2 is low. Set P1.2 to drive low.
#define P1_B2__HIGH  0x04 ///< P1.2 is high. Set P1.2 to drive or float high.

#define P1_B3__BMASK 0x08 ///< Port 1 Bit 3 Latch
#define P1_B3__SHIFT 0x03 ///< Port 1 Bit 3 Latch
#define P1_B3__LOW   0x00 ///< P1.3 is low. Set P1.3 to drive low.
#define P1_B3__HIGH  0x08 ///< P1.3 is high. Set P1.3 to drive or float high.

