ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define P1_B4__BMASK 0x10 ///< Port 1 Bit 4 Latch
#define P1_B4__SHIFT 0x04 ///< Port 1 Bit 4 Latch
#define P1_B4__LOW   0x00 ///< P1.4 is low. Set P1.4 to drive low.
#define P1_B4__HIGH  0x10 ///< P1.4 is high. Set P1.4 to drive or float high.

#define P1_B5__BMASK 0x20 ///< Port 1 Bit 5 Latch
#define P1_B5__SHIFT 0x05 ///< Port 1 Bit 5 Latch
#define P1_B5__LOW   0x00 ///< P1.5 is low. Set P1.5 to drive low.
#define P1_B5__HIGH  0x20 ///< P1.5 is high. Set P1.5 to drive or float high.

#define P1_B6__BMASK 0x40 ///< Port 1 Bit 6 Latch
#define P1_B6__SHIFT 0x06 ///< Port 1 Bit 6 Latch
#define P1_B6__LOW   0x00 ///< P1.6 is low. Set P1.6 to drive low.
#define P1_B6__HIGH  0x40 ///< P1.6 is high. Set P1.6 to drive or float high.

#define P1_B7__BMASK 0x80 ///< Port 1 Bit 7 Latch
#define P1_B7__SHIFT 0x07 ///< Port 1 Bit 7 Latch
#define P1_B7__LOW   0x00 ///< P1.7 is low. Set P1.7 to drive low.
#define P1_B7__HIGH  0x80 ///< P1.7 is high. Set P1.7 to drive or float high.

//------------------------------------------------------------------------------
// P1MASK Enums (Port 1 Mask @ 0xEE)
//------------------------------------------------------------------------------
#define P1MASK_B0__BMASK    0x01 ///< Port 1 Bit 0 Mask Value
#define P1MASK_B0__SHIFT    0x00 ///< Port 1 Bit 0 Mask Value
#define P1MASK_B0__IGNORED  0x00 ///< P1.0 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B0__COMPARED 0x01 ///< P1.0 pin logic value is compared to P1MAT.0.

#define P1MASK_B1__BMASK    0x02 ///< Port 1 Bit 1 Mask Value
#define P1MASK_B1__SHIFT    0x01 ///< Port 1 Bit 1 Mask Value
#define P1MASK_B1__IGNORED  0x00 ///< P1.1 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B1__COMPARED 0x02 ///< P1.1 pin logic value is compared to P1MAT.1.

#define P1MASK_B2__BMASK    0x04 ///< Port 1 Bit 2 Mask Value
#define P1MASK_B2__SHIFT    0x02 ///< Port 1 Bit 2 Mask Value
#define P1MASK_B2__IGNORED  0x00 ///< P1.2 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B2__COMPARED 0x04 ///< P1.2 pin logic value is compared to P1MAT.2.

#define P1MASK_B3__BMASK    0x08 ///< Port 1 Bit 3 Mask Value
#define P1MASK_B3__SHIFT    0x03 ///< Port 1 Bit 3 Mask Value
#define P1MASK_B3__IGNORED  0x00 ///< P1.3 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B3__COMPARED 0x08 ///< P1.3 pin logic value is compared to P1MAT.3.

#define P1MASK_B4__BMASK    0x10 ///< Port 1 Bit 4 Mask Value
#define P1MASK_B4__SHIFT    0x04 ///< Port 1 Bit 4 Mask Value
#define P1MASK_B4__IGNORED  0x00 ///< P1.4 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B4__COMPARED 0x10 ///< P1.4 pin logic value is compared to P1MAT.4.

#define P1MASK_B5__BMASK    0x20 ///< Port 1 Bit 5 Mask Value
#define P1MASK_B5__SHIFT    0x05 ///< Port 1 Bit 5 Mask Value
#define P1MASK_B5__IGNORED  0x00 ///< P1.5 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B5__COMPARED 0x20 ///< P1.5 pin logic value is compared to P1MAT.5.

#define P1MASK_B6__BMASK    0x40 ///< Port 1 Bit 6 Mask Value
#define P1MASK_B6__SHIFT    0x06 ///< Port 1 Bit 6 Mask Value
#define P1MASK_B6__IGNORED  0x00 ///< P1.6 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B6__COMPARED 0x40 ///< P1.6 pin logic value is compared to P1MAT.6.

#define P1MASK_B7__BMASK    0x80 ///< Port 1 Bit 7 Mask Value
#define P1MASK_B7__SHIFT    0x07 ///< Port 1 Bit 7 Mask Value
#define P1MASK_B7__IGNORED  0x00 ///< P1.7 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P1MASK_B7__COMPARED 0x80 ///< P1.7 pin logic value is compared to P1MAT.7.

//------------------------------------------------------------------------------
// P1MAT Enums (Port 1 Match @ 0xED)
//------------------------------------------------------------------------------
#define P1MAT_B0__BMASK 0x01 ///< Port 1 Bit 0 Match Value
#define P1MAT_B0__SHIFT 0x00 ///< Port 1 Bit 0 Match Value
#define P1MAT_B0__LOW   0x00 ///< P1.0 pin logic value is compared with logic LOW.
#define P1MAT_B0__HIGH  0x01 ///< P1.0 pin logic value is compared with logic HIGH.

#define P1MAT_B1__BMASK 0x02 ///< Port 1 Bit 1 Match Value
#define P1MAT_B1__SHIFT 0x01 ///< Port 1 Bit 1 Match Value
#define P1MAT_B1__LOW   0x00 ///< P1.1 pin logic value is compared with logic LOW.
#define P1MAT_B1__HIGH  0x02 ///< P1.1 pin logic value is compared with logic HIGH.

#define P1MAT_B2__BMASK 0x04 ///< Port 1 Bit 2 Match Value
#define P1MAT_B2__SHIFT 0x02 ///< Port 1 Bit 2 Match Value
#define P1MAT_B2__LOW   0x00 ///< P1.2 pin logic value is compared with logic LOW.
#define P1MAT_B2__HIGH  0x04 ///< P1.2 pin logic value is compared with logic HIGH.

#define P1MAT_B3__BMASK 0x08 ///< Port 1 Bit 3 Match Value
#define P1MAT_B3__SHIFT 0x03 ///< Port 1 Bit 3 Match Value
#define P1MAT_B3__LOW   0x00 ///< P1.3 pin logic value is compared with logic LOW.
#define P1MAT_B3__HIGH  0x08 ///< P1.3 pin logic value is compared with logic HIGH.

#define P1MAT_B4__BMASK 0x10 ///< Port 1 Bit 4 Match Value
#define P1MAT_B4__SHIFT 0x04 ///< Port 1 Bit 4 Match Value
#define P1MAT_B4__LOW   0x00 ///< P1.4 pin logic value is compared with logic LOW.
#define P1MAT_B4__HIGH  0x10 ///< P1.4 pin logic value is compared with logic HIGH.

#define P1MAT_B5__BMASK 0x20 ///< Port 1 Bit 5 Match Value
#define P1MAT_B5__SHIFT 0x05 ///< Port 1 Bit 5 Match Value
#define P1MAT_B5__LOW   0x00 ///< P1.5 pin logic value is compared with logic LOW.
#define P1MAT_B5__HIGH  0x20 ///< P1.5 pin logic value is compared with logic HIGH.

#define P1MAT_B6__BMASK 0x40 ///< Port 1 Bit 6 Match Value
#define P1MAT_B6__SHIFT 0x06 ///< Port 1 Bit 6 Match Value
#define P1MAT_B6__LOW   0x00 ///< P1.6 pin logic value is compared with logic LOW.
#define P1MAT_B6__HIGH  0x40 ///< P1.6 pin logic value is compared with logic HIGH.

