ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define P1MAT_B7__BMASK 0x80 ///< Port 1 Bit 7 Match Value
#define P1MAT_B7__SHIFT 0x07 ///< Port 1 Bit 7 Match Value
#define P1MAT_B7__LOW   0x00 ///< P1.7 pin logic value is compared with logic LOW.
#define P1MAT_B7__HIGH  0x80 ///< P1.7 pin logic value is compared with logic HIGH.

//------------------------------------------------------------------------------
// P1MDIN Enums (Port 1 Input Mode @ 0xF2)
//------------------------------------------------------------------------------
#define P1MDIN_B0__BMASK   0x01 ///< Port 1 Bit 0 Input Mode
#define P1MDIN_B0__SHIFT   0x00 ///< Port 1 Bit 0 Input Mode
#define P1MDIN_B0__ANALOG  0x00 ///< P1.0 pin is configured for analog mode.
#define P1MDIN_B0__DIGITAL 0x01 ///< P1.0 pin is configured for digital mode.

#define P1MDIN_B1__BMASK   0x02 ///< Port 1 Bit 1 Input Mode
#define P1MDIN_B1__SHIFT   0x01 ///< Port 1 Bit 1 Input Mode
#define P1MDIN_B1__ANALOG  0x00 ///< P1.1 pin is configured for analog mode.
#define P1MDIN_B1__DIGITAL 0x02 ///< P1.1 pin is configured for digital mode.

#define P1MDIN_B2__BMASK   0x04 ///< Port 1 Bit 2 Input Mode
#define P1MDIN_B2__SHIFT   0x02 ///< Port 1 Bit 2 Input Mode
#define P1MDIN_B2__ANALOG  0x00 ///< P1.2 pin is configured for analog mode.
#define P1MDIN_B2__DIGITAL 0x04 ///< P1.2 pin is configured for digital mode.

#define P1MDIN_B3__BMASK   0x08 ///< Port 1 Bit 3 Input Mode
#define P1MDIN_B3__SHIFT   0x03 ///< Port 1 Bit 3 Input Mode
#define P1MDIN_B3__ANALOG  0x00 ///< P1.3 pin is configured for analog mode.
#define P1MDIN_B3__DIGITAL 0x08 ///< P1.3 pin is configured for digital mode.

#define P1MDIN_B4__BMASK   0x10 ///< Port 1 Bit 4 Input Mode
#define P1MDIN_B4__SHIFT   0x04 ///< Port 1 Bit 4 Input Mode
#define P1MDIN_B4__ANALOG  0x00 ///< P1.4 pin is configured for analog mode.
#define P1MDIN_B4__DIGITAL 0x10 ///< P1.4 pin is configured for digital mode.

#define P1MDIN_B5__BMASK   0x20 ///< Port 1 Bit 5 Input Mode
#define P1MDIN_B5__SHIFT   0x05 ///< Port 1 Bit 5 Input Mode
#define P1MDIN_B5__ANALOG  0x00 ///< P1.5 pin is configured for analog mode.
#define P1MDIN_B5__DIGITAL 0x20 ///< P1.5 pin is configured for digital mode.

#define P1MDIN_B6__BMASK   0x40 ///< Port 1 Bit 6 Input Mode
#define P1MDIN_B6__SHIFT   0x06 ///< Port 1 Bit 6 Input Mode
#define P1MDIN_B6__ANALOG  0x00 ///< P1.6 pin is configured for analog mode.
#define P1MDIN_B6__DIGITAL 0x40 ///< P1.6 pin is configured for digital mode.

#define P1MDIN_B7__BMASK   0x80 ///< Port 1 Bit 7 Input Mode
#define P1MDIN_B7__SHIFT   0x07 ///< Port 1 Bit 7 Input Mode
#define P1MDIN_B7__ANALOG  0x00 ///< P1.7 pin is configured for analog mode.
#define P1MDIN_B7__DIGITAL 0x80 ///< P1.7 pin is configured for digital mode.

//------------------------------------------------------------------------------
// P1MDOUT Enums (Port 1 Output Mode @ 0xA5)
//------------------------------------------------------------------------------
#define P1MDOUT_B0__BMASK      0x01 ///< Port 1 Bit 0 Output Mode
#define P1MDOUT_B0__SHIFT      0x00 ///< Port 1 Bit 0 Output Mode
#define P1MDOUT_B0__OPEN_DRAIN 0x00 ///< P1.0 output is open-drain.
#define P1MDOUT_B0__PUSH_PULL  0x01 ///< P1.0 output is push-pull.

#define P1MDOUT_B1__BMASK      0x02 ///< Port 1 Bit 1 Output Mode
#define P1MDOUT_B1__SHIFT      0x01 ///< Port 1 Bit 1 Output Mode
#define P1MDOUT_B1__OPEN_DRAIN 0x00 ///< P1.1 output is open-drain.
#define P1MDOUT_B1__PUSH_PULL  0x02 ///< P1.1 output is push-pull.

#define P1MDOUT_B2__BMASK      0x04 ///< Port 1 Bit 2 Output Mode
#define P1MDOUT_B2__SHIFT      0x02 ///< Port 1 Bit 2 Output Mode
#define P1MDOUT_B2__OPEN_DRAIN 0x00 ///< P1.2 output is open-drain.
#define P1MDOUT_B2__PUSH_PULL  0x04 ///< P1.2 output is push-pull.

#define P1MDOUT_B3__BMASK      0x08 ///< Port 1 Bit 3 Output Mode
#define P1MDOUT_B3__SHIFT      0x03 ///< Port 1 Bit 3 Output Mode
#define P1MDOUT_B3__OPEN_DRAIN 0x00 ///< P1.3 output is open-drain.
#define P1MDOUT_B3__PUSH_PULL  0x08 ///< P1.3 output is push-pull.

#define P1MDOUT_B4__BMASK      0x10 ///< Port 1 Bit 4 Output Mode
#define P1MDOUT_B4__SHIFT      0x04 ///< Port 1 Bit 4 Output Mode
#define P1MDOUT_B4__OPEN_DRAIN 0x00 ///< P1.4 output is open-drain.
#define P1MDOUT_B4__PUSH_PULL  0x10 ///< P1.4 output is push-pull.

#define P1MDOUT_B5__BMASK      0x20 ///< Port 1 Bit 5 Output Mode
#define P1MDOUT_B5__SHIFT      0x05 ///< Port 1 Bit 5 Output Mode
#define P1MDOUT_B5__OPEN_DRAIN 0x00 ///< P1.5 output is open-drain.
#define P1MDOUT_B5__PUSH_PULL  0x20 ///< P1.5 output is push-pull.

#define P1MDOUT_B6__BMASK      0x40 ///< Port 1 Bit 6 Output Mode
#define P1MDOUT_B6__SHIFT      0x06 ///< Port 1 Bit 6 Output Mode
#define P1MDOUT_B6__OPEN_DRAIN 0x00 ///< P1.6 output is open-drain.
#define P1MDOUT_B6__PUSH_PULL  0x40 ///< P1.6 output is push-pull.

#define P1MDOUT_B7__BMASK      0x80 ///< Port 1 Bit 7 Output Mode
#define P1MDOUT_B7__SHIFT      0x07 ///< Port 1 Bit 7 Output Mode
#define P1MDOUT_B7__OPEN_DRAIN 0x00 ///< P1.7 output is open-drain.
#define P1MDOUT_B7__PUSH_PULL  0x80 ///< P1.7 output is push-pull.

//------------------------------------------------------------------------------
// P1SKIP Enums (Port 1 Skip @ 0xD5)
//------------------------------------------------------------------------------
#define P1SKIP_B0__BMASK       0x01 ///< Port 1 Bit 0 Skip
#define P1SKIP_B0__SHIFT       0x00 ///< Port 1 Bit 0 Skip
#define P1SKIP_B0__NOT_SKIPPED 0x00 ///< P1.0 pin is not skipped by the crossbar.
#define P1SKIP_B0__SKIPPED     0x01 ///< P1.0 pin is skipped by the crossbar.

#define P1SKIP_B1__BMASK       0x02 ///< Port 1 Bit 1 Skip
#define P1SKIP_B1__SHIFT       0x01 ///< Port 1 Bit 1 Skip
#define P1SKIP_B1__NOT_SKIPPED 0x00 ///< P1.1 pin is not skipped by the crossbar.
#define P1SKIP_B1__SKIPPED     0x02 ///< P1.1 pin is skipped by the crossbar.

#define P1SKIP_B2__BMASK       0x04 ///< Port 1 Bit 2 Skip
#define P1SKIP_B2__SHIFT       0x02 ///< Port 1 Bit 2 Skip
#define P1SKIP_B2__NOT_SKIPPED 0x00 ///< P1.2 pin is not skipped by the crossbar.
#define P1SKIP_B2__SKIPPED     0x04 ///< P1.2 pin is skipped by the crossbar.

