ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define P1SKIP_B3__BMASK       0x08 ///< Port 1 Bit 3 Skip
#define P1SKIP_B3__SHIFT       0x03 ///< Port 1 Bit 3 Skip
#define P1SKIP_B3__NOT_SKIPPED 0x00 ///< P1.3 pin is not skipped by the crossbar.
#define P1SKIP_B3__SKIPPED     0x08 ///< P1.3 pin is skipped by the crossbar.

#define P1SKIP_B4__BMASK       0x10 ///< Port 1 Bit 4 Skip
#define P1SKIP_B4__SHIFT       0x04 ///< Port 1 Bit 4 Skip
#define P1SKIP_B4__NOT_SKIPPED 0x00 ///< P1.4 pin is not skipped by the crossbar.
#define P1SKIP_B4__SKIPPED     0x10 ///< P1.4 pin is skipped by the crossbar.

#define P1SKIP_B5__BMASK       0x20 ///< Port 1 Bit 5 Skip
#define P1SKIP_B5__SHIFT       0x05 ///< Port 1 Bit 5 Skip
#define P1SKIP_B5__NOT_SKIPPED 0x00 ///< P1.5 pin is not skipped by the crossbar.
#define P1SKIP_B5__SKIPPED     0x20 ///< P1.5 pin is skipped by the crossbar.

#define P1SKIP_B6__BMASK       0x40 ///< Port 1 Bit 6 Skip
#define P1SKIP_B6__SHIFT       0x06 ///< Port 1 Bit 6 Skip
#define P1SKIP_B6__NOT_SKIPPED 0x00 ///< P1.6 pin is not skipped by the crossbar.
#define P1SKIP_B6__SKIPPED     0x40 ///< P1.6 pin is skipped by the crossbar.

#define P1SKIP_B7__BMASK       0x80 ///< Port 1 Bit 7 Skip
#define P1SKIP_B7__SHIFT       0x07 ///< Port 1 Bit 7 Skip
#define P1SKIP_B7__NOT_SKIPPED 0x00 ///< P1.7 pin is not skipped by the crossbar.
#define P1SKIP_B7__SKIPPED     0x80 ///< P1.7 pin is skipped by the crossbar.

//------------------------------------------------------------------------------
// P2 Enums (Port 2 Pin Latch @ 0xA0)
//------------------------------------------------------------------------------
#define P2_B0__BMASK 0x01 ///< Port 2 Bit 0 Latch
#define P2_B0__SHIFT 0x00 ///< Port 2 Bit 0 Latch
#define P2_B0__LOW   0x00 ///< P2.0 is low. Set P2.0 to drive low.
#define P2_B0__HIGH  0x01 ///< P2.0 is high. Set P2.0 to drive or float high.

#define P2_B1__BMASK 0x02 ///< Port 2 Bit 1 Latch
#define P2_B1__SHIFT 0x01 ///< Port 2 Bit 1 Latch
#define P2_B1__LOW   0x00 ///< P2.1 is low. Set P2.1 to drive low.
#define P2_B1__HIGH  0x02 ///< P2.1 is high. Set P2.1 to drive or float high.

//------------------------------------------------------------------------------
// P2MASK Enums (Port 2 Mask @ 0xFC)
//------------------------------------------------------------------------------
#define P2MASK_B0__BMASK    0x01 ///< Port 2 Bit 0 Mask Value
#define P2MASK_B0__SHIFT    0x00 ///< Port 2 Bit 0 Mask Value
#define P2MASK_B0__IGNORED  0x00 ///< P2.0 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P2MASK_B0__COMPARED 0x01 ///< P2.0 pin logic value is compared to P2MAT.0.

#define P2MASK_B1__BMASK    0x02 ///< Port 2 Bit 1 Mask Value
#define P2MASK_B1__SHIFT    0x01 ///< Port 2 Bit 1 Mask Value
#define P2MASK_B1__IGNORED  0x00 ///< P2.1 pin logic value is ignored and will not cause
                                 ///< a port mismatch event.
#define P2MASK_B1__COMPARED 0x02 ///< P2.1 pin logic value is compared to P2MAT.1.

//------------------------------------------------------------------------------
// P2MAT Enums (Port 2 Match @ 0xFB)
//------------------------------------------------------------------------------
#define P2MAT_B0__BMASK 0x01 ///< Port 2 Bit 0 Match Value
#define P2MAT_B0__SHIFT 0x00 ///< Port 2 Bit 0 Match Value
#define P2MAT_B0__LOW   0x00 ///< P2.0 pin logic value is compared with logic LOW.
#define P2MAT_B0__HIGH  0x01 ///< P2.0 pin logic value is compared with logic HIGH.

#define P2MAT_B1__BMASK 0x02 ///< Port 2 Bit 1 Match Value
#define P2MAT_B1__SHIFT 0x01 ///< Port 2 Bit 1 Match Value
#define P2MAT_B1__LOW   0x00 ///< P2.1 pin logic value is compared with logic LOW.
#define P2MAT_B1__HIGH  0x02 ///< P2.1 pin logic value is compared with logic HIGH.

//------------------------------------------------------------------------------
// P2MDIN Enums (Port 2 Input Mode @ 0xF3)
//------------------------------------------------------------------------------
#define P2MDIN_B0__BMASK   0x01 ///< Port 2 Bit 0 Input Mode
#define P2MDIN_B0__SHIFT   0x00 ///< Port 2 Bit 0 Input Mode
#define P2MDIN_B0__ANALOG  0x00 ///< P2.0 pin is configured for analog mode.
#define P2MDIN_B0__DIGITAL 0x01 ///< P2.0 pin is configured for digital mode.

#define P2MDIN_B1__BMASK   0x02 ///< Port 2 Bit 1 Input Mode
#define P2MDIN_B1__SHIFT   0x01 ///< Port 2 Bit 1 Input Mode
#define P2MDIN_B1__ANALOG  0x00 ///< P2.1 pin is configured for analog mode.
#define P2MDIN_B1__DIGITAL 0x02 ///< P2.1 pin is configured for digital mode.

//------------------------------------------------------------------------------
// P2MDOUT Enums (Port 2 Output Mode @ 0xA6)
//------------------------------------------------------------------------------
#define P2MDOUT_B0__BMASK      0x01 ///< Port 2 Bit 0 Output Mode
#define P2MDOUT_B0__SHIFT      0x00 ///< Port 2 Bit 0 Output Mode
#define P2MDOUT_B0__OPEN_DRAIN 0x00 ///< P2.0 output is open-drain.
#define P2MDOUT_B0__PUSH_PULL  0x01 ///< P2.0 output is push-pull.

#define P2MDOUT_B1__BMASK      0x02 ///< Port 2 Bit 1 Output Mode
#define P2MDOUT_B1__SHIFT      0x01 ///< Port 2 Bit 1 Output Mode
#define P2MDOUT_B1__OPEN_DRAIN 0x00 ///< P2.1 output is open-drain.
#define P2MDOUT_B1__PUSH_PULL  0x02 ///< P2.1 output is push-pull.

//------------------------------------------------------------------------------
// RSTSRC Enums (Reset Source @ 0xEF)
//------------------------------------------------------------------------------
#define RSTSRC_PINRSF__BMASK   0x01 ///< HW Pin Reset Flag
#define RSTSRC_PINRSF__SHIFT   0x00 ///< HW Pin Reset Flag
#define RSTSRC_PINRSF__NOT_SET 0x00 ///< The RSTb pin did not cause the last reset.
#define RSTSRC_PINRSF__SET     0x01 ///< The RSTb pin caused the last reset.

#define RSTSRC_PORSF__BMASK    0x02 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__SHIFT    0x01 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
#define RSTSRC_PORSF__NOT_SET  0x00 ///< A power-on or supply monitor reset did not occur.
#define RSTSRC_PORSF__SET      0x02 ///< A power-on or supply monitor reset occurred.

