ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define RSTSRC_MCDRSF__BMASK   0x04 ///< Missing Clock Detector Enable and Flag
#define RSTSRC_MCDRSF__SHIFT   0x02 ///< Missing Clock Detector Enable and Flag
#define RSTSRC_MCDRSF__NOT_SET 0x00 ///< A missing clock detector reset did not occur.
#define RSTSRC_MCDRSF__SET     0x04 ///< A missing clock detector reset occurred.

#define RSTSRC_WDTRSF__BMASK   0x08 ///< Watchdog Timer Reset Flag
#define RSTSRC_WDTRSF__SHIFT   0x03 ///< Watchdog Timer Reset Flag
#define RSTSRC_WDTRSF__NOT_SET 0x00 ///< A watchdog timer overflow reset did not occur.
#define RSTSRC_WDTRSF__SET     0x08 ///< A watchdog timer overflow reset occurred.

#define RSTSRC_SWRSF__BMASK    0x10 ///< Software Reset Force and Flag
#define RSTSRC_SWRSF__SHIFT    0x04 ///< Software Reset Force and Flag
#define RSTSRC_SWRSF__NOT_SET  0x00 ///< A software reset did not occur.
#define RSTSRC_SWRSF__SET      0x10 ///< A software reset occurred.

#define RSTSRC_C0RSEF__BMASK   0x20 ///< Comparator0 Reset Enable and Flag
#define RSTSRC_C0RSEF__SHIFT   0x05 ///< Comparator0 Reset Enable and Flag
#define RSTSRC_C0RSEF__NOT_SET 0x00 ///< A Comparator 0 reset did not occur.
#define RSTSRC_C0RSEF__SET     0x20 ///< A Comparator 0 reset occurred.

#define RSTSRC_FERROR__BMASK   0x40 ///< Flash Error Reset Flag
#define RSTSRC_FERROR__SHIFT   0x06 ///< Flash Error Reset Flag
#define RSTSRC_FERROR__NOT_SET 0x00 ///< A flash error reset did not occur.
#define RSTSRC_FERROR__SET     0x40 ///< A flash error reset occurred.

#define RSTSRC_USBRSF__BMASK   0x80 ///< USB Reset Enable and Flag
#define RSTSRC_USBRSF__SHIFT   0x07 ///< USB Reset Enable and Flag
#define RSTSRC_USBRSF__NOT_SET 0x00 ///< A USB0 reset did not occur.
#define RSTSRC_USBRSF__SET     0x80 ///< A USB0 reset occurred.

//------------------------------------------------------------------------------
// SFRPAGE Enums (SFR Page @ 0xA7)
//------------------------------------------------------------------------------
#define SFRPAGE_SFRPAGE__FMASK 0xFF ///< SFR Page
#define SFRPAGE_SFRPAGE__SHIFT 0x00 ///< SFR Page

//------------------------------------------------------------------------------
// SFRPGCN Enums (SFR Page Control @ 0xCF)
//------------------------------------------------------------------------------
#define SFRPGCN_SFRPGEN__BMASK        0x01 ///< SFR Automatic Page Control Enable
#define SFRPGCN_SFRPGEN__SHIFT        0x00 ///< SFR Automatic Page Control Enable
#define SFRPGCN_SFRPGEN__DISABLED     0x00 ///< Disable automatic SFR paging.
#define SFRPGCN_SFRPGEN__ENABLED      0x01 ///< Enable automatic SFR paging.

#define SFRPGCN_SFRPGIDX__FMASK       0x70 ///< SFR Page Stack Index
#define SFRPGCN_SFRPGIDX__SHIFT       0x04 ///< SFR Page Stack Index
#define SFRPGCN_SFRPGIDX__FIRST_BYTE  0x00 ///< SFRSTACK contains the value of SFRPAGE, the
                                           ///< first/top byte of the SFR page stack.
#define SFRPGCN_SFRPGIDX__SECOND_BYTE 0x10 ///< SFRSTACK contains the value of the second byte of
                                           ///< the SFR page stack.
#define SFRPGCN_SFRPGIDX__THIRD_BYTE  0x20 ///< SFRSTACK contains the value of the third byte of
                                           ///< the SFR page stack.
#define SFRPGCN_SFRPGIDX__FOURTH_BYTE 0x30 ///< SFRSTACK contains the value of the fourth byte of
                                           ///< the SFR page stack.
#define SFRPGCN_SFRPGIDX__FIFTH_BYTE  0x40 ///< SFRSTACK contains the value of the fifth byte of
                                           ///< the SFR page stack.

//------------------------------------------------------------------------------
// SFRSTACK Enums (SFR Page Stack @ 0xD7)
//------------------------------------------------------------------------------
#define SFRSTACK_SFRSTACK__FMASK 0xFF ///< SFR Page Stack
#define SFRSTACK_SFRSTACK__SHIFT 0x00 ///< SFR Page Stack

//------------------------------------------------------------------------------
// SMB0ADM Enums (SMBus 0 Slave Address Mask @ 0xD6)
//------------------------------------------------------------------------------
#define SMB0ADM_EHACK__BMASK             0x01 ///< Hardware Acknowledge Enable
#define SMB0ADM_EHACK__SHIFT             0x00 ///< Hardware Acknowledge Enable
#define SMB0ADM_EHACK__ADR_ACK_MANUAL    0x00 ///< Firmware must manually acknowledge all incoming
                                              ///< address and data bytes.
#define SMB0ADM_EHACK__ADR_ACK_AUTOMATIC 0x01 ///< Automatic slave address recognition and hardware
                                              ///< acknowledge is enabled.

#define SMB0ADM_SLVM__FMASK              0xFE ///< SMBus Slave Address Mask
#define SMB0ADM_SLVM__SHIFT              0x01 ///< SMBus Slave Address Mask

//------------------------------------------------------------------------------
// SMB0ADR Enums (SMBus 0 Slave Address @ 0xD7)
//------------------------------------------------------------------------------
#define SMB0ADR_GC__BMASK      0x01 ///< General Call Address Enable
#define SMB0ADR_GC__SHIFT      0x00 ///< General Call Address Enable
#define SMB0ADR_GC__IGNORED    0x00 ///< General Call Address is ignored.
#define SMB0ADR_GC__RECOGNIZED 0x01 ///< General Call Address is recognized.

#define SMB0ADR_SLV__FMASK     0xFE ///< SMBus Hardware Slave Address
#define SMB0ADR_SLV__SHIFT     0x01 ///< SMBus Hardware Slave Address

//------------------------------------------------------------------------------
// SMB0CF Enums (SMBus 0 Configuration @ 0xC1)
//------------------------------------------------------------------------------
#define SMB0CF_SMBCS__FMASK             0x03 ///< SMBus Clock Source Selection
#define SMB0CF_SMBCS__SHIFT             0x00 ///< SMBus Clock Source Selection
#define SMB0CF_SMBCS__TIMER0            0x00 ///< Timer 0 Overflow.
#define SMB0CF_SMBCS__TIMER1            0x01 ///< Timer 1 Overflow.
#define SMB0CF_SMBCS__TIMER2_HIGH       0x02 ///< Timer 2 High Byte Overflow.
#define SMB0CF_SMBCS__TIMER2_LOW        0x03 ///< Timer 2 Low Byte Overflow.

#define SMB0CF_SMBFTE__BMASK            0x04 ///< SMBus Free Timeout Detection Enable
#define SMB0CF_SMBFTE__SHIFT            0x02 ///< SMBus Free Timeout Detection Enable
#define SMB0CF_SMBFTE__FREE_TO_DISABLED 0x00 ///< Disable bus free timeouts.
#define SMB0CF_SMBFTE__FREE_TO_ENABLED  0x04 ///< Enable bus free timeouts. The bus the bus will be
                                             ///< considered free if SCL and SDA remain high for
                                             ///< more than 10 SMBus clock source periods.

#define SMB0CF_SMBTOE__BMASK            0x08 ///< SMBus SCL Timeout Detection Enable
#define SMB0CF_SMBTOE__SHIFT            0x03 ///< SMBus SCL Timeout Detection Enable
#define SMB0CF_SMBTOE__SCL_TO_DISABLED  0x00 ///< Disable SCL low timeouts.
#define SMB0CF_SMBTOE__SCL_TO_ENABLED   0x08 ///< Enable SCL low timeouts.

#define SMB0CF_EXTHOLD__BMASK           0x10 ///< SMBus Setup and Hold Time Extension Enable
#define SMB0CF_EXTHOLD__SHIFT           0x04 ///< SMBus Setup and Hold Time Extension Enable
#define SMB0CF_EXTHOLD__DISABLED        0x00 ///< Disable SDA extended setup and hold times.
#define SMB0CF_EXTHOLD__ENABLED         0x10 ///< Enable SDA extended setup and hold times. See the
                                             ///< DLYEXT field in SMB0TC for the number of SYSCLKs
                                             ///< to extend the setup and hold times.

#define SMB0CF_BUSY__BMASK              0x20 ///< SMBus Busy Indicator
#define SMB0CF_BUSY__SHIFT              0x05 ///< SMBus Busy Indicator
#define SMB0CF_BUSY__NOT_SET            0x00 ///< The bus is not busy.
#define SMB0CF_BUSY__SET                0x20 ///< The bus is busy and a transfer is currently in
                                             ///< progress.

#define SMB0CF_INH__BMASK               0x40 ///< SMBus Slave Inhibit
#define SMB0CF_INH__SHIFT               0x06 ///< SMBus Slave Inhibit
#define SMB0CF_INH__SLAVE_ENABLED       0x00 ///< Slave states are enabled.
#define SMB0CF_INH__SLAVE_DISABLED      0x40 ///< Slave states are inhibited.

#define SMB0CF_ENSMB__BMASK             0x80 ///< SMBus Enable
#define SMB0CF_ENSMB__SHIFT             0x07 ///< SMBus Enable
#define SMB0CF_ENSMB__DISABLED          0x00 ///< Disable the SMBus module.
#define SMB0CF_ENSMB__ENABLED           0x80 ///< Enable the SMBus module.

//------------------------------------------------------------------------------
// SMB0CN0 Enums (SMBus 0 Control @ 0xC0)
//------------------------------------------------------------------------------
#define SMB0CN0_SI__BMASK           0x01 ///< SMBus Interrupt Flag
#define SMB0CN0_SI__SHIFT           0x00 ///< SMBus Interrupt Flag
#define SMB0CN0_SI__NOT_SET         0x00 ///<
#define SMB0CN0_SI__SET             0x01 ///<

#define SMB0CN0_ACK__BMASK          0x02 ///< SMBus Acknowledge
#define SMB0CN0_ACK__SHIFT          0x01 ///< SMBus Acknowledge
#define SMB0CN0_ACK__NOT_SET        0x00 ///< Generate a NACK, or the response was a NACK.
#define SMB0CN0_ACK__SET            0x02 ///< Generate an ACK, or the response was an ACK.

