ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define SMB0TC_SWAP__BMASK        0x80 ///< SMBus Swap Pins
#define SMB0TC_SWAP__SHIFT        0x07 ///< SMBus Swap Pins
#define SMB0TC_SWAP__SDA_LOW_PIN  0x00 ///< SDA is mapped to the lower-numbered port pin, and
                                       ///< SCL is mapped to the higher-numbered port pin.
#define SMB0TC_SWAP__SDA_HIGH_PIN 0x80 ///< SCL is mapped to the lower-numbered port pin, and
                                       ///< SDA is mapped to the higher-numbered port pin.

//------------------------------------------------------------------------------
// SPI0CFG Enums (SPI0 Configuration @ 0xA1)
//------------------------------------------------------------------------------
#define SPI0CFG_RXE__BMASK                  0x01 ///< RX FIFO Empty
#define SPI0CFG_RXE__SHIFT                  0x00 ///< RX FIFO Empty
#define SPI0CFG_RXE__NOT_EMPTY              0x00 ///< The RX FIFO contains data.
#define SPI0CFG_RXE__EMPTY                  0x01 ///< The RX FIFO is empty.

#define SPI0CFG_SRMT__BMASK                 0x02 ///< Shift Register Empty
#define SPI0CFG_SRMT__SHIFT                 0x01 ///< Shift Register Empty
#define SPI0CFG_SRMT__NOT_SET               0x00 ///< The shift register is not empty.
#define SPI0CFG_SRMT__SET                   0x02 ///< The shift register is empty.

#define SPI0CFG_NSSIN__BMASK                0x04 ///< NSS Instantaneous Pin Input
#define SPI0CFG_NSSIN__SHIFT                0x02 ///< NSS Instantaneous Pin Input
#define SPI0CFG_NSSIN__LOW                  0x00 ///< The NSS pin is low.
#define SPI0CFG_NSSIN__HIGH                 0x04 ///< The NSS pin is high.

#define SPI0CFG_SLVSEL__BMASK               0x08 ///< Slave Selected Flag
#define SPI0CFG_SLVSEL__SHIFT               0x03 ///< Slave Selected Flag
#define SPI0CFG_SLVSEL__NOT_SELECTED        0x00 ///< The Slave is not selected (NSS is high).
#define SPI0CFG_SLVSEL__SELECTED            0x08 ///< The Slave is selected (NSS is low).

#define SPI0CFG_CKPOL__BMASK                0x10 ///< SPI0 Clock Polarity
#define SPI0CFG_CKPOL__SHIFT                0x04 ///< SPI0 Clock Polarity
#define SPI0CFG_CKPOL__IDLE_LOW             0x00 ///< SCK line low in idle state.
#define SPI0CFG_CKPOL__IDLE_HIGH            0x10 ///< SCK line high in idle state.

#define SPI0CFG_CKPHA__BMASK                0x20 ///< SPI0 Clock Phase
#define SPI0CFG_CKPHA__SHIFT                0x05 ///< SPI0 Clock Phase
#define SPI0CFG_CKPHA__DATA_CENTERED_FIRST  0x00 ///< Data centered on first edge of SCK period.
#define SPI0CFG_CKPHA__DATA_CENTERED_SECOND 0x20 ///< Data centered on second edge of SCK period.

#define SPI0CFG_MSTEN__BMASK                0x40 ///< Master Mode Enable
#define SPI0CFG_MSTEN__SHIFT                0x06 ///< Master Mode Enable
#define SPI0CFG_MSTEN__MASTER_DISABLED      0x00 ///< Disable master mode. Operate in slave mode.
#define SPI0CFG_MSTEN__MASTER_ENABLED       0x40 ///< Enable master mode. Operate as a master.

#define SPI0CFG_SPIBSY__BMASK               0x80 ///< SPI Busy
#define SPI0CFG_SPIBSY__SHIFT               0x07 ///< SPI Busy
#define SPI0CFG_SPIBSY__NOT_SET             0x00 ///< A SPI transfer is not in progress.
#define SPI0CFG_SPIBSY__SET                 0x80 ///< A SPI transfer is in progress.

//------------------------------------------------------------------------------
// SPI0CKR Enums (SPI0 Clock Rate @ 0xA2)
//------------------------------------------------------------------------------
#define SPI0CKR_SPI0CKR__FMASK 0xFF ///< SPI0 Clock Rate
#define SPI0CKR_SPI0CKR__SHIFT 0x00 ///< SPI0 Clock Rate

//------------------------------------------------------------------------------
// SPI0CN0 Enums (SPI0 Control @ 0xF8)
//------------------------------------------------------------------------------
#define SPI0CN0_SPIEN__BMASK                  0x01 ///< SPI0 Enable
#define SPI0CN0_SPIEN__SHIFT                  0x00 ///< SPI0 Enable
#define SPI0CN0_SPIEN__DISABLED               0x00 ///< Disable the SPI module.
#define SPI0CN0_SPIEN__ENABLED                0x01 ///< Enable the SPI module.

#define SPI0CN0_TXNF__BMASK                   0x02 ///< TX FIFO Not Full
#define SPI0CN0_TXNF__SHIFT                   0x01 ///< TX FIFO Not Full
#define SPI0CN0_TXNF__FULL                    0x00 ///< The TX FIFO is full.
#define SPI0CN0_TXNF__NOT_FULL                0x02 ///< The TX FIFO has room for more data.

#define SPI0CN0_NSSMD__FMASK                  0x0C ///< Slave Select Mode
#define SPI0CN0_NSSMD__SHIFT                  0x02 ///< Slave Select Mode
#define SPI0CN0_NSSMD__3_WIRE                 0x00 ///< 3-Wire Slave or 3-Wire Master Mode. NSS signal is
                                                   ///< not routed to a port pin.
#define SPI0CN0_NSSMD__4_WIRE_SLAVE           0x04 ///< 4-Wire Slave or Multi-Master Mode. NSS is an input
                                                   ///< to the device.
#define SPI0CN0_NSSMD__4_WIRE_MASTER_NSS_LOW  0x08 ///< 4-Wire Single-Master Mode. NSS is an output and
                                                   ///< logic low.
#define SPI0CN0_NSSMD__4_WIRE_MASTER_NSS_HIGH 0x0C ///< 4-Wire Single-Master Mode. NSS is an output and
                                                   ///< logic high.

#define SPI0CN0_RXOVRN__BMASK                 0x10 ///< Receive Overrun Flag
#define SPI0CN0_RXOVRN__SHIFT                 0x04 ///< Receive Overrun Flag
#define SPI0CN0_RXOVRN__NOT_SET               0x00 ///< A receive overrun did not occur.
#define SPI0CN0_RXOVRN__SET                   0x10 ///< A receive overrun occurred.

#define SPI0CN0_MODF__BMASK                   0x20 ///< Mode Fault Flag
#define SPI0CN0_MODF__SHIFT                   0x05 ///< Mode Fault Flag
#define SPI0CN0_MODF__NOT_SET                 0x00 ///< A master collision did not occur.
#define SPI0CN0_MODF__SET                     0x20 ///< A master collision occurred.

#define SPI0CN0_WCOL__BMASK                   0x40 ///< Write Collision Flag
#define SPI0CN0_WCOL__SHIFT                   0x06 ///< Write Collision Flag
#define SPI0CN0_WCOL__NOT_SET                 0x00 ///< A write collision did not occur.
#define SPI0CN0_WCOL__SET                     0x40 ///< A write collision occurred.

