ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define SPI0CN0_SPIF__BMASK                   0x80 ///< SPI0 Interrupt Flag
#define SPI0CN0_SPIF__SHIFT                   0x07 ///< SPI0 Interrupt Flag
#define SPI0CN0_SPIF__NOT_SET                 0x00 ///< A data transfer has not completed since the last
                                                   ///< time SPIF was cleared.
#define SPI0CN0_SPIF__SET                     0x80 ///< A data transfer completed.

//------------------------------------------------------------------------------
// SPI0DAT Enums (SPI0 Data @ 0xA3)
//------------------------------------------------------------------------------
#define SPI0DAT_SPI0DAT__FMASK 0xFF ///< SPI0 Transmit and Receive Data
#define SPI0DAT_SPI0DAT__SHIFT 0x00 ///< SPI0 Transmit and Receive Data

//------------------------------------------------------------------------------
// SPI0FCN0 Enums (SPI0 FIFO Control 0 @ 0x9A)
//------------------------------------------------------------------------------
#define SPI0FCN0_RXTH__FMASK     0x03 ///< RX FIFO Threshold
#define SPI0FCN0_RXTH__SHIFT     0x00 ///< RX FIFO Threshold
#define SPI0FCN0_RXTH__ZERO      0x00 ///< RFRQ will be set anytime new data arrives in the
                                      ///< RX FIFO (when the RX FIFO is not empty).
#define SPI0FCN0_RXTH__ONE       0x01 ///< RFRQ will be set if the RX FIFO contains more than
                                      ///< one byte.

#define SPI0FCN0_RFLSH__BMASK    0x04 ///< RX FIFO Flush
#define SPI0FCN0_RFLSH__SHIFT    0x02 ///< RX FIFO Flush
#define SPI0FCN0_RFLSH__FLUSH    0x04 ///< Initiate an RX FIFO flush.

#define SPI0FCN0_RFRQE__BMASK    0x08 ///< Read Request Interrupt Enable
#define SPI0FCN0_RFRQE__SHIFT    0x03 ///< Read Request Interrupt Enable
#define SPI0FCN0_RFRQE__DISABLED 0x00 ///< SPI0 interrupts will not be generated when RFRQ is
                                      ///< set.
#define SPI0FCN0_RFRQE__ENABLED  0x08 ///< SPI0 interrupts will be generated if RFRQ is set.

#define SPI0FCN0_TXTH__FMASK     0x30 ///< TX FIFO Threshold
#define SPI0FCN0_TXTH__SHIFT     0x04 ///< TX FIFO Threshold
#define SPI0FCN0_TXTH__ZERO      0x00 ///< TFRQ will be set when the TX FIFO is empty.
#define SPI0FCN0_TXTH__ONE       0x10 ///< TFRQ will be set when the TX FIFO contains one or
                                      ///< fewer bytes.

#define SPI0FCN0_TFLSH__BMASK    0x40 ///< TX FIFO Flush
#define SPI0FCN0_TFLSH__SHIFT    0x06 ///< TX FIFO Flush
#define SPI0FCN0_TFLSH__FLUSH    0x40 ///< Initiate a TX FIFO flush.

#define SPI0FCN0_TFRQE__BMASK    0x80 ///< Write Request Interrupt Enable
#define SPI0FCN0_TFRQE__SHIFT    0x07 ///< Write Request Interrupt Enable
#define SPI0FCN0_TFRQE__DISABLED 0x00 ///< SPI0 interrupts will not be generated when TFRQ is
                                      ///< set.
#define SPI0FCN0_TFRQE__ENABLED  0x80 ///< SPI0 interrupts will be generated if TFRQ is set.

//------------------------------------------------------------------------------
// SPI0FCN1 Enums (SPI0 FIFO Control 1 @ 0x9B)
//------------------------------------------------------------------------------
#define SPI0FCN1_RXFIFOE__BMASK    0x01 ///< Receive FIFO Enable
#define SPI0FCN1_RXFIFOE__SHIFT    0x00 ///< Receive FIFO Enable
#define SPI0FCN1_RXFIFOE__DISABLED 0x00 ///< Received bytes will be discarded.
#define SPI0FCN1_RXFIFOE__ENABLED  0x01 ///< Received bytes will be placed in the RX FIFO.

#define SPI0FCN1_RXTOE__BMASK      0x02 ///< Receive Timeout Enable
#define SPI0FCN1_RXTOE__SHIFT      0x01 ///< Receive Timeout Enable
#define SPI0FCN1_RXTOE__DISABLED   0x00 ///< Lingering bytes in the RX FIFO will not generate
                                        ///< an interrupt.
#define SPI0FCN1_RXTOE__ENABLED    0x02 ///< Lingering bytes in the RX FIFO will generate an
                                        ///< interrupt after timeout.

#define SPI0FCN1_RFRQ__BMASK       0x08 ///< Receive FIFO Request
#define SPI0FCN1_RFRQ__SHIFT       0x03 ///< Receive FIFO Request
#define SPI0FCN1_RFRQ__NOT_SET     0x00 ///< The number of bytes in the RX FIFO is less than or
                                        ///< equal to RXTH.
#define SPI0FCN1_RFRQ__SET         0x08 ///< The number of bytes in the RX FIFO is greater than
                                        ///< RXTH.

#define SPI0FCN1_SPIFEN__BMASK     0x10 ///< SPIF Interrupt Enable
#define SPI0FCN1_SPIFEN__SHIFT     0x04 ///< SPIF Interrupt Enable
#define SPI0FCN1_SPIFEN__DISABLED  0x00 ///< SPI0 interrupts will not be generated when SPIF is
                                        ///< set.
#define SPI0FCN1_SPIFEN__ENABLED   0x10 ///< SPI0 interrupts will be generated if SPIF is set.

#define SPI0FCN1_TXHOLD__BMASK     0x20 ///< Transmit Hold
#define SPI0FCN1_TXHOLD__SHIFT     0x05 ///< Transmit Hold
#define SPI0FCN1_TXHOLD__CONTINUE  0x00 ///< The UART will continue to transmit any available
                                        ///< data in the TX FIFO.
#define SPI0FCN1_TXHOLD__HOLD      0x20 ///< The UART will not transmit any new data from the
                                        ///< TX FIFO.

#define SPI0FCN1_THPOL__BMASK      0x40 ///< Transmit Hold Polarity
#define SPI0FCN1_THPOL__SHIFT      0x06 ///< Transmit Hold Polarity
#define SPI0FCN1_THPOL__HOLD_0     0x00 ///< Data output will be held at logic low when TXHOLD
                                        ///< is set.
#define SPI0FCN1_THPOL__HOLD_1     0x40 ///< Data output will be held at logic high when TXHOLD
                                        ///< is set.

#define SPI0FCN1_TFRQ__BMASK       0x80 ///< Transmit FIFO Request
#define SPI0FCN1_TFRQ__SHIFT       0x07 ///< Transmit FIFO Request
#define SPI0FCN1_TFRQ__NOT_SET     0x00 ///< The number of bytes in the TX FIFO is greater than
                                        ///< TXTH.
#define SPI0FCN1_TFRQ__SET         0x80 ///< The number of bytes in the TX FIFO is less than or
                                        ///< equal to TXTH.

//------------------------------------------------------------------------------
// SPI0FCT Enums (SPI0 FIFO Count @ 0xF7)
//------------------------------------------------------------------------------
#define SPI0FCT_RXCNT__FMASK 0x03 ///< RX FIFO Count
#define SPI0FCT_RXCNT__SHIFT 0x00 ///< RX FIFO Count

#define SPI0FCT_TXCNT__FMASK 0x30 ///< TX FIFO Count
#define SPI0FCT_TXCNT__SHIFT 0x04 ///< TX FIFO Count

//------------------------------------------------------------------------------
// SPI0PCF Enums (SPI0 Pin Configuration @ 0xDF)
//------------------------------------------------------------------------------
#define SPI0PCF_SISEL__FMASK     0x03 ///< Slave MOSI Input Select
#define SPI0PCF_SISEL__SHIFT     0x00 ///< Slave MOSI Input Select
#define SPI0PCF_SISEL__CROSSBAR  0x00 ///< The crossbar input is the MOSI input (slave mode).
#define SPI0PCF_SISEL__CLU0      0x01 ///< The CLU0 synchronous output is the MOSI input
                                      ///< (slave mode).
#define SPI0PCF_SISEL__CLU1      0x02 ///< The CLU1 synchronous output is the MOSI input
                                      ///< (slave mode).
#define SPI0PCF_SISEL__CLU3      0x03 ///< The CLU3 synchronous output is the MOSI input
                                      ///< (slave mode).

