ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define TMR4CN0_T4SPLIT__BMASK         0x08 ///< Timer 4 Split Mode Enable
#define TMR4CN0_T4SPLIT__SHIFT         0x03 ///< Timer 4 Split Mode Enable
#define TMR4CN0_T4SPLIT__16_BIT_RELOAD 0x00 ///< Timer 4 operates in 16-bit auto-reload mode.
#define TMR4CN0_T4SPLIT__8_BIT_RELOAD  0x08 ///< Timer 4 operates as two 8-bit auto-reload timers.

#define TMR4CN0_TF4CEN__BMASK          0x10 ///< Timer 4 Capture Enable
#define TMR4CN0_TF4CEN__SHIFT          0x04 ///< Timer 4 Capture Enable
#define TMR4CN0_TF4CEN__DISABLED       0x00 ///< Disable capture mode.
#define TMR4CN0_TF4CEN__ENABLED        0x10 ///< Enable capture mode.

#define TMR4CN0_TF4LEN__BMASK          0x20 ///< Timer 4 Low Byte Interrupt Enable
#define TMR4CN0_TF4LEN__SHIFT          0x05 ///< Timer 4 Low Byte Interrupt Enable
#define TMR4CN0_TF4LEN__DISABLED       0x00 ///< Disable low byte interrupts.
#define TMR4CN0_TF4LEN__ENABLED        0x20 ///< Enable low byte interrupts.

#define TMR4CN0_TF4L__BMASK            0x40 ///< Timer 4 Low Byte Overflow Flag
#define TMR4CN0_TF4L__SHIFT            0x06 ///< Timer 4 Low Byte Overflow Flag
#define TMR4CN0_TF4L__NOT_SET          0x00 ///< Timer 4 low byte did not overflow.
#define TMR4CN0_TF4L__SET              0x40 ///< Timer 4 low byte overflowed.

#define TMR4CN0_TF4H__BMASK            0x80 ///< Timer 4 High Byte Overflow Flag
#define TMR4CN0_TF4H__SHIFT            0x07 ///< Timer 4 High Byte Overflow Flag
#define TMR4CN0_TF4H__NOT_SET          0x00 ///< Timer 4 8-bit high byte or 16-bit value did not
                                            ///< overflow.
#define TMR4CN0_TF4H__SET              0x80 ///< Timer 4 8-bit high byte or 16-bit value
                                            ///< overflowed.

//------------------------------------------------------------------------------
// TMR4CN1 Enums (Timer 4 Control 1 @ 0xFF)
//------------------------------------------------------------------------------
#define TMR4CN1_T4CSEL__FMASK       0x07 ///< Timer 4 Capture Select
#define TMR4CN1_T4CSEL__SHIFT       0x00 ///< Timer 4 Capture Select
#define TMR4CN1_T4CSEL__PIN         0x00 ///< Capture high-to-low transitions on the T2 input
                                         ///< pin.
#define TMR4CN1_T4CSEL__LFOSC       0x01 ///< Capture high-to-low transitions of the LFO
                                         ///< oscillator.
#define TMR4CN1_T4CSEL__COMPARATOR0 0x02 ///< Capture high-to-low transitions of the Comparator
                                         ///< 0 output.
#define TMR4CN1_T4CSEL__USB_SOF     0x03 ///< Capture USB start-of-frame (SOF) events.
#define TMR4CN1_T4CSEL__CLU0_OUT    0x04 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 0 synchronous output.
#define TMR4CN1_T4CSEL__CLU1_OUT    0x05 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 1 synchronous output.
#define TMR4CN1_T4CSEL__CLU2_OUT    0x06 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 2 synchronous output.
#define TMR4CN1_T4CSEL__CLU3_OUT    0x07 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 3 synchronous output.

#define TMR4CN1_STSYNC__BMASK       0x10 ///< Suspend Timer Synchronization Status
#define TMR4CN1_STSYNC__SHIFT       0x04 ///< Suspend Timer Synchronization Status
#define TMR4CN1_STSYNC__NOT_SET     0x00 ///< It is safe to read and write the timer registers.
#define TMR4CN1_STSYNC__SET         0x10 ///< Reads and writes of the timer register should not
                                         ///< be performed

#define TMR4CN1_RLFSEL__FMASK       0xE0 ///< Force Reload Select
#define TMR4CN1_RLFSEL__SHIFT       0x05 ///< Force Reload Select
#define TMR4CN1_RLFSEL__CLU0_OUT    0x20 ///< Timer will reload on overflow events and CLU0
                                         ///< synchronous output high.
#define TMR4CN1_RLFSEL__CLU1_OUT    0x40 ///< Timer will reload on overflow events and CLU1
                                         ///< synchronous output high.
#define TMR4CN1_RLFSEL__CLU2_OUT    0x60 ///< Timer will reload on overflow events and CLU2
                                         ///< synchronous output high.
#define TMR4CN1_RLFSEL__NONE        0x80 ///< Timer will only reload on overflow events.

//------------------------------------------------------------------------------
// TMR4H Enums (Timer 4 High Byte @ 0xA5)
//------------------------------------------------------------------------------
#define TMR4H_TMR4H__FMASK 0xFF ///< Timer 4 High Byte
#define TMR4H_TMR4H__SHIFT 0x00 ///< Timer 4 High Byte

//------------------------------------------------------------------------------
// TMR4L Enums (Timer 4 Low Byte @ 0xA4)
//------------------------------------------------------------------------------
#define TMR4L_TMR4L__FMASK 0xFF ///< Timer 4 Low Byte
#define TMR4L_TMR4L__SHIFT 0x00 ///< Timer 4 Low Byte

//------------------------------------------------------------------------------
// TMR4RLH Enums (Timer 4 Reload High Byte @ 0xA3)
//------------------------------------------------------------------------------
#define TMR4RLH_TMR4RLH__FMASK 0xFF ///< Timer 4 Reload High Byte
#define TMR4RLH_TMR4RLH__SHIFT 0x00 ///< Timer 4 Reload High Byte

//------------------------------------------------------------------------------
// TMR4RLL Enums (Timer 4 Reload Low Byte @ 0xA2)
//------------------------------------------------------------------------------
#define TMR4RLL_TMR4RLL__FMASK 0xFF ///< Timer 4 Reload Low Byte
#define TMR4RLL_TMR4RLL__SHIFT 0x00 ///< Timer 4 Reload Low Byte

//------------------------------------------------------------------------------
// TMR5CN0 Enums (Timer 5 Control 0 @ 0xC0)
//------------------------------------------------------------------------------
#define TMR5CN0_T5XCLK__FMASK          0x03 ///< Timer 5 External Clock Select
#define TMR5CN0_T5XCLK__SHIFT          0x00 ///< Timer 5 External Clock Select
#define TMR5CN0_T5XCLK__SYSCLK_DIV_12  0x00 ///< Timer 5 clock is the system clock divided by 12.
#define TMR5CN0_T5XCLK__EXTOSC_DIV_8   0x01 ///< Timer 5 clock is the external oscillator divided
                                            ///< by 8 (synchronized with SYSCLK when not in suspend
                                            ///< or snooze mode).

#define TMR5CN0_TR5__BMASK             0x04 ///< Timer 5 Run Control
#define TMR5CN0_TR5__SHIFT             0x02 ///< Timer 5 Run Control
#define TMR5CN0_TR5__STOP              0x00 ///< Stop Timer 5.
#define TMR5CN0_TR5__RUN               0x04 ///< Start Timer 5 running.

