ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define TMR5CN0_T5SPLIT__BMASK         0x08 ///< Timer 5 Split Mode Enable
#define TMR5CN0_T5SPLIT__SHIFT         0x03 ///< Timer 5 Split Mode Enable
#define TMR5CN0_T5SPLIT__16_BIT_RELOAD 0x00 ///< Timer 5 operates in 16-bit auto-reload mode.
#define TMR5CN0_T5SPLIT__8_BIT_RELOAD  0x08 ///< Timer 5 operates as two 8-bit auto-reload timers.

#define TMR5CN0_TF5CEN__BMASK          0x10 ///< Timer 5 Capture Enable
#define TMR5CN0_TF5CEN__SHIFT          0x04 ///< Timer 5 Capture Enable
#define TMR5CN0_TF5CEN__DISABLED       0x00 ///< Disable capture mode.
#define TMR5CN0_TF5CEN__ENABLED        0x10 ///< Enable capture mode.

#define TMR5CN0_TF5LEN__BMASK          0x20 ///< Timer 5 Low Byte Interrupt Enable
#define TMR5CN0_TF5LEN__SHIFT          0x05 ///< Timer 5 Low Byte Interrupt Enable
#define TMR5CN0_TF5LEN__DISABLED       0x00 ///< Disable low byte interrupts.
#define TMR5CN0_TF5LEN__ENABLED        0x20 ///< Enable low byte interrupts.

#define TMR5CN0_TF5L__BMASK            0x40 ///< Timer 5 Low Byte Overflow Flag
#define TMR5CN0_TF5L__SHIFT            0x06 ///< Timer 5 Low Byte Overflow Flag
#define TMR5CN0_TF5L__NOT_SET          0x00 ///< Timer 5 low byte did not overflow.
#define TMR5CN0_TF5L__SET              0x40 ///< Timer 5 low byte overflowed.

#define TMR5CN0_TF5H__BMASK            0x80 ///< Timer 5 High Byte Overflow Flag
#define TMR5CN0_TF5H__SHIFT            0x07 ///< Timer 5 High Byte Overflow Flag
#define TMR5CN0_TF5H__NOT_SET          0x00 ///< Timer 5 8-bit high byte or 16-bit value did not
                                            ///< overflow.
#define TMR5CN0_TF5H__SET              0x80 ///< Timer 5 8-bit high byte or 16-bit value
                                            ///< overflowed.

//------------------------------------------------------------------------------
// TMR5CN1 Enums (Timer 5 Control 1 @ 0xF1)
//------------------------------------------------------------------------------
#define TMR5CN1_T5CSEL__FMASK       0x07 ///< Timer 5 Capture Select
#define TMR5CN1_T5CSEL__SHIFT       0x00 ///< Timer 5 Capture Select
#define TMR5CN1_T5CSEL__PIN         0x00 ///< Capture high-to-low transitions on the T2 input
                                         ///< pin.
#define TMR5CN1_T5CSEL__LFOSC       0x01 ///< Capture high-to-low transitions of the LFO
                                         ///< oscillator.
#define TMR5CN1_T5CSEL__COMPARATOR0 0x02 ///< Capture high-to-low transitions of the Comparator
                                         ///< 0 output.
#define TMR5CN1_T5CSEL__USB_SOF     0x03 ///< Capture USB start-of-frame (SOF) events.
#define TMR5CN1_T5CSEL__CLU0_OUT    0x04 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 0 synchronous output.
#define TMR5CN1_T5CSEL__CLU1_OUT    0x05 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 1 synchronous output.
#define TMR5CN1_T5CSEL__CLU2_OUT    0x06 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 2 synchronous output.
#define TMR5CN1_T5CSEL__CLU3_OUT    0x07 ///< Capture high-to-low transitions on the
                                         ///< configurable logic unit 3 synchronous output.

#define TMR5CN1_RLFSEL__FMASK       0xE0 ///< Force Reload Select
#define TMR5CN1_RLFSEL__SHIFT       0x05 ///< Force Reload Select
#define TMR5CN1_RLFSEL__CLU0_OUT    0x20 ///< Timer will reload on overflow events and CLU0
                                         ///< synchronous output high.
#define TMR5CN1_RLFSEL__CLU1_OUT    0x40 ///< Timer will reload on overflow events and CLU1
                                         ///< synchronous output high.
#define TMR5CN1_RLFSEL__CLU3_OUT    0x60 ///< Timer will reload on overflow events and CLU3
                                         ///< synchronous output high.

//------------------------------------------------------------------------------
// TMR5H Enums (Timer 5 High Byte @ 0xD5)
//------------------------------------------------------------------------------
#define TMR5H_TMR5H__FMASK 0xFF ///< Timer 5 High Byte
#define TMR5H_TMR5H__SHIFT 0x00 ///< Timer 5 High Byte

//------------------------------------------------------------------------------
// TMR5L Enums (Timer 5 Low Byte @ 0xD4)
//------------------------------------------------------------------------------
#define TMR5L_TMR5L__FMASK 0xFF ///< Timer 5 Low Byte
#define TMR5L_TMR5L__SHIFT 0x00 ///< Timer 5 Low Byte

//------------------------------------------------------------------------------
// TMR5RLH Enums (Timer 5 Reload High Byte @ 0xD3)
//------------------------------------------------------------------------------
#define TMR5RLH_TMR5RLH__FMASK 0xFF ///< Timer 5 Reload High Byte
#define TMR5RLH_TMR5RLH__SHIFT 0x00 ///< Timer 5 Reload High Byte

//------------------------------------------------------------------------------
// TMR5RLL Enums (Timer 5 Reload Low Byte @ 0xD2)
//------------------------------------------------------------------------------
#define TMR5RLL_TMR5RLL__FMASK 0xFF ///< Timer 5 Reload Low Byte
#define TMR5RLL_TMR5RLL__SHIFT 0x00 ///< Timer 5 Reload Low Byte

//------------------------------------------------------------------------------
// CKCON0 Enums (Clock Control 0 @ 0x8E)
//------------------------------------------------------------------------------
#define CKCON0_SCA__FMASK           0x03 ///< Timer 0/1 Prescale
#define CKCON0_SCA__SHIFT           0x00 ///< Timer 0/1 Prescale
#define CKCON0_SCA__SYSCLK_DIV_12   0x00 ///< System clock divided by 12.
#define CKCON0_SCA__SYSCLK_DIV_4    0x01 ///< System clock divided by 4.
#define CKCON0_SCA__SYSCLK_DIV_48   0x02 ///< System clock divided by 48.
#define CKCON0_SCA__EXTOSC_DIV_8    0x03 ///< External oscillator divided by 8 (synchronized
                                         ///< with the system clock).

#define CKCON0_T0M__BMASK           0x04 ///< Timer 0 Clock Select
#define CKCON0_T0M__SHIFT           0x02 ///< Timer 0 Clock Select
#define CKCON0_T0M__PRESCALE        0x00 ///< Counter/Timer 0 uses the clock defined by the
                                         ///< prescale field, SCA.
#define CKCON0_T0M__SYSCLK          0x04 ///< Counter/Timer 0 uses the system clock.

#define CKCON0_T1M__BMASK           0x08 ///< Timer 1 Clock Select
#define CKCON0_T1M__SHIFT           0x03 ///< Timer 1 Clock Select
#define CKCON0_T1M__PRESCALE        0x00 ///< Timer 1 uses the clock defined by the prescale
                                         ///< field, SCA.
#define CKCON0_T1M__SYSCLK          0x08 ///< Timer 1 uses the system clock.

