ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define CKCON0_T2ML__BMASK          0x10 ///< Timer 2 Low Byte Clock Select
#define CKCON0_T2ML__SHIFT          0x04 ///< Timer 2 Low Byte Clock Select
#define CKCON0_T2ML__EXTERNAL_CLOCK 0x00 ///< Timer 2 low byte uses the clock defined by T2XCLK
                                         ///< in TMR2CN0.
#define CKCON0_T2ML__SYSCLK         0x10 ///< Timer 2 low byte uses the system clock.

#define CKCON0_T2MH__BMASK          0x20 ///< Timer 2 High Byte Clock Select
#define CKCON0_T2MH__SHIFT          0x05 ///< Timer 2 High Byte Clock Select
#define CKCON0_T2MH__EXTERNAL_CLOCK 0x00 ///< Timer 2 high byte uses the clock defined by T2XCLK
                                         ///< in TMR2CN0.
#define CKCON0_T2MH__SYSCLK         0x20 ///< Timer 2 high byte uses the system clock.

#define CKCON0_T3ML__BMASK          0x40 ///< Timer 3 Low Byte Clock Select
#define CKCON0_T3ML__SHIFT          0x06 ///< Timer 3 Low Byte Clock Select
#define CKCON0_T3ML__EXTERNAL_CLOCK 0x00 ///< Timer 3 low byte uses the clock defined by T3XCLK
                                         ///< in TMR3CN0.
#define CKCON0_T3ML__SYSCLK         0x40 ///< Timer 3 low byte uses the system clock.

#define CKCON0_T3MH__BMASK          0x80 ///< Timer 3 High Byte Clock Select
#define CKCON0_T3MH__SHIFT          0x07 ///< Timer 3 High Byte Clock Select
#define CKCON0_T3MH__EXTERNAL_CLOCK 0x00 ///< Timer 3 high byte uses the clock defined by T3XCLK
                                         ///< in TMR3CN0.
#define CKCON0_T3MH__SYSCLK         0x80 ///< Timer 3 high byte uses the system clock.

//------------------------------------------------------------------------------
// CKCON1 Enums (Clock Control 1 @ 0xA6)
//------------------------------------------------------------------------------
#define CKCON1_T4ML__BMASK          0x01 ///< Timer 4 Low Byte Clock Select
#define CKCON1_T4ML__SHIFT          0x00 ///< Timer 4 Low Byte Clock Select
#define CKCON1_T4ML__EXTERNAL_CLOCK 0x00 ///< Timer 4 low byte uses the clock defined by T4XCLK
                                         ///< in TMR4CN0.
#define CKCON1_T4ML__SYSCLK         0x01 ///< Timer 4 low byte uses the system clock.

#define CKCON1_T4MH__BMASK          0x02 ///< Timer 4 High Byte Clock Select
#define CKCON1_T4MH__SHIFT          0x01 ///< Timer 4 High Byte Clock Select
#define CKCON1_T4MH__EXTERNAL_CLOCK 0x00 ///< Timer 4 high byte uses the clock defined by T4XCLK
                                         ///< in TMR4CN0.
#define CKCON1_T4MH__SYSCLK         0x02 ///< Timer 4 high byte uses the system clock.

#define CKCON1_T5ML__BMASK          0x04 ///< Timer 5 Low Byte Clock Select
#define CKCON1_T5ML__SHIFT          0x02 ///< Timer 5 Low Byte Clock Select
#define CKCON1_T5ML__EXTERNAL_CLOCK 0x00 ///< Timer 5 low byte uses the clock defined by T5XCLK
                                         ///< in TMR5CN0.
#define CKCON1_T5ML__SYSCLK         0x04 ///< Timer 5 low byte uses the system clock.

#define CKCON1_T5MH__BMASK          0x08 ///< Timer 5 High Byte Clock Select
#define CKCON1_T5MH__SHIFT          0x03 ///< Timer 5 High Byte Clock Select
#define CKCON1_T5MH__EXTERNAL_CLOCK 0x00 ///< Timer 5 high byte uses the clock defined by T5XCLK
                                         ///< in TMR5CN0.
#define CKCON1_T5MH__SYSCLK         0x08 ///< Timer 5 high byte uses the system clock.

//------------------------------------------------------------------------------
// TCON Enums (Timer 0/1 Control @ 0x88)
//------------------------------------------------------------------------------
#define TCON_IT0__BMASK   0x01 ///< Interrupt 0 Type Select
#define TCON_IT0__SHIFT   0x00 ///< Interrupt 0 Type Select
#define TCON_IT0__LEVEL   0x00 ///< INT0 is level triggered.
#define TCON_IT0__EDGE    0x01 ///< INT0 is edge triggered.

#define TCON_IE0__BMASK   0x02 ///< External Interrupt 0
#define TCON_IE0__SHIFT   0x01 ///< External Interrupt 0
#define TCON_IE0__NOT_SET 0x00 ///< Edge/level not detected.
#define TCON_IE0__SET     0x02 ///< Edge/level detected

#define TCON_IT1__BMASK   0x04 ///< Interrupt 1 Type Select
#define TCON_IT1__SHIFT   0x02 ///< Interrupt 1 Type Select
#define TCON_IT1__LEVEL   0x00 ///< INT1 is level triggered.
#define TCON_IT1__EDGE    0x04 ///< INT1 is edge triggered.

#define TCON_IE1__BMASK   0x08 ///< External Interrupt 1
#define TCON_IE1__SHIFT   0x03 ///< External Interrupt 1
#define TCON_IE1__NOT_SET 0x00 ///< Edge/level not detected.
#define TCON_IE1__SET     0x08 ///< Edge/level detected

#define TCON_TR0__BMASK   0x10 ///< Timer 0 Run Control
#define TCON_TR0__SHIFT   0x04 ///< Timer 0 Run Control
#define TCON_TR0__STOP    0x00 ///< Stop Timer 0.
#define TCON_TR0__RUN     0x10 ///< Start Timer 0 running.

#define TCON_TF0__BMASK   0x20 ///< Timer 0 Overflow Flag
#define TCON_TF0__SHIFT   0x05 ///< Timer 0 Overflow Flag
#define TCON_TF0__NOT_SET 0x00 ///< Timer 0 did not overflow.
#define TCON_TF0__SET     0x20 ///< Timer 0 overflowed.

#define TCON_TR1__BMASK   0x40 ///< Timer 1 Run Control
#define TCON_TR1__SHIFT   0x06 ///< Timer 1 Run Control
#define TCON_TR1__STOP    0x00 ///< Stop Timer 1.
#define TCON_TR1__RUN     0x40 ///< Start Timer 1 running.

#define TCON_TF1__BMASK   0x80 ///< Timer 1 Overflow Flag
#define TCON_TF1__SHIFT   0x07 ///< Timer 1 Overflow Flag
#define TCON_TF1__NOT_SET 0x00 ///< Timer 1 did not overflow.
#define TCON_TF1__SET     0x80 ///< Timer 1 overflowed.

//------------------------------------------------------------------------------
// TMOD Enums (Timer 0/1 Mode @ 0x89)
//------------------------------------------------------------------------------
#define TMOD_T0M__FMASK      0x03 ///< Timer 0 Mode Select
#define TMOD_T0M__SHIFT      0x00 ///< Timer 0 Mode Select
#define TMOD_T0M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer
#define TMOD_T0M__MODE1      0x01 ///< Mode 1, 16-bit Counter/Timer
#define TMOD_T0M__MODE2      0x02 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload
#define TMOD_T0M__MODE3      0x03 ///< Mode 3, Two 8-bit Counter/Timers

#define TMOD_CT0__BMASK      0x04 ///< Counter/Timer 0 Select
#define TMOD_CT0__SHIFT      0x02 ///< Counter/Timer 0 Select
#define TMOD_CT0__TIMER      0x00 ///< Timer Mode. Timer 0 increments on the clock
                                  ///< defined by T0M in the CKCON0 register.
#define TMOD_CT0__COUNTER    0x04 ///< Counter Mode. Timer 0 increments on high-to-low
                                  ///< transitions of an external pin (T0).

#define TMOD_GATE0__BMASK    0x08 ///< Timer 0 Gate Control
#define TMOD_GATE0__SHIFT    0x03 ///< Timer 0 Gate Control
#define TMOD_GATE0__DISABLED 0x00 ///< Timer 0 enabled when TR0 = 1 irrespective of INT0
                                  ///< logic level.
#define TMOD_GATE0__ENABLED  0x08 ///< Timer 0 enabled only when TR0 = 1 and INT0 is
                                  ///< active as defined by bit IN0PL in register IT01CF.

#define TMOD_T1M__FMASK      0x30 ///< Timer 1 Mode Select
#define TMOD_T1M__SHIFT      0x04 ///< Timer 1 Mode Select
#define TMOD_T1M__MODE0      0x00 ///< Mode 0, 13-bit Counter/Timer
#define TMOD_T1M__MODE1      0x10 ///< Mode 1, 16-bit Counter/Timer
#define TMOD_T1M__MODE2      0x20 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload
#define TMOD_T1M__MODE3      0x30 ///< Mode 3, Timer 1 Inactive

#define TMOD_CT1__BMASK      0x40 ///< Counter/Timer 1 Select
#define TMOD_CT1__SHIFT      0x06 ///< Counter/Timer 1 Select
#define TMOD_CT1__TIMER      0x00 ///< Timer Mode. Timer 1 increments on the clock
                                  ///< defined by T1M in the CKCON0 register.
#define TMOD_CT1__COUNTER    0x40 ///< Counter Mode. Timer 1 increments on high-to-low
                                  ///< transitions of an external pin (T1).

#define TMOD_GATE1__BMASK    0x80 ///< Timer 1 Gate Control
#define TMOD_GATE1__SHIFT    0x07 ///< Timer 1 Gate Control
#define TMOD_GATE1__DISABLED 0x00 ///< Timer 1 enabled when TR1 = 1 irrespective of INT1
                                  ///< logic level.
#define TMOD_GATE1__ENABLED  0x80 ///< Timer 1 enabled only when TR1 = 1 and INT1 is
                                  ///< active as defined by bit IN1PL in register IT01CF.

//------------------------------------------------------------------------------
// SBCON1 Enums (UART1 Baud Rate Generator Control @ 0x94)
//------------------------------------------------------------------------------
#define SBCON1_BPS__FMASK     0x07 ///< Baud Rate Prescaler Select
#define SBCON1_BPS__SHIFT     0x00 ///< Baud Rate Prescaler Select
#define SBCON1_BPS__DIV_BY_12 0x00 ///< Prescaler = 12.
#define SBCON1_BPS__DIV_BY_4  0x01 ///< Prescaler = 4.
#define SBCON1_BPS__DIV_BY_48 0x02 ///< Prescaler = 48.
#define SBCON1_BPS__DIV_BY_1  0x03 ///< Prescaler = 1.
#define SBCON1_BPS__DIV_BY_8  0x04 ///< Prescaler = 8.
#define SBCON1_BPS__DIV_BY_16 0x05 ///< Prescaler = 16.
#define SBCON1_BPS__DIV_BY_24 0x06 ///< Prescaler = 24.
#define SBCON1_BPS__DIV_BY_32 0x07 ///< Prescaler = 32.

