ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define UART1LIN_BREAKDN__BMASK      0x40 ///< LIN Break Done Flag
#define UART1LIN_BREAKDN__SHIFT      0x06 ///< LIN Break Done Flag
#define UART1LIN_BREAKDN__NOT_SET    0x00 ///< A LIN break has not been detected.
#define UART1LIN_BREAKDN__BREAK      0x40 ///< A LIN break was detected since the flag was last
                                          ///< cleared.

#define UART1LIN_AUTOBDE__BMASK      0x80 ///< Auto Baud Detection Enable
#define UART1LIN_AUTOBDE__SHIFT      0x07 ///< Auto Baud Detection Enable
#define UART1LIN_AUTOBDE__DISABLED   0x00 ///< Autobaud is not enabled.
#define UART1LIN_AUTOBDE__ENABLED    0x80 ///< Autobaud is enabled.

//------------------------------------------------------------------------------
// UART1PCF Enums (UART1 Configuration @ 0xDA)
//------------------------------------------------------------------------------
#define UART1PCF_RXSEL__FMASK    0x03 ///< RX Source Select
#define UART1PCF_RXSEL__SHIFT    0x00 ///< RX Source Select
#define UART1PCF_RXSEL__CROSSBAR 0x00 ///< The crossbar input is UART1 RX.
#define UART1PCF_RXSEL__CLU0     0x01 ///< The CLU0 synchronous output is UART1 RX.
#define UART1PCF_RXSEL__CLU1     0x02 ///< The CLU1 synchronous output is UART1 RX.
#define UART1PCF_RXSEL__CLU2     0x03 ///< The CLU2 synchronous output is UART1 RX.

//------------------------------------------------------------------------------
// CLKREC Enums (USB0 Clock Recovery Control @ 0x0F)
//------------------------------------------------------------------------------
#define CLKREC_CRLOW__BMASK      0x20 ///< Low Speed Clock Recovery Mode
#define CLKREC_CRLOW__SHIFT      0x05 ///< Low Speed Clock Recovery Mode
#define CLKREC_CRLOW__FULL_SPEED 0x00 ///< Full Speed Mode.
#define CLKREC_CRLOW__LOW_SPEED  0x20 ///< Low Speed Mode.

#define CLKREC_CRSSEN__BMASK     0x40 ///< Clock Recovery Single Step
#define CLKREC_CRSSEN__SHIFT     0x06 ///< Clock Recovery Single Step
#define CLKREC_CRSSEN__DISABLED  0x00 ///< Disable single-step mode (normal calibration
                                      ///< mode).
#define CLKREC_CRSSEN__ENABLED   0x40 ///< Enable single-step mode.

#define CLKREC_CRE__BMASK        0x80 ///< Clock Recovery Enable
#define CLKREC_CRE__SHIFT        0x07 ///< Clock Recovery Enable
#define CLKREC_CRE__DISABLED     0x00 ///< Disable clock recovery.
#define CLKREC_CRE__ENABLED      0x80 ///< Enable clock recovery.

//------------------------------------------------------------------------------
// CMIE Enums (USB0 Common Interrupt Enable @ 0x0B)
//------------------------------------------------------------------------------
#define CMIE_SUSINTE__BMASK    0x01 ///< Suspend Interrupt Enable
#define CMIE_SUSINTE__SHIFT    0x00 ///< Suspend Interrupt Enable
#define CMIE_SUSINTE__DISABLED 0x00 ///< Disable suspend interrupts.
#define CMIE_SUSINTE__ENABLED  0x01 ///< Enable suspend interrupts.

#define CMIE_RSUINTE__BMASK    0x02 ///< Resume Interrupt Enable
#define CMIE_RSUINTE__SHIFT    0x01 ///< Resume Interrupt Enable
#define CMIE_RSUINTE__DISABLED 0x00 ///< Disable resume interrupts.
#define CMIE_RSUINTE__ENABLED  0x02 ///< Enable resume interrupts.

#define CMIE_RSTINTE__BMASK    0x04 ///< Reset Interrupt Enable
#define CMIE_RSTINTE__SHIFT    0x02 ///< Reset Interrupt Enable
#define CMIE_RSTINTE__DISABLED 0x00 ///< Disable reset interrupts.
#define CMIE_RSTINTE__ENABLED  0x04 ///< Enable reset interrupts.

#define CMIE_SOFE__BMASK       0x08 ///< Start of Frame Interrupt Enable
#define CMIE_SOFE__SHIFT       0x03 ///< Start of Frame Interrupt Enable
#define CMIE_SOFE__DISABLED    0x00 ///< Disable SOF interrupts.
#define CMIE_SOFE__ENABLED     0x08 ///< Enable SOF interrupts.

//------------------------------------------------------------------------------
// CMINT Enums (USB0 Common Interrupt @ 0x06)
//------------------------------------------------------------------------------
#define CMINT_SUSINT__BMASK   0x01 ///< Suspend Interrupt Flag
#define CMINT_SUSINT__SHIFT   0x00 ///< Suspend Interrupt Flag
#define CMINT_SUSINT__NOT_SET 0x00 ///< Suspend interrupt inactive.
#define CMINT_SUSINT__SET     0x01 ///< Suspend interrupt active.

#define CMINT_RSUINT__BMASK   0x02 ///< Resume Interrupt Flag
#define CMINT_RSUINT__SHIFT   0x01 ///< Resume Interrupt Flag
#define CMINT_RSUINT__NOT_SET 0x00 ///< Resume interrupt inactive.
#define CMINT_RSUINT__SET     0x02 ///< Resume interrupt active.

#define CMINT_RSTINT__BMASK   0x04 ///< Reset Interrupt Flag
#define CMINT_RSTINT__SHIFT   0x02 ///< Reset Interrupt Flag
#define CMINT_RSTINT__NOT_SET 0x00 ///< Reset interrupt inactive.
#define CMINT_RSTINT__SET     0x04 ///< Reset interrupt active.

#define CMINT_SOF__BMASK      0x08 ///< Start of Frame Interrupt Flag
#define CMINT_SOF__SHIFT      0x03 ///< Start of Frame Interrupt Flag
#define CMINT_SOF__NOT_SET    0x00 ///< SOF interrupt inactive.
#define CMINT_SOF__SET        0x08 ///< SOF interrupt active.

//------------------------------------------------------------------------------
// E0CNT Enums (USB0 Endpoint0 Data Count @ 0x16)
//------------------------------------------------------------------------------
#define E0CNT_E0CNT__FMASK 0x7F ///< Endpoint 0 Data Count
#define E0CNT_E0CNT__SHIFT 0x00 ///< Endpoint 0 Data Count

//------------------------------------------------------------------------------
// E0CSR Enums (USB0 Endpoint0 Control @ 0x11)
//------------------------------------------------------------------------------
#define E0CSR_OPRDY__BMASK     0x01 ///< OUT Packet Ready
#define E0CSR_OPRDY__SHIFT     0x00 ///< OUT Packet Ready
#define E0CSR_OPRDY__NOT_SET   0x00 ///< A data packet has not been received.
#define E0CSR_OPRDY__SET       0x01 ///< A data packet has been received.

#define E0CSR_INPRDY__BMASK    0x02 ///< IN Packet Ready
#define E0CSR_INPRDY__SHIFT    0x01 ///< IN Packet Ready
#define E0CSR_INPRDY__NOT_SET  0x00 ///< An IN packet is not ready to transmit.
#define E0CSR_INPRDY__SET      0x02 ///< An IN packet is ready to transmit.

#define E0CSR_STSTL__BMASK     0x04 ///< Sent Stall
#define E0CSR_STSTL__SHIFT     0x02 ///< Sent Stall
#define E0CSR_STSTL__NOT_SET   0x00 ///< A STALL handshake signal was not transmitted.
#define E0CSR_STSTL__SET       0x04 ///< A STALL handshake signal was transmitted.

#define E0CSR_DATAEND__BMASK   0x08 ///< Data End
#define E0CSR_DATAEND__SHIFT   0x03 ///< Data End
#define E0CSR_DATAEND__NOT_SET 0x00 ///< This is not the last data packet.
#define E0CSR_DATAEND__SET     0x08 ///< This is the last data packet.

#define E0CSR_SUEND__BMASK     0x10 ///< Setup End
#define E0CSR_SUEND__SHIFT     0x04 ///< Setup End
#define E0CSR_SUEND__NOT_SET   0x00 ///< A control transaction did not end before firmware
                                    ///< wrote a 1 to the DATAEND bit.
#define E0CSR_SUEND__SET       0x10 ///< A control transaction ended before firmware wrote
                                    ///< a 1 to the DATAEND bit.

#define E0CSR_SDSTL__BMASK     0x20 ///< Send Stall
#define E0CSR_SDSTL__SHIFT     0x05 ///< Send Stall
#define E0CSR_SDSTL__NOT_SET   0x00 ///< Do not send a STALL.
#define E0CSR_SDSTL__SET       0x20 ///< Send a STALL.

#define E0CSR_SOPRDY__BMASK    0x40 ///< Serviced OPRDY
#define E0CSR_SOPRDY__SHIFT    0x06 ///< Serviced OPRDY
#define E0CSR_SOPRDY__NOT_SET  0x00 ///< OUT packet has not been serviced.
#define E0CSR_SOPRDY__SET      0x40 ///< OUT packet has been serviced.

