ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define USB0ADR_BUSY__BMASK             0x80 ///< USB0 Register Read Busy Flag
#define USB0ADR_BUSY__SHIFT             0x07 ///< USB0 Register Read Busy Flag
#define USB0ADR_BUSY__NOT_SET           0x00 ///< A read is not in progress.
#define USB0ADR_BUSY__SET               0x80 ///< Initiate a read or a read is in progress.

//------------------------------------------------------------------------------
// USB0AEC Enums (USB0 Advanced Energy Control @ 0xB2)
//------------------------------------------------------------------------------
#define USB0AEC_LEMCN__FMASK             0x03 ///< Low Energy Mode Control
#define USB0AEC_LEMCN__SHIFT             0x00 ///< Low Energy Mode Control
#define USB0AEC_LEMCN__DISABLED          0x00 ///< LE mode is disabled.
#define USB0AEC_LEMCN__IDLE              0x01 ///< LE takes effect only during idle bus times.
#define USB0AEC_LEMCN__NAK_OUT           0x02 ///< LE takes effect only during NAKed OUT packets.
#define USB0AEC_LEMCN__ALL               0x03 ///< LE takes effect during idle bus and NAKed OUT
                                              ///< packets.

#define USB0AEC_OSCMD__FMASK             0x30 ///< Low Energy Mode Oscillator Control
#define USB0AEC_OSCMD__SHIFT             0x04 ///< Low Energy Mode Oscillator Control
#define USB0AEC_OSCMD__OSC_GATED_SUSPEND 0x00 ///< The USB clock source is selectively gated by LE
                                              ///< mode, and the High-Frequency Oscillator (HFOSC1)
                                              ///< is suspended if possible.
#define USB0AEC_OSCMD__OSC_GATED         0x10 ///< The USB clock source is selectively gated by LE
                                              ///< mode. There is no effect to HFOSC1.
#define USB0AEC_OSCMD__OSC_ON            0x30 ///< LE mode has no effect on either the USB clock or
                                              ///< HFOSC1.

#define USB0AEC_XCVRMD__BMASK            0x40 ///< Transceiver Mode
#define USB0AEC_XCVRMD__SHIFT            0x06 ///< Transceiver Mode
#define USB0AEC_XCVRMD__LOW_POWER        0x00 ///< The USB transceiver is selectively put into a
                                              ///< lower power state when low energy mode is active.
#define USB0AEC_XCVRMD__NORMAL_POWER     0x40 ///< The USB transceiver is not affected by low energy
                                              ///< mode.

#define USB0AEC_LEMSTA__BMASK            0x80 ///< Low Energy Mode Status
#define USB0AEC_LEMSTA__SHIFT            0x07 ///< Low Energy Mode Status
#define USB0AEC_LEMSTA__OFF              0x00 ///< The USB peripheral is in normal mode.
#define USB0AEC_LEMSTA__ON               0x80 ///< The USB peripheral is in a low energy mode.

//------------------------------------------------------------------------------
// USB0CDCF Enums (USB0 Charger Detect Configuration @ 0xB6)
//------------------------------------------------------------------------------
#define USB0CDCF_DCDIE__BMASK    0x02 ///< DCD Interrupt Enable
#define USB0CDCF_DCDIE__SHIFT    0x01 ///< DCD Interrupt Enable
#define USB0CDCF_DCDIE__DISABLED 0x00 ///< DCDI will not generate charger detect interrupts.
#define USB0CDCF_DCDIE__ENABLED  0x02 ///< DCDI allowed to generate charger detect
                                      ///< interrupts.

#define USB0CDCF_PDIE__BMASK     0x04 ///< PD Interrupt Enable
#define USB0CDCF_PDIE__SHIFT     0x02 ///< PD Interrupt Enable
#define USB0CDCF_PDIE__DISABLED  0x00 ///< PDI will not generate charger detect interrupts.
#define USB0CDCF_PDIE__ENABLED   0x04 ///< PDI allowed to generate charger detect interrupts.

#define USB0CDCF_SDIE__BMASK     0x08 ///< SD Interrupt Enable
#define USB0CDCF_SDIE__SHIFT     0x03 ///< SD Interrupt Enable
#define USB0CDCF_SDIE__DISABLED  0x00 ///< SDI will not generate charger detect interrupts.
#define USB0CDCF_SDIE__ENABLED   0x08 ///< SDI allowed to generate charger detect interrupts.

//------------------------------------------------------------------------------
// USB0CDCN Enums (USB0 Charger Detect Control @ 0xBE)
//------------------------------------------------------------------------------
#define USB0CDCN_DCDEN__FMASK    0x03 ///< Data Contact Detection Enable
#define USB0CDCN_DCDEN__SHIFT    0x00 ///< Data Contact Detection Enable
#define USB0CDCN_DCDEN__DISABLED 0x00 ///< DCD is disabled.
#define USB0CDCN_DCDEN__TIMEOUT  0x02 ///< Only DCD timeout will be initiated.
#define USB0CDCN_DCDEN__ENABLED  0x03 ///< Full DCD operation (physical contact and timeout)
                                      ///< will be initiated.

#define USB0CDCN_PDEN__BMASK     0x04 ///< Primary Detection Enable
#define USB0CDCN_PDEN__SHIFT     0x02 ///< Primary Detection Enable
#define USB0CDCN_PDEN__DISABLED  0x00 ///< Disable primary detection.
#define USB0CDCN_PDEN__ENABLED   0x04 ///< Enable primary detection.

#define USB0CDCN_SDEN__BMASK     0x08 ///< Secondary Detection Enable
#define USB0CDCN_SDEN__SHIFT     0x03 ///< Secondary Detection Enable
#define USB0CDCN_SDEN__DISABLED  0x00 ///< Disable secondary detection.
#define USB0CDCN_SDEN__ENABLED   0x08 ///< Enable secondary detection.

#define USB0CDCN_CHDEN__BMASK    0x10 ///< Charger Detection Enable
#define USB0CDCN_CHDEN__SHIFT    0x04 ///< Charger Detection Enable
#define USB0CDCN_CHDEN__DISABLED 0x00 ///< Disable the charger detection block.
#define USB0CDCN_CHDEN__ENABLED  0x10 ///< Enable the charger detection block.

//------------------------------------------------------------------------------
// USB0CDSTA Enums (USB0 Charger Detect Status @ 0xBF)
//------------------------------------------------------------------------------
#define USB0CDSTA_DCDTO__BMASK      0x01 ///< Data Contact Detection Timeout
#define USB0CDSTA_DCDTO__SHIFT      0x00 ///< Data Contact Detection Timeout
#define USB0CDSTA_DCDTO__NO_TIMEOUT 0x00 ///< A DCD timeout was not triggered.
#define USB0CDSTA_DCDTO__TIMEOUT    0x01 ///< A DCD timeout was triggered.

#define USB0CDSTA_DCDI__BMASK       0x02 ///< Data Contact Detect Complete
#define USB0CDSTA_DCDI__SHIFT       0x01 ///< Data Contact Detect Complete
#define USB0CDSTA_DCDI__NOT_SET     0x00 ///< DCD operation has not completed.
#define USB0CDSTA_DCDI__SET         0x02 ///< DCD operation has completed. If DCDIE is set to 1
                                         ///< a charger detect interrupt may be generated. This
                                         ///< flag must be cleared by firmware.

#define USB0CDSTA_PDI__BMASK        0x04 ///< Primary Detection Complete
#define USB0CDSTA_PDI__SHIFT        0x02 ///< Primary Detection Complete
#define USB0CDSTA_PDI__NOT_SET      0x00 ///< PD operation has not completed.
#define USB0CDSTA_PDI__SET          0x04 ///< PD operation has completed. If PDIE is set to 1 a
                                         ///< charger detect interrupt may be generated. This
                                         ///< flag must be cleared by firmware.

#define USB0CDSTA_SDI__BMASK        0x08 ///< Secondary Detection Complete
#define USB0CDSTA_SDI__SHIFT        0x03 ///< Secondary Detection Complete
#define USB0CDSTA_SDI__NOT_SET      0x00 ///< SD operation has not completed.
#define USB0CDSTA_SDI__SET          0x08 ///< SD operation has completed. If SDIE is set to 1 a
                                         ///< charger detect interrupt may be generated. This
                                         ///< flag must be cleared by firmware.

#define USB0CDSTA_DCP__BMASK        0x10 ///< Dedicated Charging Port Detected
#define USB0CDSTA_DCP__SHIFT        0x04 ///< Dedicated Charging Port Detected
#define USB0CDSTA_DCP__NOT_DETECTED 0x00 ///< DCP was not detected.
#define USB0CDSTA_DCP__DETECTED     0x10 ///< DCP was detected.

