ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define USB0CDSTA_CDP__BMASK        0x20 ///< Charging Downstream Port Detected
#define USB0CDSTA_CDP__SHIFT        0x05 ///< Charging Downstream Port Detected
#define USB0CDSTA_CDP__NOT_DETECTED 0x00 ///< CDP was not detected.
#define USB0CDSTA_CDP__DETECTED     0x20 ///< CDP was detected.

#define USB0CDSTA_SDP__BMASK        0x40 ///< Standard Downstream Port Detected
#define USB0CDSTA_SDP__SHIFT        0x06 ///< Standard Downstream Port Detected
#define USB0CDSTA_SDP__NOT_DETECTED 0x00 ///< SDP was not detected.
#define USB0CDSTA_SDP__DETECTED     0x40 ///< SDP was detected.

#define USB0CDSTA_ERR__BMASK        0x80 ///< USB Charger Detection Error
#define USB0CDSTA_ERR__SHIFT        0x07 ///< USB Charger Detection Error
#define USB0CDSTA_ERR__NO_ERROR     0x00 ///< No error has occurred.
#define USB0CDSTA_ERR__ERROR        0x80 ///< An error has occurred. If enabled, a USB charger
                                         ///< detect interrupt will be triggered. This bit must
                                         ///< be cleared by firmware.

//------------------------------------------------------------------------------
// USB0CF Enums (USB0 Configuration @ 0xB5)
//------------------------------------------------------------------------------
#define USB0CF_USBCLK__FMASK        0x07 ///< USB0 Clock Source Select Bits
#define USB0CF_USBCLK__SHIFT        0x00 ///< USB0 Clock Source Select Bits
#define USB0CF_USBCLK__HFOSC1       0x00 ///< USB0 clock (USB0CLK) derived from High-Frequency
                                         ///< Oscillator 1 (HFOSC1).
#define USB0CF_USBCLK__HFOSC1_DIV_8 0x01 ///< USB0 clock (USB0CLK) derived from High-Frequency
                                         ///< Oscillator 1 / 8 (HFOSC1 / 8).
#define USB0CF_USBCLK__EXTOSC       0x02 ///< USB0 clock (USB0CLK) derived from the External
                                         ///< Oscillator.
#define USB0CF_USBCLK__EXTOSC_DIV_2 0x03 ///< USB0 clock (USB0CLK) derived from the External
                                         ///< Oscillator / 2.
#define USB0CF_USBCLK__EXTOSC_DIV_3 0x04 ///< USB0 clock (USB0CLK) derived from the External
                                         ///< Oscillator / 3.
#define USB0CF_USBCLK__EXTOSC_DIV_4 0x05 ///< USB0 clock (USB0CLK) derived from the External
                                         ///< Oscillator / 4.
#define USB0CF_USBCLK__LFOSC        0x06 ///< USB0 clock (USB0CLK) derived from the Internal
                                         ///< Low-Frequency Oscillator.
#define USB0CF_USBCLK__NOCLOCK      0x07 ///< USB0 clock (USB0CLK) is turned off.

#define USB0CF_VBUSI__BMASK         0x20 ///< VBUS Interrupt
#define USB0CF_VBUSI__SHIFT         0x05 ///< VBUS Interrupt
#define USB0CF_VBUSI__NOT_SET       0x00 ///< A VBUS event has not occurred.
#define USB0CF_VBUSI__SET           0x20 ///< A VBUS event has occurred.

#define USB0CF_VBUSIE__BMASK        0x40 ///< VBUS Interrupt Enable
#define USB0CF_VBUSIE__SHIFT        0x06 ///< VBUS Interrupt Enable
#define USB0CF_VBUSIE__DISABLED     0x00 ///< The VBUS sense signal will not generate
                                         ///< interrupts.
#define USB0CF_VBUSIE__ENABLED      0x40 ///< The VBUS sense signal may generate VBUS interrupts
                                         ///< when a VBUS event is deteted. The VBUS interrupt
                                         ///< must be enabled in the main interrupt controller
                                         ///< for the interrupt to occur.

#define USB0CF_VBUSEN__BMASK        0x80 ///< VBUS Sense Enable
#define USB0CF_VBUSEN__SHIFT        0x07 ///< VBUS Sense Enable
#define USB0CF_VBUSEN__DISABLED     0x00 ///< The VBUS pin can be used as GPIO.
#define USB0CF_VBUSEN__ENABLED      0x80 ///< The VBUS pin is used to sense the USB VBUS signal
                                         ///< voltage.

//------------------------------------------------------------------------------
// USB0DAT Enums (USB0 Data @ 0xAF)
//------------------------------------------------------------------------------
#define USB0DAT_USB0DAT__FMASK 0xFF ///< USB0 Data
#define USB0DAT_USB0DAT__SHIFT 0x00 ///< USB0 Data

//------------------------------------------------------------------------------
// USB0XCN Enums (USB0 Transceiver Control @ 0xB3)
//------------------------------------------------------------------------------
#define USB0XCN_Dn__BMASK                0x01 ///< D- Signal Status
#define USB0XCN_Dn__SHIFT                0x00 ///< D- Signal Status
#define USB0XCN_Dn__LOW                  0x00 ///< D- signal currently at logic 0.
#define USB0XCN_Dn__HIGH                 0x01 ///< D- signal currently at logic 1.

#define USB0XCN_Dp__BMASK                0x02 ///< D+ Signal Status
#define USB0XCN_Dp__SHIFT                0x01 ///< D+ Signal Status
#define USB0XCN_Dp__LOW                  0x00 ///< D+ signal currently at logic 0.
#define USB0XCN_Dp__HIGH                 0x02 ///< D+ signal currently at logic 1.

#define USB0XCN_DFREC__BMASK             0x04 ///< Differential Receiver
#define USB0XCN_DFREC__SHIFT             0x02 ///< Differential Receiver
#define USB0XCN_DFREC__DIFFERENTIAL_ZERO 0x00 ///< Differential 0 signalling on the bus.
#define USB0XCN_DFREC__DIFFERENTIAL_ONE  0x04 ///< Differential 1 signalling on the bus.

#define USB0XCN_PHYTST__FMASK            0x18 ///< Physical Layer Test
#define USB0XCN_PHYTST__SHIFT            0x03 ///< Physical Layer Test
#define USB0XCN_PHYTST__MODE0            0x00 ///< Mode 0: Normal (non-test mode) (D+ = X, D- = X).
#define USB0XCN_PHYTST__MODE1            0x08 ///< Mode 1: Differential 1 forced (D+ = 1, D- = 0).
#define USB0XCN_PHYTST__MODE2            0x10 ///< Mode 2: Differential 0 forced (D+ = 0, D- = 1).
#define USB0XCN_PHYTST__MODE3            0x18 ///< Mode 3: Single-Ended 0 forced (D+ = 0, D- = 0).

#define USB0XCN_SPEED__BMASK             0x20 ///< USB0 Speed Select
#define USB0XCN_SPEED__SHIFT             0x05 ///< USB0 Speed Select
#define USB0XCN_SPEED__LOW_SPEED         0x00 ///< USB0 operates as a Low Speed device. If enabled,
                                              ///< the internal pull-up resistor appears on the D-
                                              ///< line.
#define USB0XCN_SPEED__FULL_SPEED        0x20 ///< USB0 operates as a Full Speed device. If enabled,
                                              ///< the internal pull-up resistor appears on the D+
                                              ///< line.

#define USB0XCN_PHYEN__BMASK             0x40 ///< Physical Layer Enable
#define USB0XCN_PHYEN__SHIFT             0x06 ///< Physical Layer Enable
#define USB0XCN_PHYEN__DISABLED          0x00 ///< Disable the USB0 physical layer transceiver
                                              ///< (suspend).
#define USB0XCN_PHYEN__ENABLED           0x40 ///< Enable the USB0 physical layer transceiver
                                              ///< (normal).

#define USB0XCN_PREN__BMASK              0x80 ///< Internal Pull-up Resistor Enable
#define USB0XCN_PREN__SHIFT              0x07 ///< Internal Pull-up Resistor Enable
#define USB0XCN_PREN__PULL_UP_DISABLED   0x00 ///< Internal pull-up resistor disabled (device
                                              ///< effectively detached from USB network).
#define USB0XCN_PREN__PULL_UP_ENABLED    0x80 ///< Internal pull-up resistor enabled when VBUS is
                                              ///< present (device attached to the USB network).

//------------------------------------------------------------------------------
// VDM0CN Enums (Supply Monitor Control @ 0xFF)
//------------------------------------------------------------------------------
#define VDM0CN_VDDSTAT__BMASK  0x40 ///< Supply Status
#define VDM0CN_VDDSTAT__SHIFT  0x06 ///< Supply Status
#define VDM0CN_VDDSTAT__BELOW  0x00 ///< VDD is at or below the supply monitor threshold.
#define VDM0CN_VDDSTAT__ABOVE  0x40 ///< VDD is above the supply monitor threshold.

