ian-ross/efm8-unbricker/brick-it/efm8ub3-registers.h
#define VDM0CN_VDMEN__BMASK    0x80 ///< Supply Monitor Enable
#define VDM0CN_VDMEN__SHIFT    0x07 ///< Supply Monitor Enable
#define VDM0CN_VDMEN__DISABLED 0x00 ///< Supply Monitor Disabled.
#define VDM0CN_VDMEN__ENABLED  0x80 ///< Supply Monitor Enabled.

//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_TEMPE__BMASK         0x04 ///< Temperature Sensor Enable
#define REF0CN_TEMPE__SHIFT         0x02 ///< Temperature Sensor Enable
#define REF0CN_TEMPE__TEMP_DISABLED 0x00 ///< Disable the Temperature Sensor.
#define REF0CN_TEMPE__TEMP_ENABLED  0x04 ///< Enable the Temperature Sensor.

#define REF0CN_REFSL__FMASK         0x18 ///< Voltage Reference Select
#define REF0CN_REFSL__SHIFT         0x03 ///< Voltage Reference Select
#define REF0CN_REFSL__VREF_PIN      0x00 ///< The ADC0 voltage reference is the P0.0/VREF pin.
#define REF0CN_REFSL__VDD_PIN       0x08 ///< The ADC0 voltage reference is the VDD pin.
#define REF0CN_REFSL__INTERNAL_LDO  0x10 ///< The ADC0 voltage reference is the internal 1.8 V
                                         ///< digital supply voltage.
#define REF0CN_REFSL__INTERNAL_VREF 0x18 ///< The ADC0 voltage reference is the internal voltage
                                         ///< reference.

#define REF0CN_GNDSL__BMASK         0x20 ///< Analog Ground Reference
#define REF0CN_GNDSL__SHIFT         0x05 ///< Analog Ground Reference
#define REF0CN_GNDSL__GND_PIN       0x00 ///< The ADC0 ground reference is the GND pin.
#define REF0CN_GNDSL__AGND_PIN      0x20 ///< The ADC0 ground reference is the P0.1/AGND pin.

#define REF0CN_IREFLVL__BMASK       0x80 ///< Internal Voltage Reference Level
#define REF0CN_IREFLVL__SHIFT       0x07 ///< Internal Voltage Reference Level
#define REF0CN_IREFLVL__1P65        0x00 ///< The internal reference operates at 1.65 V nominal.
#define REF0CN_IREFLVL__2P4         0x80 ///< The internal reference operates at 2.4 V nominal.

//------------------------------------------------------------------------------
// REG0CN Enums (Voltage Regulator 0 Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG0CN_STOPCF__BMASK    0x08 ///< Stop and Shutdown Mode Configuration
#define REG0CN_STOPCF__SHIFT    0x03 ///< Stop and Shutdown Mode Configuration
#define REG0CN_STOPCF__ACTIVE   0x00 ///< Regulator is still active in stop mode. Any
                                     ///< enabled reset source will reset the device.
#define REG0CN_STOPCF__SHUTDOWN 0x08 ///< Regulator is shut down in stop mode (device enters
                                     ///< Shutdown mode). Only the RSTb pin or power cycle
                                     ///< can reset the device.

//------------------------------------------------------------------------------
// REG1CN Enums (Voltage Regulator 1 Control @ 0xC6)
//------------------------------------------------------------------------------
#define REG1CN_SUSEN__BMASK      0x02 ///< Voltage Regulator 1 Suspend Enable
#define REG1CN_SUSEN__SHIFT      0x01 ///< Voltage Regulator 1 Suspend Enable
#define REG1CN_SUSEN__NORMAL     0x00 ///< The 5V regulator is in normal power mode. Normal
                                      ///< mode is the highest performance mode for the
                                      ///< regulator.
#define REG1CN_SUSEN__SUSPEND    0x02 ///< The 5V regulator is in suspend power mode. Suspend
                                      ///< mode reduces the regulator bias current, but
                                      ///< increases the response times.

#define REG1CN_BIASENB__BMASK    0x04 ///< Regulator Bias Disable
#define REG1CN_BIASENB__SHIFT    0x02 ///< Regulator Bias Disable
#define REG1CN_BIASENB__ENABLED  0x00 ///< Regulator bias is enabled.
#define REG1CN_BIASENB__DISABLED 0x04 ///< Regulator bias is disabled.

#define REG1CN_REG1ENB__BMASK    0x80 ///< Voltage Regulator 1 Disable
#define REG1CN_REG1ENB__SHIFT    0x07 ///< Voltage Regulator 1 Disable
#define REG1CN_REG1ENB__ENABLED  0x00 ///< Regulator is enabled.
#define REG1CN_REG1ENB__DISABLED 0x80 ///< Regulator is disabled.

//------------------------------------------------------------------------------
// WDTCN Enums (Watchdog Timer Control @ 0x97)
//------------------------------------------------------------------------------
#define WDTCN_WDTCN__FMASK 0xFF ///< WDT Control
#define WDTCN_WDTCN__SHIFT 0x00 ///< WDT Control

//------------------------------------------------------------------------------
// EMI0CN Enums (External Memory Interface Control @ 0xE7)
//------------------------------------------------------------------------------
#define EMI0CN_PGSEL__FMASK 0x0F ///< XRAM Page Select
#define EMI0CN_PGSEL__SHIFT 0x00 ///< XRAM Page Select

#endif // EFM8UB3_REGISTERS_H
